//鬼谷全集
var demo01 = {
    title: "鬼谷子全集",
    name: "鬼谷子-全集",
    data: [{
        title: "鬼谷子-捭阖",
        data: [
            { context: "粤若稽古，圣人之在天地间也，为众生之先。观阴阳之开阖以命物，知存亡之门户，筹策万类之终始，达人心之理，见变化之朕焉，而守司其门户。故圣人之在天下也，自古至今，其道一也。变化无穷，各有所归。或阴或阳，或柔或刚，或开或闭，或弛或张。 " },
            { context: "是故圣人一守司其门户，审察其所先后，度权量能，校其伎巧短长。夫贤、不肖、智、愚、勇、怯，有差，乃可捭，乃可阖；乃可进，乃可退；乃可贱，乃可贵：无为以牧之。审定有无与其实虚，随其嗜欲以见其志意，微排其所言，而捭反之，以求其实，实得其指，阖而捭之，以求其利。或开而示之，或阖而闭之。开而示之者，同其情也；阖而闭之者，异其诚也。可与不可，明审其计谋，以原其同异。离合有守，先从其志。" },
            { context: "即欲捭之贵周，即欲阖之贵密。周密之贵微，而与道相追。捭之者，料其情也；阖之者，结其诚也。皆见其权衡轻重，乃为之度数，圣人因而为之虑。其不中权衡度数，圣人因而自为之虑。故捭者，或捭而出之，或捭而纳之；阖者，或阖而取之，或阖而去之。捭阖者，天地之道。捭阖者，以变动阴阳，四时开闭，以化万物。纵横、反出、反覆、反忤必由此矣。" },
            { context: " 捭阖者，道之大化，说之变也；必豫审其变化，吉凶大命系焉。口者，心之门户也；心者，神之主也。志意、喜欲、思虑、智谋，此皆由门户出入，故关之以捭阖，制之以出入。捭之者，开也、言也、阳也；阖之者，闭也，默也，阴也。阴阳其和，终始其义。故言长生、安乐、富贵、尊荣、显名、爱好、财利、得意、喜欲为阳，曰“始”。故言死亡，忧患、贫贱、苦辱、弃损、亡利、失意、有害、刑戮、诛罚为阴，曰“终”。诸言法阳之类者，皆曰“始”，言善以始其事；诸言法阴之类者，皆曰“终”，言恶以终其谋。" },
            { context: " 捭阖之道，以阴阳试之，故与阳言者依崇高，与阴言者依卑小。以下求小，以高求大。由此言之，无所不出，无所不入，无所不可。可以说人，可以说家，可以说国，可以说天下。为小无内，为大无外。益损、去就、倍反，皆以阴阳御其事。阳动而行，阴止而藏；阳动而出，阴随而入。阳还终始，阴极反阳。以阳动者，德相生也；以阴静者、形相成也。以阳求阴，苞以德也；以阴结阳，施以力也；阴阳相求，由捭阖也。此天地阴阳之道，而说人之法也，为万事之先，是谓“圆方之门户”。" }
        ]
    }, {
        title: "鬼谷子-反应",
        data: [
            { context: "古之大化者，乃与无形俱生。反以观往，覆以验来；反以知古，覆以知今；反以知彼，覆以知己。动静虚实之理，不合来今，反古而求之。事有反而得覆者，圣人之意也，不可不察。" },
            { context: "人言者，动也；己默者，静也。因其言，听其辞。言有不合者，反而求之，其应必出。言有象，事有比。其有象比，以观其次。象者象其事，比者比其辞也。以无形求有声，其钓语合事，得人实也。若张置网而取兽也，多张其会而司之。道合其事，彼自出之，此钓人之网也。常持其网驱之，其言无比，乃为之变，以象动之，以报其心，见其情，随而牧之。己反往，彼覆来，言有象比，因而定基。重之袭之，反之覆之，万事不失其辞，圣人所诱愚智，事皆不疑。" },
            { context: "古善反听者，乃变鬼神以得其情。其变当也，而牧之审也。牧之不审，得情不明；得情不明，定基不审。变象比，必有反辞，以还听之。欲闻其声反默，欲张反敛，欲高反下，欲取反与。欲开情者，象而比之，以牧其辞，同声相呼，实理同归。或因此，或因彼，或以事上，或以牧下，此听真伪、知同异，得其情诈也。动作言默，与此出入，喜怒由此以见其式，皆以先定为之法则。以反求复，观其所托。故用此者，己欲平静，以听其辞，察其事，论万物，别雄雌。虽非其事，见微知类。若探人而居其内，量其能射其意也。符应不失，如腾蛇之所指，若羿之引矢。" },
            { context: "故知之始己，自知而后知人也。其相知也，若比目之鱼。其伺言也，若声之与响；见其形也，若光之与影也；其察言也，不失若磁石之取针，舌之取燔骨。其与人也微，其见情也疾。如阴与阳，如阳与阴；如圆与方，如方与圆。未见形圆以道之，既见形方以事之。进退左右，以是司之。已不先定，牧人不正，事用不巧，是谓“忘情失道”；己审先定以牧入，策而无形容，莫见其门，是谓“天神”。" },
        ]
    }, {
        title: "鬼谷子-内楗",
        data: [
            { context: "君臣上下之事，有远而亲，近而疏；就之不用，去之反求；日进前而 不御，遥闻声而相思。" },
            { context: "　事皆有内楗，素结本始。或结以道德，或结以党友，或结以财货，货 结以采色。用其意，欲入则入，欲出则出；欲亲则亲，欲疏则疏；欲 就则就；欲去则去；欲求则求，欲思则思。若蚨母之从子也；出无间 ，入无朕。独往独来，莫之能止。" },
            { context: "　内者，进说辞也。楗者，楗所谋也。欲说者务稳度，计事者务循顺。 阴虑可否，明言得失，以御其志。方来应时，以和其谋。详思来楗， 往应时当也。夫内有不合者，不可施行也。乃揣切时宜，从便所为， 以求其变。以变求内者，若管取楗。言往者，先顺辞也；说来者，以 变言也。善变者审知地势，乃通于天，以化四时，使鬼神，合于阴阳 ，而牧人民。" },
            { context: "见其谋事，知其志意。事有不合者，有所未知也。合而不结者，阳亲 而阴疏。事有不合者，圣人不为谋也。" },
            { context: "故远而亲者，有阴德也。近而疏者，志不合也。就而不用者，策不得 也。去而反求者，事中来也。日进前而不御者，施不合也。遥闻声而 相思者，合于谋待决事也。" },
            { context: "故曰：不见其类而为之者，见逆。不得其情而说之者，见非。得其情 乃制其术，此用可出可入，可楗可开。故圣人立事，以此先知而楗万 物。" },
            { context: "由夫道德仁义，礼乐忠信计谋，先取诗书，混说损益，议论去就。欲 合者用内，欲去者用外。外内者，必明道数。揣策来事，见疑决之。 策无失计，立功建德，治名入产业，曰楗而内合。上暗不治，下乱不窹，楗而反之。内自得而外不留，说而飞之，若命自来，己迎而御之 。若欲去之，因危与之。环转因化，莫知所为，退为大仪。" },
        ]
    }, {
        title: "鬼谷子-抵戏",
        data: [
            { context: "物有自然，事有合离。有近而不可见，有远而可知。近而不可见者， 不察其辞也；远而可知者，反往以验来也。" },
            { context: "戏者，罅也。罅者，涧也。涧者，成大隙也。戏始有朕，可抵而塞， 可抵而却，可抵而息，可抵而匿，可抵而得，此谓抵戏之理也。" },
            { context: "事之危也，圣人知之，独保其身；因化说事，通达计谋，以识细微。 经起秋毫之末，挥之于太山之本。其施外兆萌牙□之谋，皆由抵戏。 抵戏之隙为道术用。" },
            { context: "天下纷错，上无明主，公侯无道德，则小人谗贼，贤人不用，圣人鼠 匿，贪利诈伪者作，君臣相惑，土崩瓦解而相伐射，父子离散，乖乱 反目，是谓萌牙戏罅。圣人见萌牙戏罅，则抵之以法。世可以治，则 抵而塞之；不可治，则抵而得之；或抵如此，或抵如彼；或抵反之， 或抵覆之。五帝之政，抵而塞之；三王之事，抵而得之。诸侯相抵， 不可胜数，当此之时，能抵为右。" },
            { context: "自天地之合离终始，必有戏隙，不可不察也。察之以捭阖，能用此道 ，圣人也。圣人者，天地之使也。世无可抵，则深隐而待时；时有可 抵，则为之谋；可以上合，可以检下。能因能循，为天地守神。" },
        ]
    }, {
        title: "鬼谷子-飞箝",
        data: [
            { context: "凡度权量能，所以征远来近。立势而制事，必先察同异之计，别是非之语，见内外之辞，知有无之术；决安危之计，定亲疏之事；然后乃权量之。其有隐括，乃可征、乃可求、乃可用。引钩钳之辞，飞而钳之。钩钳之语，其说辞也，乍同乍异。其不可善者：或先征之，而后重累；或先重以累，而后毁之；或以重累为毁；或以毁为重累。其用或积财货、琦玮、珠玉、白璧、采邑以事之，或量能立势以钩之，或伺候见涧而钳之，其事用抵墟。" },
            { context: "将欲用之于天下，必度权量能，见天时之盛衰，制地形之广狭，阻险之难易，人民货财之多少，诸侯之交孰亲孰疏，孰爱孰憎，心意之虑怀，审其意，知其所好恶，乃就说其所重，以飞钳之辞钩其所好，以钳求之。" },
            { context: "用之于人，则量智能、权材力、料气势，为之枢机以迎之随之，以钳和之，以意宜之，此飞钳之缀也。" },
            { context: "用于人，则空往而实来，缀而不失，以究其辞。可钳而纵，可钳而横；可引而东，可引而西；可引而南，可引而北；可引而反，可引而覆。 虽覆，能复不失其度。" },
        ]
    }, {
        title: "鬼谷子-忤合",
        data: [
            { context: "凡趋合倍反，计有适合。化转环属，各有形势，反覆相求，因事为制 。是以圣人居天地之间，立身、御世、施教、扬声、明名也；必因事 物之会，观天时之宜，因知所多所少，以此先知之，与之转化。" },
            { context: "世无常贵，事无常师；圣人无常与，无不与；无所听，无不听；成于 事而合于计谋，与之为主。合于彼而离于此，计谋不两忠，必有反忤 ；反于是，忤于彼；忤于此，反于彼。其术也，用之于天下，必量天 下而与之；用之于国，必量国而与之；用之于家，必量家而与之；用 之于身，必量身材气势而与之；大小进退，其用一也。必先谋虑计定 ，而后行之以飞箝之术" },
            { context: "古之善背向者，乃协四海，包诸侯忤合之地而化转之，然后求合。故 伊尹五就汤，五就桀，而不能所明，然后合于汤。吕尚三就文王，三 入殷，而不能有所明，然后合于文王，此知天命之箝，故归之不疑也 。" },
            { context: "非至圣达奥，不能御世；非劳心苦思，不能原事；不悉心见情，不能 成名；材质不惠，不能用兵；忠实无实，不能知人；故忤合之道，己 必自度材能知睿，量长短远近孰不知，乃可以进，乃可以退，乃可以 纵，乃可以横。" },
        ]
    }, {
        title: "鬼谷子-·揣篇",
        data: [
            { context: "古之善用天下者，必量天下之权，而揣诸侯之情。量权不审，不少强弱轻重之称；揣情不审，不知隐匿变化之动静。何谓量权？曰：“度于大小，谋于众寡。称货财有无，料人民多少、饶乏，有余不足几何？辨地形之险易孰利、孰害？谋虑孰长、孰短？群臣之亲疏，孰贤、孰不肖？与宾客之知睿孰少、孰多？观天时之祸福，孰吉、孰凶？诸候之亲孰用、孰不用？百姓之心去就变化，孰安、孰危？孰好、孰憎？反侧孰便、孰知？如此者，是谓量权。”" },
            { context: "揣情者，必以其甚喜之时，往而极其欲也，其有欲也，不能隐其情；必以其甚惧之时，往而极其恶也，具有恶也，不能隐其情：情欲必知其变。感动而不知其变者，乃且错其人勿与语，而更问所亲，知其所安。夫情变于内者，形见于外；故常必以其见者，而知其隐者；此所谓测深揣情。" },
            { context: "故计国事者，则当审量权；说人主，则当审揣情；谋虑情欲必出于此。乃可贵、乃可贱、乃可重、乃可轻、乃可利、乃可害、乃可成、乃可败，其数一也。故虽有先王之道、圣智之谋，非揣情，隐匿无所索之。此谋之本也，而说之法也。常有事于人，人莫能先。先事而至，此最难为。故曰“揣情最难守司”。言必时其谋虑，故观蜎飞蠕动，无不有利害，可以生事变。生事看，几之势也。此揣情饰言成文章，而后论之。" },
        ]
    }, {
        title: "鬼谷子-摩篇",
        data: [
            { context: "摩者，揣之术也。内符者，揣之主也。用之有道，其道必隐。微摩之 以其索欲，测而探之，内符必应；其索应也，必有为之。故微而去之 ，是谓塞□匿端，隐貌逃情，而人不知，故能成其事而无患。" },
            { context: "摩之在此，符之在彼，从而用之，事无不可。古之善摩者，如操钩而 临深渊，饵而投之，必得鱼焉。故曰：主事日成，而人不知；主兵日 胜，而人不畏也。圣人谋之于阴，故曰神；成之于阳，故曰明，所谓 主事日成者，积德也，而民安之，不知其所以利。积善也，而民道之 ，不知其所以然；而天下比之神明也。主兵日胜者，常战于不争不费 ，而民不知所以服，不知所以畏，而天下比之神明。" },
            { context: "其摩者，有以平，有以正；有以喜，有以怒；有以名，有以行；有以 廉，有以信；有以利，有以卑。平者，静也。正者，宜也。喜者，悦 也。怒者，动也。名者，发也。行者，成也。廉者，洁也。信者，期 也。利者，求也。卑者，谄也。故圣人所以独用者，众人皆有之；然 无成功者，其用之非也。" },
            { context: "故谋莫难于周密，说莫难于悉听，事莫难于必成；此三者唯圣人然后 能任之。故谋必欲周密；必择其所与通者说也，故曰：或结而无隙也 夫事成必合于数，故曰：道、数与时相偶者也。说者听，必合于情 ；故曰：情合者听。故物归类；抱薪趋火，燥者先燃；平地注水，湿 者先濡；此物类相应，于事誓犹是也。此言内符之应外摩也如是，故 曰：摩之以其类，焉有不相应者；乃摩之以其欲，焉有不听者。故曰 ：独行之道。夫几者不晚，成而不拘，久而化成。" },
        ]
    }, {
        title: "鬼谷子-权篇",
        data: [
            { context: "说者，说之也；说之者，资之也，饰言者，假之也；假之者，益损也。应对者，利辞也；利辞者，轻论也。成义者，明之也；明之者，符验也。难言者，却论也；却论者，钓几也。佞言者，谄而于忠：谀言者，博而于智；平言者，决而于勇；戚言者，权而于信；静言者，反而于胜。先意承欲者，谄也；繁种文辞者，博也；策选进谋者，权也。纵舍不疑者，决也；先分不足而窒非者，反也。" },
            { context: "故口者机关也，所以关闭情意也。耳目者，心之佐助也，所以窥间见奸邪。故曰：“参调而应，利道而动。”故繁言而不乱，翱翔而不迷，变易而不危者，观要得理。故无目者，不可示以五色，无耳者，不可告以五音。故不可以往者，无所开之也；不可以来者，无所受之也。物有不通者，故不事也。古人有言曰：“口可以食，不可以言。”言有讳忌也。众口烁金，言有曲故也。" },
            { context: "人之情，出言则欲听，举事则欲成。是故智者不用其所短，而用愚人之所长；不用其所拙，而用愚人之所工，故不困也。言其有利者，从其所长也；言其有害者，避其所短也。故介虫之捍也，必以坚厚；螫虫之动也，必以毒螫。故禽兽知用其所长，而谈者知用其所用也。" },
            { context: "故曰：“辞言五、曰病、曰怨、曰忧、曰怒、曰喜。”故曰：“病者，感衰气而不神也；怨者，肠绝而无主也；忧者，闭塞而不泄也；怒者，妄动而不治也；喜者，宣散而无要也。”此五者，精则用之，利则行之。故与智者言，依于博；与拙者言，依于辩；与辩者言，依于要；与贵者言，依于势；与富者言，依于高；与贫者言，依于利；与贱者言，依于谦；与勇者言，依于敢；与过者言，依于锐，此其术也，而人常反之。是故与智者言，将此以明之；与不智者言，将此以教之，而甚难为也。故言多类，事多变。故终日言，不失其类，故事不乱。终日变，而不失其主，故智贵不妄，听贵聪，智贵明，辞贵奇。" },
        ]
    }, {
        title: "鬼谷子-谋篇",
        data: [
            { context: "为人凡谋有道，必得其所因，以求其情。审得其情，乃立三仪。三仪者曰上、曰中、曰下。参以立焉，以生奇。奇不知其所拥，始于古之所从。故郑人之取玉也，必载司南之车，为其不惑也。夫度村、量能、揣情者，亦事之司南也。故同情而俱相亲者，其俱成者也；同欲而相疏者，其偏成者也；同恶而相亲者，其俱害者也；同恶而想疏者，其偏害者也。故相益则亲，相损则疏，其数行也，此所以察同异之分，其类一也。故墙坏于其隙，木毁于其节，斯盖其分也。故变生事，事生谋，谋生计，计生议，议生说，说生进，进生退，退生制，因以制于事。故万事一道，而百度一数也。" },
            { context: "夫仁人轻货，不可诱以利，可使出费；勇士轻难，不可惧以患，可使据危；智者达于数，明于理，不可欺以诚，可示以道理，可使立功；是三才也。故愚者易蔽也，不肖者易惧也，贪者易诱也，是因事而裁之。故为强者积于弱也；为直者积于曲；有余者积于不足也；此其道术行也。" },
            { context: "故外亲而内疏者说内，内亲而外疏者说外。故因其疑以变之，因其见以然之，因其说以要之，因其势以成之，因其恶以权之，因其患以斥之。摩而恐之，高而动之，微而证之，符而应之，拥而塞之，乱而惑之，是谓计谋。计谋之用，公不如私，私不如结，结而无隙者也。正不如奇，奇流而不止者也。故说人主者，必与之言奇；说人臣者，必与之言私。" },
            { context: "其身内、其言外者疏；其身外，其言深者危。无以人之所不欲，而强之于人；无以人之所不知，而教之于人。人之有好也，学而顺之；人之有恶也，避而讳之，故阴道而阳取之也。故去之者纵之，纵之者乘之。貌者不美，又不恶，故至情托焉。可知者可用也，不可知者谋者所不用也，故曰：“事贵制人，而不贵见制于人。”制人者握权也，见制于人者制命也。故圣人之道阴，愚人之道阳；智者事易，而不智者事难。以此观之，亡不可以为存，而危不可以为安，然而无为而贵智矣。智用于众人之所不能知，用于众人之所不能见。既用见可，择事而为之，所以自为也；见不可，择事而为之，所以为人也。故先王之道阴，言有之曰：“天地之化，在高与深；圣人之道，在隐与匿。非独忠、信、仁、义也，中正而已矣。”道理达于此义者，则可与语。由能得此，则可与谷远近之义。" },
        ]
    }, {
        title: "鬼谷子-决篇",
        data: [
            { context: "　凡决物，必托于疑者。善其用福，恶其用患；善至于诱也，终无惑偏。有利焉，去其利，则不受也；奇之所托。若有利于善者，隐托于恶，则不受矣，致疏远。故其有使失利者，有使离害者，此事之失。" },
            { context: "圣人所以能成其事者有五：有以阳德之者，有以阴贼之者，有以信诚之者，有以蔽匿之者，有以平素之者。阳励于一言，阴励于二言，平素、枢机以用；四者微而施之。于事度之往事，验之来事，参之平素，可则决之。" },
            { context: "王公大人之事也，危而美名者，可则决之；不用费力而易成者，可则决之；用力犯勤苦，然不得已而为之者，可贵则决之；去患者，可贵则决之；从福者，可则决之。故夫决情定疑，万事之基，以正治乱，决成败，难为者。故先王乃用蓍龟者，以自决也。" },
        ]
    }, {
        title: "鬼谷子-符言",
        data: [
            { context: "安徐正静，其被节先肉。善与而不静，虚心平意以待倾损。右主位。" },
            { context: "目贵明，耳贵聪，心贵智。以天下之目视者，则无不见；以天下之耳听者，则无不闻；以天下之心思虑者，则无不知；辐辏并进，则明不可塞。右主明。" },
            { context: "德之术曰勿坚而拒之，许之则防守，拒之则闭塞。高山仰之可极，深渊度之可测，神明之德术正静，其莫之极。右主德。" },
            { context: "用赏贵信，用刑贵正。赏赐贵信，必验而目之所闻见，其所不闻见者，莫不谙化矣。诚畅于天下神明，而况奸者干君。右主赏。" },
            { context: "一曰天之，二曰地之，三曰人之；四方上下，左右前后，荧惑之处安在。右主问。" },
            { context: "　心为九穷之治，君为五官之长。为善者，君与之赏；为非者，君与之罚。君因其所以求，因与之，则不劳。圣人用之，故能赏之。因之循理，故能长久。右主因。" },
            { context: "人主不可不周；人主不周，则群臣生乱，家于其无常也，内外不通，安知所闻，开闭不善，不见原也。右主周。" },
            { context: "一曰长目，二曰飞耳，三曰树明。明知千里之外，隐微之中，是谓洞天下奸，莫不谙变更。右主恭。" },
            { context: "　循名而为贵，安而完，名实相生，反相为情，故曰名当则生于实，实 生于理，理生于名实之德，德生于和，和生于当。右主名。" },
        ]
    }, {
        title: "鬼谷子-转丸（失）",
        data: [
            { context: "失" },
        ]
    }, {
        title: "鬼谷子-却乱（失）",
        data: [
            { context: "失" },
        ]
    }, {
        title: "鬼谷子-盛神法五龙",
        data: [
            { context: "盛神法五龙，盛神中有五气，神为之长，心为之舍，德为之大；养神之所，归诸道。道者，天地之始，一其纪也，物之所造，天之所生，包宏无形化气，先天地而成，莫见其形，莫知其名，谓之神灵。故道者，神明之源，一其化端。是以德养五气，心能得一，乃有其术。术者，心气之道所由舍者，神乃为之使。九窍十二舍者，气之门户，心之总摄也。" },
            { context: "生受之天，谓之真人；真人者，与天为一。内修练而知之，谓之圣人；圣人者，以类知之。故人与生一，出于物化。知类在窍，有所疑惑，通于心术，心无其术，必有不通。其通也，五气得养，务在舍神，此之谓化。化有五气者，志也、思也、神也、心也、德也；神其一长也。静和者养气，养气得其和。四者不衰，四边威势无不为，存而舍之，是谓神化归于身，谓之真人。真人者，同天而合道，执一而养产万类，怀天心，施德养，无为以包志虑、思意，而行威势者也。士者通达之，神盛乃能养志。" },
        ]
    }, {
        title: "鬼谷子-养志法灵龟",
        data: [
            { context: "养志者，心气之思不达也。有所欲，志存而思之。志者，欲之使也。 欲多则心散，心散则志衰，志衰则思不达。故心气一则欲不徨，欲不徨则志意不衰，志意不衰则思理达矣。理达则和通，和通则乱气不烦于胸中，故内以养志，外以知人。养志则心通矣，知人则识分明矣。将欲用之于人，必先知其养气志。知人气盛衰，而养其志气，察其所安，以知其所能。" },
            { context: "志不养，则心气不固；心气不固，则思虑不达；思虑不达，则志意不实。志意不实，则应对不猛；应对不猛，则志失而心气虚；志失而心气虚，则丧其神矣；神丧，则仿佛；仿佛，则参会不一。养志之始，务在安己；己安，则志意实坚；志意实坚，则威势不分，神明常固守，乃能分之。" },
        ]
    }, {
        title: "鬼谷子-实意法腾蛇",
        data: [
            { context: "实意者，气之虑也。心欲安静，虑欲深远；心安静则神策生，虑深远则计谋成；神策生则志不可乱，计谋成则功不可间。意虑定则心遂安 ，心遂安则所行不错，神自得矣。得则凝。识气寄，奸邪得而倚之，诈谋得而惑之；言无由心矣。固信心术守真一而不化，待人意率之交会，听之候也。寄谋者，存亡之枢机。虑不会，则听不审矣。候之不得，寄谋失矣。则意无所信，虚而无实。故寄谋之虑，务在实意；实意必从心术始。" },
            { context: "无为而求，安静五脏，和通六腑；精神魂魄固守不动，乃能内视反听 ，定志虑之太虚，待神往来。以观天地开辟，知万物所造化，见阴阳之终始，原人事之政理。不出户而知天下，不窥牖而见天道；不见而命，不行而至；是谓道知。以通神明，应于无方，而神宿矣。" },
        ]
    }, {
        title: "鬼谷子-分威法伏熊",
        data: [
            { context: "分威者，神之覆也。故静意固志，神归其舍，则威覆盛矣。威覆盛，则内实坚；内实坚，则莫当；莫当，则能以分人之威而动其势，如其天。以实取虚，以有取无，若以镒称铢。故动者必随，唱者必和。挠其一指，观其余次，动变见形，无能间者。审于唱和，以间见间，动变明而威可分也。将欲动变，必先养志以视间。知其固实者，自养也。让己者，养人也。故神存兵亡，乃为知形势。" },
        ]
    }, {
        title: "鬼谷子-散势法鸷鸟",
        data: [
            { context: "散势者，神之使也。用之，必循间而动。威肃内盛，推间而行之，则势散。夫散势者，心虚志溢；意衰威失，精神不专，其言外而多变。故观其志意，为度数，乃以揣说图事，尽圆方，齐短长。无间则不散势者，待间而动，动而势分矣。故善思间者，必内精五气，外视虚实，动而不失分散之实。动则随其志意，知其计谋。势者，利害之决，权变之威。势败者，不可神肃察也。" },
        ]
    }, {
        title: "鬼谷子-转圆法猛兽",
        data: [
            { context: "转圆者，无穷之计也。无穷者，必有圣人之心，以原不测之智；以不测之智而通心术，而神道混沌为一。以变论万类，说意无穷。智略计谋，各有形容，或圆或方，或阴或阳，或吉或凶，事类不同。故圣人怀此，用转圆而求其合。故与造化者为始，动作无不包大道，以观神明之域。" },
            { context: "天地无极，人事无穷，各以成其类；见其计谋，必知其吉凶成败之所终。转圆者，或转而吉，或转而凶，圣人以道，先知存亡，乃知转圆而从方。圆者，所以合语；方者，所以错事。转化者，所以观计谋；接物者，所以观进退之意。皆见其会，乃为要结以接其说也。" },
        ]
    }, {
        title: "鬼谷子-损悦法灵蓍",
        data: [
            { context: "　损悦者，机危之决也。事有适然，物有成败，机危之动，不可不察。 故圣人以无为待有德，言察辞，合于事。悦者，知之也。损者，行之也。损之说之，物有不可者，圣人不为之辞。故智者不以言失人之言，故辞不烦而心不虚，志不乱而意不邪。当其难易，而后为之谋；因自然之道以为实。圆者不行，方者不止，是谓大功。益之损之，皆为之辞。用分威散势之权，以见其悦威，其机危乃为之决。故善损悦者，誓若决水于千仞之堤，转圆石于万仞之谷。而能行此者，形势不得不然也。" },
            { context: "" },
        ]
    }, {
        title: "鬼谷子-持枢·全篇",
        data: [
            { context: "持枢，谓春生、夏长、秋收、冬藏，天之正也，不可干而逆之。逆之者，虽成必败。" },
            { context: "故人君亦有天枢，生养成藏，亦复不可干而逆之，逆之虽盛必衰。此天道、人君之大纲也。" },
        ]
    }, {
        title: "鬼谷子-中经·全篇",
        data: [
            { context: "“中经”，谓振穷趋急，施之能言厚德之人。救拘执，穷者不忘恩也。能言者，俦善博惠，施德者，依道；而救拘执者，养使小人。盖士，当世异时，或当因免阗坑，或当伐害能言，或当破德为雄，或当抑拘成罪，或当戚戚自善，或当败败自立。" },
            { context: "故道贵制人，不贵制于人也；制人者握权，制于人者失命。是以见形为容，象体为貌，闻声和音，解仇斗郄，缀去却语，摄心守义。本经纪事者，纪道数，其变要在《持枢》、《中经》。" },
            { context: "“见形为容，象体为貌”者，谓爻为之生也，可以影响、形容、象貌而得之也。有守之人，目不视非、耳不听邪，言必言必《诗》、《书》，行不僻淫，以道为形，以德为容，貌庄色温，不可象貌而得也，如是隐情塞郄而去之。" },
            { context: "“闻声和音”，谓声气不同，则恩爱不接。故商角不二合，微羽不相配。能为四声主，其唯宫乎？故音不和则不悲，不是以声散伤丑害者，言必逆于耳也。虽有美行盛誉，下可比目，合翼相须也，此乃气不合、音不调者也。" },
            { context: "“解仇斗郄”，谓解赢微之仇。斗郄者，斗强也。强郄既斗，称胜者，高其功，盛其势。弱者哀其负，伤其卑，污其名，耻其宗。故胜盅，闻其功势，苟进而不知退。弱者闻哀其负，见其伤则强大力倍，死为是也。郄无极大，御无强大，则皆可胁而并。" },
            { context: "“缀去”者，谓缀已之系言，使有余思也。故接贞信者，称其行、厉其志，言可为可复，会之期喜，以他人之庶，引验以结往，明款款而去之。" },
            { context: "　“却语”者，察伺短也。故言多必有数短之外，议其短验之。动以忌讳，示以时禁，其人因以怀惧，然后结以安其心，收语尽藏而却之，无见己之所不能于多方之人。" },
            { context: "“摄心”者，谓逢好学伎术者，则为之称远方验之，敬以奇怪，人系其心于已。效之于人，验去乱其前，吾归于诚已。遭淫色酒者，为之术音乐动之，以为必死，生日少之忧。喜以自所不见之事，终可以观漫澜之命，使有后会。" },
            { context: "　“守义”者，谓守以人义。探心在内以合也。探心深得其主也。从外制内，事有系由而随也。故小人比人则左道，而用之至能败家辱国。非贤智，不能守家以义，不能守国以道，圣人所贵道微妙者，诚以其可以转危为安，救亡使存也。" },
        ]
    }]
}
//左传
var demo02 = {
    title: "左传-左丘明",
    name: "左传",
    data: [{
        title: "一曲肝肠断",
        data: [
            { context: "一曲肝肠断，天涯何处觅知音？一曲肝肠断，轻羽此去莫留连，更有南国花正好，莫向白苹洲上独叹秋水寒。" },
            { context: "二曲肝肠断，深院梨花相谢早，五马罗堂久徘徊，油壁桐车载君去，去时盈盈红泪满红绡。" },
            { context: "三曲肝肠断，落花为雨侬为愁，秋千架上看笑靥，而今都随海棠瘦，唯自弄笛别院忆兰舟。" },
            { context: "四曲肝肠断，琵琶不语琴绝弦，鹦鹉架前说心事，垂画双立秉烛观，但得青鸟传信与香媛。" },
            { context: "五曲肝肠断，往事何堪忆从头，剪花笑谈灯影瘦，而今红螺渐蒙愁，明月华衫霓裳能记否？" },
            { context: "六曲肝肠断，欲倾心事无所藉，还自南园抚霜枝，云台黛色苍烟里，问君此去还谋定佳期？" },
        ]
    }]
}
//现代文欣赏
var demo03 = {
    title: "现代文欣赏",
    name: "摘抄",
    data: [{
        title: "别说你不屑于模仿",
        data: [
            { context: "很多人谈起中国人善于“模仿”(或者叫山寨)时无不轻视。但我却认为，当你有能力模仿某件东西，并且知道这样做肯定能赚钱时，为什么还要去发明新东西并承担风险呢？在硅谷，如果每个人都能简单的从抄袭创意中赚到大钱，他们肯定也会这样做。" },
            { context: " 中国之所以曾经热衷于模仿，是因为当时中国市场不够开放，导致硅谷等引领创新之地和中国对领先创意的消化吸收之间存在一个时间差，从而为创业者提供了机会。巨大的价值就在这样的时间差中被创造了出来。" },
            { context: " 现在中国互联网“三巨头”百度、阿里巴巴、腾讯最初的业务模式都来自于模仿市场领先企业，但现在他们都已经完成了超越。搜索引擎公司百度模仿的是谷歌；电商平台阿里巴巴混合了亚马逊、ebay、Paypal的基本元素；腾讯的QQ和微信最初是从ICQ和Kakao， Talk中获得灵感。现在，这三家企业的创新能力已经超越了人们的预期，正在拓展全球市场，并且正在被其他企业所模仿。所以，更实际的创业道路可能是：能模仿就模仿，无法模仿就创新。" },
            { context: " 而现在，中国也已经走出了模仿时代，有如此多的中国初创企业在寻找源自硅谷的最新创意，所以哪怕你模仿的速度非常快，最终也会和数十家其他中国模仿者一起竞争。仅靠模仿来获取成功的可能性已经越来越低。" },
            { context: " 我总是听到一些中国政府官员和商界人士感叹中国初创企业创新力度不足。还有不少人在设想一些复杂的解决方案来帮助创业者提高创新能力。在我看来，大多数这样的担心和投入都是没有必要的，因为问题其实可以靠自身解决。中国人将会开创自己的原创之路，因为他们不得不这样做。只要模仿不再有效，人们就会停止模仿。" },
            { context: " 如果说得更直白一些，所有的创新都是从模仿它们之前的某种东西开始的，这就是我们学习的方式。区别在于，伟大的创业者不仅仅模仿，还会把模仿下来的东西转化成为自己的东西。就像毕加索曾说的那样：“巧匠摹形，大师窃意”。每一个硅谷天才，从脸书的扎克伯格到特斯拉的埃隆.马斯克，都是从学习别人的创意开始的，但他们作出的贡献远远超出了始创者。所以，在创新之前，别说你不屑于模仿！" },
        ]
    },{
        title: "我们只不过是要努力奋斗，使当初的选择变得正确",
        data: [
            { context: "前几天收拾东西，从柜子里掉出来一摞汇款单。汇款单用曲别针别着一百多张，最上面的一张用钢笔写着“这就是成长啊！”下面签着我和一个叫Lily的女孩的名字。我坐在地上，翻着每一张汇款单，一页页的看。那是我大三第一次正式的实习，和一个叫lily的实习生一组。" },
            { context: "我们从来没有填写过汇款单，里面的很多要求我们不知道，比如数字的汉字要大写，每个字之间不能有空隙等等，越是严格，就越是紧张，然后我们写一个错一个，写了100多张才写好那么几个人。记得当时老板拿着一摞废掉的汇款单跟我们说：“保存起来，五年之后再翻出来看看，这就是你们的成长。”" },
            { context: "我真的很乖的保存下来了。那份实习我做了六个月，和Lily一起，一起中午吃便宜的午餐，一起互帮互助写每一份文案和策划，一起战战兢兢去财务部领1200块钱的工资还要看财务的脸色。那时候的我，每天要坐两小时公交车上班，再坐两小时公交车下班，那时候一天的公交费2块钱，地铁费要10块钱，不舍得地铁，只能坐公交车神游三环一大圈。" },
            { context: "Lily是外地高校的学生，实习期间住在当时的男友家。男友和父母住在一起，在北京胡同的平房里。她不怎么习惯平房，也不习惯对方的父母，大夏天有时候洗澡都困难，做什么事情都小心翼翼。相比我的远，她的寄人篱下更让人觉得难受，因此上班时间就是她最开心的时间了。" },
            { context: "Lily是个很美的姑娘，大长腿，模特身材，清新的感觉跟江一燕差不多，那时候的我们对未来都没什么明确的打算，她在学GRE靠托福想去美国读研究生，我在想是留在这家公司转正还是申请一家更好的公司去实习。我清楚的记得，我们都不知道未来，但谁都不迷茫。我们每天都特别开心，傻乐傻乐的，尽管我们穷，我们也土土的，我们干活多时间长还经常被当做劳力去跑腿做杂事，但真的没人抱怨什么。" },
            { context: "我们在一起度过了那份实习的所有时间，然后彼此离开。我去了下一家牛逼哄哄的公司继续实习，她真的考上了美国的研究生。再后来我毕业找到了梦想中的工作，Lily在美国读完研究生留在纽约工作。某次她跟我谈起她梦想中的公司要求要有“不带薪实习9个月”在前，我大呼“这哪里是实习，这分明是生存大考验啊，你这是纽约啊。”" },
            { context: "五年后的前几天，当我翻出那一摞汇款单的时候，我拍照发给Lily，她正在银行签贷款合同，在纽约买下自己人生的第一套公寓。她问我要不要代购奶粉什么的，我大笑的问她你能给我买十年吗？是的，五年后的我们，都各自长大，过着让自己感到合适和舒服的生活。我们都是普通的女孩，我们的每一步是不是都很成功很完美，我们彼此也没有谁强谁弱，我们都在洪荒宇宙中像一颗粒子一样慢慢前行，即使失败，也是一种成长；即使迷茫，也都是青春的代价。只是，我们都觉得，每走一步，都要对得起自己。" },
            { context: "有人问我：“我找了个工作，老板给我XXXX待遇，我觉得不公平。”“我刚毕业，月薪就2000元，你说这公司是不是骗子。”亲爱的，我不知道，我不知道你是如何的，这份工作值不值得你去做，我只能说说我自己。第一份社会实践卖饮料一天30元，拖半年才付款，其实也就几百块。" },
            { context: "第一份实习，两个月一共700元，还是500强公司，连纳税的起征点都不够；第一份工作，人见人羡慕的豪华公司，起薪3000元。我不是什么名校，我英语不如母语好，我没有别人那么多见识，没读过很多很多书，常年在学校里，第一次在公司门口吃过桥米线，都觉得好吃的好几年忘不了。我周围也有很多牛人，有的男生毕业就了高大奢的咨询公司和投行，连父母来北京旅游都可以用公司专车接送；有的女孩还没毕业就创业，一天能赚十几万；有的随便学学就能GRE考高分拿着奖学金去美国。" },
            { context: "但这些都不是我，他们都只是我身边最亮眼的那些光芒。我抬头看看他们，再看看自己，除了低头努力，真的说不出什么，要抱怨不出什么。抱怨社会不公？还是老板不人道？还是公司欺负我？还是投胎到了没什么钱与权的家庭？我不知道怎么去考虑自己做某个事情值不值得，我只知道以自己的背景和底子，在北京这种名校成堆，牛人成群的地方，想要得到自己梦想中的东西，就要一步步垒宝塔一样去做，一步踩着一步爬上去，才会有人愿意看见我，无论是工作与生活、还是爱情与婚姻。" },
            { context: "前几天看完一本美国名校学生奋斗的书。主人公像在中国混大学一样混在美国名校里，终有一天被勒令退学。他的导师给了他一个试读的机会，他在此期间奋发图强，做出了领全美国惊艳的成绩。一瞬间，他从一个人人讥笑的失败者变成了一个在大会上全场为之鼓掌的成功人士。所有的荣誉、鲜花，以及美国最美的小妞儿都围绕着他。而他也终于明白，被要求退学的时候，他以为全世界都对他不好，导师在报复他，前女友在恶意踩踏他，可事实上，一切都是自己造成的，是自己的混沌懈怠不学习，让自己掉进了人生的低谷，这世界从来不会跟你过不去，你得到的任何好与坏，都是自己作的。" },
            { context: "有句话是这么说的：“根本没有正确的选择，我们只不过是要努力奋斗，使当初的选择变得正确。”就是这样。" },
        ]
    }]
}
//孙子兵法全集
var demo04 = {
    title: "孙子兵法全集",
    name: "孙子兵法全集",
    data: [{
        title: "孙子兵法-始计篇",
        data: [
            { context: "　孙子曰：兵者，国之大事，死生之地，存亡之道，不可不察也。 " },
            { context: "　故经之以五事，校之以计而索其情：一曰道，二曰天，三曰地，四曰将，五曰法。道者，令民与上同意也，故可以与之死，可以与之生，而不畏危。天者，阴阳、寒暑、时制也。地者，远近、险易、广狭、死生也。将者，智、信、仁、勇、严也。法者，曲制、官道、主用也。凡此五者，将莫不闻，知之者胜，不知者不胜。故校之以计而索其情，曰：主孰有道？将孰有能？天地孰得？法令孰行？兵众孰强？士卒孰练？赏罚孰明？吾以此知胜负矣。 " },
            { context: "　将听吾计，用之必胜，留之；将不听吾计，用之必败，去之。 " },
            { context: " 计利以听，乃为之势，以佐其外。势者，因利而制权也。兵者，诡道也。故能而示之不能，用而示之不用，近而示之远，远而示之近；利而诱之，乱而取之，实而备之，强而避之，怒而挠之，卑而骄之，佚而劳之，亲而离之。攻其无备，出其不意。此兵家之胜，不可先传也。" },
            { context: "夫未战而庙算胜者，得算多也；未战而庙算不胜者，得算少也。多算胜，少算不胜，而况于无算乎！吾以此观之，胜负见矣。 " },
        ]
    }, {
        title: "孙子兵法-作战篇",
        data: [
            { context: " 孙子曰：凡用兵之法，驰车千驷，革车千乘，带甲十万，千里馈粮。则内外之费，宾客之用，胶漆之材，车甲之奉，日费千金，然后十万之师举矣。" },
            { context: "其用战也胜，久则钝兵挫锐，攻城则力屈，久暴师则国用不足。夫钝兵挫锐，屈力殚货，则诸侯乘其弊而起，虽有智者不能善其后矣。故兵闻拙速，未睹巧之久也。夫兵久而国利者，未之有也。故不尽知用兵之害者，则不能尽知用兵之利也。 " },
            { context: " 善用兵者，役不再籍，粮不三载，取用于国，因粮于敌，故军食可足也。国之贫于师者远输，远输则百姓贫；近师者贵卖，贵卖则百姓财竭，财竭则急于丘役。力屈财殚，中原内虚于家，百姓之费，十去其七；公家之费，破军罢马，甲胄矢弓，戟盾矛橹，丘牛大车，十去其六。故智将务食于敌，食敌一钟，当吾二十钟；萁杆一石，当吾二十石。故杀敌者，怒也；取敌之利者，货也。车战得车十乘以上，赏其先得者而更其旌旗。车杂而乘之，卒善而养之，是谓胜敌而益强。" },
            { context: "　故兵贵胜，不贵久。 " },
            { context: " 故知兵之将，民之司命。国家安危之主也。" },
        ]
    }, {
        title: "孙子兵法-谋攻篇",
        data: [
            { context: "孙子曰：夫用兵之法，全国为上，破国次之；全军为上，破军次之；全旅为上，破旅次之；全卒为上，破卒次之；全伍为上，破伍次之。是故百战百胜，非善之善者也；不战而屈人之兵，善之善者也。 " },
            { context: "故上兵伐谋，其次伐交，其次伐兵，其下攻城。攻城之法，为不得已。修橹轒輼，具器械，三月而后成，距堙，又三月而后已。将不胜其忿而蚁附之，杀士卒三分之一而城不拔者，此攻之灾也。 " },
            { context: " 故善用兵者，屈人之兵而非战也，拔人之城而非攻也，毁人之国而非久也，必以全争于天下，故兵不顿，而利可全，此谋攻之法也。" },
            { context: "故用兵之法，十则围之，五则攻之，倍则分之，敌则能战之，少则能逃之，不若则能避之。故小敌之坚，大敌之擒也。 " },
            { context: " 夫将者，国之辅也,辅周则国必强，辅隙则国必弱。" },
            { context: " 故君之所以患于军者三：不知军之不可以进而谓之进，不知军之不可以退而谓之退，是谓縻军。不知三军之事而同三军之政者，则军士惑矣。不知三军之权而同三军之任，则军士疑矣。三军既惑且疑，则诸侯之难至矣。是谓乱军引胜。" },
            { context: "故知胜有五：知可以战与不可以战者胜；识众寡之用者胜；上下同欲者胜；以虞待不虞者胜；将能而君不御者胜。此五者，知胜之道也。 " },
            { context: " 故曰：知彼知己，百战不殆；不知彼而知己，一胜一负；不知彼,不知己，每战必殆。" },
        ]
    }, {
        title: "孙子兵法-军形篇",
        data: [
            { context: "孙子曰：昔之善战者，先为不可胜，以待敌之可胜。不可胜在己，可胜在敌。故善战者，能为不可胜，不能使敌之必可胜。故曰：胜可知，而不可为。 " },
            { context: "不可胜者，守也；可胜者，攻也。守则不足，攻则有余。善守者，藏于九地之下，善攻者，动于九天之上，故能自保而全胜也。 " },
            { context: " 见胜不过众人之所知，非善之善者也；战胜而天下曰善，非善之善者也。故举秋毫不为多力，见日月不为明目，闻雷霆不为聪耳。古之所谓善战者，胜于易胜者也。故善战者之胜也，无智名，无勇功，故其战胜不忒，不忒者，其所措必胜，胜已败者也。故善战者，立于不败之地，而不失敌之败也。是故胜兵先胜而后求战，败兵先战而后求胜。善用兵者，修道而保法，故能为胜败之政。" },
            { context: " 兵法：一曰度，二曰量，三曰数，四曰称，五曰胜。地生度，度生量，量生数，数生称，称生胜。故胜兵若以镒称铢，败兵若以铢称镒。胜者之战民也，若决积水于千仞之溪者，形也。" },
        ]
    }, {
        title: "孙子兵法-兵势篇",
        data: [
            { context: " 孙子曰：凡治众如治寡，分数是也；斗众如斗寡，形名是也；三军之众，可使必受敌而无败者，奇正是也；兵之所加，如以碫投卵者，虚实是也。" },
            { context: " 　凡战者，以正合，以奇胜。故善出奇者，无穷如天地，不竭如江海。终而复始，日月是也。死而更生，四时是也。声不过五，五声之变，不可胜听也；色不过五，五色之变，不可胜观也；味不过五，五味之变，不可胜尝也；战势不过奇正，奇正之变，不可胜穷也。奇正相生，如循环之无端，孰能穷之哉！" },
            { context: "激水之疾，至于漂石者，势也；鸷鸟之疾，至于毁折者，节也。故善战者，其势险，其节短。势如彍弩，节如发机。纷纷纭纭，斗乱而不可乱；浑浑沌沌，形圆而不可败。乱生于治，怯生于勇，弱生于强。治乱，数也；勇怯，势也；强弱，形也。 " },
            { context: " 故善动敌者，形之，敌必从之；予之，敌必取之。以利动之，以卒待之。故善战者，求之于势，不责于人故能择人而任势。任势者，其战人也，如转木石。木石之性，安则静，危则动，方则止，圆则行。" },
            { context: " 故善战人之势，如转圆石于千仞之山者，势也。" },
        ]
    }, {
        title: "孙子兵法-虚实篇",
        data: [
            { context: "　孙子曰：凡先处战地而待敌者佚，后处战地而趋战者劳，故善战者，致人而不致于人。能使敌人自至者，利之也；能使敌人不得至者，害之也，故敌佚能劳之，饱能饥之，安能动之。出其所不趋，趋其所不意。行千里而不劳者，行于无人之地也。 " },
            { context: "攻而必取者，攻其所不守也；守而必固者，守其所不攻也。故善攻者，敌不知其所守；善守者，敌不知其所攻。微乎微乎，至于无形。神乎神乎，至于无声，故能为敌之司命。进而不可御者，冲其虚也；退而不可追者。速而不可及也。故我欲战，敌虽高垒深沟，不得不与我战者，攻其所必救也；我不欲战，画地而守之，敌不得与我战者，乖其所之也。 " },
            { context: "故形人而我无形，则我专而敌分。我专为一，敌分为十，是以十攻其一也，则我众而敌寡；能以众击寡者，则吾之所与战者，约矣。吾所与战之地不可知，不可知，则敌所备者多；敌所备者多，则吾所与战者，寡矣。 " },
            { context: "故备前则后寡，备后则前寡，备左则右寡，备右则左寡，无所不备，则无所不寡。寡者，备人者也；众者，使人备己者也。 " },
            { context: "故知战之地，知战之日，则可千里而会战。不知战地，不知战日，则左不能救右，右不能救左，前不能救后，后不能救前，而况远者数十里，近者数里乎？ " },
            { context: "以吾度之，越人之兵虽多，亦奚益于胜败哉？故曰：胜可为也。敌虽众，可使无斗。故策之而知得失之计，作之而知动静之理，形之而知死生之地，角之而知有余不足之处。故形兵之极，至于无形。无形，则深间不能窥，智者不能谋。因形而错胜于众，众不能知；人皆知我所以胜之形，而莫知吾所以制胜之形。故其战胜不复，而应形于无穷。 " },
            { context: " 夫兵形象水，水之形，避高而趋下，兵之形，避实而击虚。水因地而制流，兵因敌而制胜。故兵无常势，水无常形，能因敌变化而取胜者，谓之神。" },
            { context: " 故五行无常胜，四时无常位，日有短长，月有死生。" },
        ]
    }, {
        title: "孙子兵法-军争篇",
        data: [
            { context: " 孙子曰：凡用兵之法，将受命于君，合军聚众，交和而舍，莫难于军争。军争之难者，以迂为直，以患为利。" },
            { context: "故迂其途，而诱之以利，后人发，先人至，此知迂直之计者也。军争为利，军争为危。举军而争利则不及，委军而争利则辎重捐。是故卷甲而趋，日夜不处，倍道兼行，百里而争利，则擒三将军，劲者先，疲者后，其法十一而至；五十里而争利，则蹶上将军，其法半至；三十里而争利，则三分之二至。是故军无辎重则亡，无粮食则亡，无委积则亡。故不知诸侯之谋者，不能豫交；不知山林、险阻、沮泽之形者，不能行军；不用乡导者，不能得地利。故兵以诈立，以利动，以分和为变者也。故其疾如风，其徐如林，侵掠如火，不动如山，难知如阴，动如雷震。掠乡分众，廓地分利，悬权而动。先知迂直之计者胜，此军争之法也。 " },
            { context: "《军政》曰：“言不相闻，故为之金鼓；视不相见，故为之旌旗。”夫金鼓旌旗者，所以一人之耳目也。人既专一，则勇者不得独进，怯者不得独退，此用众之法也。故夜战多金鼓，昼战多旌旗，所以变人之耳目也。 " },
            { context: " 三军可夺气，将军可夺心。是故朝气锐，昼气惰，暮气归。善用兵者，避其锐气，击其惰归，此治气者也。以治待乱，以静待哗，此治心者也。以近待远，以佚待劳，以饱待饥，此治力者也。无邀正正之旗，无击堂堂之阵，此治变者也。" },
            { context: "故用兵之法，高陵勿向，背丘勿逆，佯北勿从，锐卒勿攻，饵兵勿食，归师勿遏，围师遗阙，穷寇勿迫，此用兵之法也。 " },
        ]
    }, {
        title: "孙子兵法-九变篇",
        data: [
            { context: "孙子曰：凡用兵之法，将受命于君，合军聚众。圮地无舍，衢地交合，绝地无留，围地则谋，死地则战。涂有所不由，军有所不击，城有所不攻，地有所不争，君命有所不受。故将通于九变之地利者，知用兵矣；将不通于九变之利者，虽知地形，不能得地之利者矣。治兵不知九变之术，虽知五利，不能得人之用矣。 " },
            { context: "　是故智者之虑，必杂于利害。杂于利，而务可信也；杂于害，而患可解也。是故屈诸侯者以害，役诸侯者以业，趋诸侯者以利。故用兵之法，无恃其不来，恃吾有以待也；无恃其不攻，恃吾有所不可攻也。 " },
            { context: " 故将有五危：必死，可杀也；必生，可虏也；忿速，可侮也；廉洁，可辱也；爱民，可烦也。凡此五者，将之过也，用兵之灾也。覆军杀将必以五危，不可不察也。" },
        ]
    }, {
        title: "孙子兵法-行军篇",
        data: [
            { context: " 孙子曰：凡处军相敌：绝山依谷，视生处高，战隆无登，此处山之军也。绝水必远水；客绝水而来，勿迎之于水内，令半济而击之，利；欲战者，无附于水而迎客；视生处高，无迎水流，此处水上之军也。绝斥泽，惟亟去无留；若交军于斥泽之中，必依水草而背众树，此处斥泽之军也。平陆处易，而右背高，前死后生，此处平陆之军也。凡此四军之利，黄帝之所以胜四帝也。" },
            { context: "凡军好高而恶下，贵阳而贱阴，养生而处实，军无百疾，是谓必胜。丘陵堤防，必处其阳，而右背之。此兵之利，地之助也。 " },
            { context: " 上雨，水沫至，欲涉者，待其定也。" },
            { context: "凡地有绝涧、天井、天牢、天罗、天陷、天隙，必亟去之，勿近也。吾远之，敌近之；吾迎之，敌背之。 " },
            { context: " 军行有险阻、潢井、葭苇、山林、蘙荟者，必谨覆索之，此伏奸之所处也。" },
            { context: "敌近而静者，恃其险也；远而挑战者，欲人之进也；其所居易者，利也。 " },
            { context: " 众树动者，来也；众草多障者，疑也；鸟起者，伏也；兽骇者，覆也；尘高而锐者，车来也；卑而广者，徒来也；散而条达者，樵采也；少而往来者，营军也。" },
            { context: "辞卑而益备者，进也；辞强而进驱者，退也；轻车先出居其侧者，陈也；无约而请和者，谋也；奔走而陈兵车者，期也；半进半退者，诱也。 " },
            { context: " 杖而立者，饥也；汲而先饮者，渴也；见利而不进者，劳也；鸟集者，虚也；夜呼者，恐也；军扰者，将不重也；旌旗动者，乱也；吏怒者，倦也；粟马肉食，军无悬缻，不返其舍者，穷寇也；谆谆翕翕，徐与人言者，失众也；数赏者，窘也；数罚者，困也；先暴而后畏其众者，不精之至也；来委谢者，欲休息也。兵怒而相迎，久而不合，又不相去，必谨察之。" },
            { context: "兵非益多也，惟无武进，足以并力、料敌、取人而已。夫惟无虑而易敌者，必擒于人。 " },
            { context: " 卒未亲附而罚之，则不服，不服则难用也。卒已亲附而罚不行，则不可用也。故令之以文，齐之以武，是谓必取。令素行以教其民，则民服；令不素行以教其民，则民不服。令素行者，与众相得也。" },
        ]
    }, {
        title: "孙子兵法-地形篇",
        data: [
            { context: "孙子曰：地形有通者，有挂者，有支者，有隘者，有险者，有远者。我可以往，彼可以来，曰通；通形者，先居高阳，利粮道，以战则利。可以往，难以返，曰挂；挂形者，敌无备，出而胜之；敌若有备，出而不胜，难以返，不利。我出而不利，彼出而不利，曰支；支形者，敌虽利我，我无出也；引而去之，令敌半出而击之，利。隘形者，我先居之，必盈之以待敌；若敌先居之，盈而勿从，不盈而从之。险形者，我先居之，必居高阳以待敌；若敌先居之，引而去之，勿从也。远形者，势均，难以挑战，战而不利。凡此六者，地之道也；将之至任，不可不察也。 " },
            { context: " 故兵有走者，有弛者，有陷者，有崩者，有乱者，有北者。凡此六者，非天之灾，将之过也。夫势均，以一击十，曰走；卒强吏弱，曰弛，吏强卒弱，曰陷；大吏怒而不服，遇敌怼而自战，将不知其能，曰崩；将弱不严，教道不明，吏卒无常，陈兵纵横，曰乱；将不能料敌，以少合众，以弱击强，兵无选锋，曰北。凡此六者，败之道也；将之至任，不可不察也。" },
            { context: " 夫地形者，兵之助也。料敌制胜，计险厄远近，上将之道也。知此而用战者必胜，不知此而用战者必败。" },
            { context: " 故战道必胜，主曰无战，必战可也；战道不胜，主曰必战，无战可也。故进不求名，退不避罪，唯人是保，而利合于主，国之宝也。" },
            { context: "视卒如婴儿，故可与之赴深溪；视卒如爱子，故可与之俱死。厚而不能使，爱而不能令，乱而不能治，譬若骄子，不可用也。 " },
            { context: " 知吾卒之可以击，而不知敌之不可击，胜之半也；知敌之可击，而不知吾卒之不可以击，胜之半也；知敌之可击，知吾卒之可以击，而不知地形之不可以战，胜之半也。故知兵者，动而不迷，举而不穷。故曰：知彼知己，胜乃不殆；知天知地，胜乃不穷。" },
        ]
    }, {
        title: "孙子兵法-九地篇",
        data: [
            { context: "孙子曰：用兵之法，有散地，有轻地，有争地，有交地，有衢地，有重地，有圮地，有围地，有死地。诸侯自战其地，为散地。入人之地不深者，为轻地。我得则利，彼得亦利者，为争地。我可以往，彼可以来者，为交地。诸侯之地三属，先至而得天下之众者，为衢地。入人之地深，背城邑多者，为重地。行山林、险阻、沮泽，凡难行之道者，为圮地。所由入者隘，所从归者迂，彼寡可以击吾之众者，为围地。疾战则存，不疾战则亡者，为死地。是故散地则无战，轻地则无止，争地则无攻，交地则无绝，衢地则合交，重地则掠，圮地则行，围地则谋，死地则战。 " },
            { context: " 所谓古之善用兵者，能使敌人前后不相及，众寡不相恃，贵贱不相救，上下不相收，卒离而不集，兵合而不齐。合于利而动，不合于利而止。敢问：“敌众整而将来，待之若何？”曰：“先夺其所爱，则听矣。”" },
            { context: " 兵之情主速，乘人之不及，由不虞之道，攻其所不戒也。" },
            { context: " 凡为客之道：深入则专，主人不克；掠于饶野，三军足食；谨养而勿劳，并气积力，运兵计谋，为不可测。投之无所往，死且不北，死焉不得，士人尽力。兵士甚陷则不惧，无所往则固。深入则拘，不得已则斗。是故其兵不修而戒，不求而得，不约而亲，不令而信，禁祥去疑，至死无所之。吾士无余财，非恶货也；无余命，非恶寿也。令发之日，士卒坐者涕沾襟。偃卧者涕交颐。投之无所往者，诸、刿之勇也。" },
            { context: "　故善用兵者，譬如率然；率然者，常山之蛇也。击其首则尾至，击其尾则首至，击其中则首尾俱至。敢问：“兵可使如率然乎？”曰：“可。”夫吴人与越人相恶也，当其同舟而济，遇风，其相救也如左右手。是故方马埋轮，未足恃也；齐勇若一，政之道也；刚柔皆得，地之理也。故善用兵者，携手若使一人，不得已也。 " },
            { context: "将军之事：静以幽，正以治。能愚士卒之耳目，使之无知。易其事，革其谋，使人无识；易其居，迂其途，使人不得虑。帅与之期，如登高而去其梯；帅与之深入诸侯之地，而发其机，焚舟破釜，若驱群羊，驱而往，驱而来，莫知所之。聚三军之众，投之于险，此谓将军之事也。九地之变，屈伸之利，人情之理，不可不察。 " },
            { context: "凡为客之道：深则专，浅则散。去国越境而师者，绝地也；四达者，衢地也；入深者，重地也；入浅者，轻地也；背固前隘者，围地也；无所往者，死地也。 " },
            { context: " 是故散地，吾将一其志；轻地，吾将使之属；争地，吾将趋其后；交地，吾将谨其守；衢地，吾将固其结；重地，吾将继其食；圮地，吾将进其涂；围地，“吾将塞其阙；死地，吾将示之以不活。" },
            { context: " 故兵之情，围则御，不得已则斗，过则从。是故不知诸侯之谋者，不能预交；不知山林、险阻、沮泽之形者，不能行军；不用乡导者，不能得地利。四五者，不知一，非霸王之兵也。夫霸王之兵，伐大国，则其众不得聚；威加于敌，则其交不得合。是故不争天下之交，不养天下之权，信己之私，威加于敌，故其城可拔，其国可隳。施无法之赏，悬无政之令，犯三军之众，若使一人。犯之以事，勿告以言；犯之以利，勿告以害。" },
            { context: " 投之亡地然后存，陷之死地然后生。夫众陷于害，然后能为胜败。" },
            { context: " 　故为兵之事，在于顺详敌之意，并敌一向，千里杀将，此谓巧能成事者也。" },
            { context: "　是故政举之日，夷关折符，无通其使；厉于廊庙之上，以诛其事。敌人开阖，必亟入之。先其所爱，微与之期。践墨随敌，以决战事。是故始如处女，敌人开户，后如脱兔，敌不及拒。 " },
        ]
    }, {
        title: "孙子兵法-火攻篇",
        data: [
            { context: "孙子曰：凡火攻有五：一曰火人，二曰火积，三曰火辎，四曰火库，五曰火队。行火必有因，烟火必素具。发火有时，起火有日。时者，天之燥也；日者，月在箕、壁、翼、轸也。凡此四宿者，风起之日也。 " },
            { context: "凡火攻，必因五火之变而应之。火发于内，则早应之于外。火发兵静者，待而勿攻，极其火力，可从而从之，不可从而止。火可发于外，无待于内，以时发之。火发上风，无攻下风。昼风久，夜风止。凡军必知有五火之变，以数守之。 " },
            { context: " 故以火佐攻者明，以水佐攻者强。水可以绝，不可以夺。夫战胜攻取，而不修其功者凶，命曰费留。故曰：明主虑之，良将修之。非利不动，非得不用，非危不战。主不可以怒而兴师，将不可以愠而致战；合于利而动，不合于利而止。怒可以复喜，愠可以复悦；亡国不可以复存，死者不可以复生。故明君慎之，良将警之，此安国全军之道也。" },
        ]
    }, {
        title: "孙子兵法-用间篇",
        data: [
            { context: "孙子曰：凡兴师十万，出征千里，百姓之费，公家之奉，日费千金；内外骚动，怠于道路，不得操事者，七十万家。相守数年，以争一日之胜，而爱爵禄百金，不知敌之情者，不仁之至也，非人之将也，非主之佐也，非胜之主也。故明君贤将，所以动而胜人，成功出于众者，先知也。先知者，不可取于鬼神，不可象于事，不可验于度，必取于人，知敌之情者也。 " },
            { context: "故用间有五：有因间，有内间，有反间，有死间，有生间。五间俱起，莫知其道，是谓神纪，人君之宝也。因间者，因其乡人而用之。内间者，因其官人而用之。反间者，因其敌间而用之。死间者，为诳事于外，令吾间知之，而传于敌间也。生间者，反报也。 " },
            { context: "故三军之事，莫亲于间，赏莫厚于间，事莫密于间。非圣智不能用间，非仁义不能使间，非微妙不能得间之实。微哉！微哉！无所不用间也。间事未发，而先闻者，间与所告者皆死。（莫亲于间：指没有比间谍更应成为亲信了。赏莫厚于间：指没有比间谍更应该得到丰富的奖赏了。事莫密于间：没有经间谍的事更应该保守机密了。间事未发：用间之事还没有开始进行。间与所告者皆死：间谍和告知用间之事的人都要处死。） " },
            { context: " 凡军之所欲击，城之所欲攻，人之所欲杀，必先知其守将，左右，谒者，门者，舍人之姓名，令吾间必索知之。" },
            { context: " 必索敌人之间来间我者，因而利之，导而舍之，故反间可得而用也。因是而知之，故乡间、内间可得而使也；因是而知之，故死间为诳事，可使告敌。因是而知之，故生间可使如期。五间之事，主必知之，知之必在于反间，故反间不可不厚也。" },
            { context: " 昔殷之兴也，伊挚在夏；周之兴也，吕牙在殷。故惟明君贤将，能以上智为间者，必成大功。此兵之要，三军之所恃而动也" },
        ]
    }]
}
//东周列国志
var demo05 = {
    title: "东周列国志 部分",
    name: "东周列国志 部分",
    data: [{
        title: "开篇诗",
        data: [
            { context: "道德三皇五帝，功名夏后商周；" },
            { context: "英雄五霸闹春秋，顷刻兴亡过手！" },
            { context: "青史几行名姓，北邙无数荒丘；" },
            { context: "前人田地后人收，说甚龙争虎斗。" },
        ]
    }, {
        title: "列国诗",
        data: [
            { context: "东迁强国齐郑最，荆楚渐横开桓文，" },
            { context: "楚庄宋襄和秦穆，迭为王霸得专征。" },
            { context: "晋襄景悼称世霸，平哀齐景思代兴。" },
            { context: "晋楚两衰吴越进，阖闾句践何纵横？" },
            { context: "春秋诸国难尽数，几派源流略可寻。" },
            { context: "鲁卫晋燕曹郑蔡，与吴姬姓同宗盟。" },
            { context: "齐由吕尚宋商裔，禹后杞越颛顼荆。" },
            { context: "秦亦顼裔陈祖舜，许始太岳各有生。" },
            { context: "及交战国七雄起，韩赵魏氏晋三分。" },
            { context: "魏与韩皆周同姓，赵先造父同嬴秦。" },
            { context: "齐吕改田即陈后，黄歇代楚熊暗倾。" },
            { context: "宋亡于齐鲁入楚，吴越交胜总归荆。" },
            { context: "周鼎既迁合从散，六国相随浙属秦。" },
        ]
    }, {
        title: "结尾诗",
        data: [
            { context: "卜世虽然八百年，半由人事半由天。" },
            { context: "绵延过历缘忠厚，陵替随波为倒颠。" },
            { context: "六国媚秦甘北面，二周失祀恨东迁。" },
            { context: "总观千古兴亡局，尽在朝中用佞贤" },
        ]
    }
    ]
}
//古典文学
var demo06 = {
    title: "古典文学",
    name: "古典文学",
    data: [{
        title: "与朱元思书",
        data: [
            { context: "风烟俱净，天山共色。从流飘荡，任意东西。自富阳至桐庐一百许里，奇山异水，天下独绝。" },
            { context: "水皆缥碧，千丈见底。游鱼细石，直视无碍。急湍甚箭，猛浪若奔。" },
            { context: "夹岸高山，皆生寒树，负势竞上，互相轩邈，争高直指，千百成峰。泉水激石，泠泠作响；好鸟相鸣，嘤嘤成韵。蝉则千转不穷，猿则百叫无绝。鸢飞戾天者，望峰息心；经纶世务者，窥谷忘反。横柯上蔽，在昼犹昏；疏条交映，有时见日。" },
        ]
    }, {
        title: "西山陋室一碗粥",
        data: [
            { context: "想当年西山陋室一碗粥" },
            { context: "滋养的岂止是一部红楼" },
            { context: "卖书的因你尝了甜头" },
            { context: "写文的因你评了教授" },
            { context: "无业的靠你立了机构" },
            { context: "经营的拿你酿了烧酒" },
            { context: "聪明的把你化了旅游......" },
            { context: "先生的遗产好似不尽长江滚滚流，溯源头只是西山陋室一碗粥" },
        ]
    }, {
        title: "孤星独吟",
        data: [
            { context: "孤星独吟，风云易变，只情不忘。月照亭台依旧，这年冬，与谁芬芳？想前尘，柳下伴书香。只如今孤星独唱吟，路迢迢，尽是凄凉。雪夜残宵，难诉寸裂柔肠。 这雪夜笛萧，怎诉？一人独吟，谁和？" },
        ]
    }, {
        title: "孤星独吟-逝",
        data: [
            { context: "孤星独吟意翩跹 " },
            { context: "萧声撩拨弄琴弦 " },
            { context: "莫道天涯海角远 " },
            { context: "碧海潮生曲连天" },
        ]
    }, {
        title: "笑傲江湖",
        data: [
            { context: " 天下风云出我辈，一入江湖岁月催， " },
            { context: " 皇图霸业谈笑中，不胜人生一场醉。  " },
            { context: "提剑跨骑挥鬼雨， 白骨如山鸟惊飞;  " },
            { context: "尘事如潮人如水， 只叹江湖几人回" },

        ]
    }, {
        title: "兰亭集序",
        data: [
            { context: "永和九年，岁在癸丑，暮春之初，会于会稽山阴之兰亭，修禊事也。群贤毕至，少长咸集。此地有崇山峻岭，茂林修竹，又有清流激湍，映带左右，引以为流觞曲水，列坐其次。虽无丝竹管弦之盛，一觞一咏，亦足以畅叙幽情。" },
            { context: "是日也，天朗气清，惠风和畅。仰观宇宙之大，俯察品类之盛，所以游目骋怀，足以极视听之娱，信可乐也。" },
            { context: "夫人之相与，俯仰一世。或取诸怀抱，悟言一室之内；或因寄所托，放浪形骸之外。虽趣舍万殊，静躁不同，当其欣于所遇，暂得于己，快然自足，不知老之将至；及其所之既倦，情随事迁，感慨系之矣。向之所欣，俯仰之间，已为陈迹，犹不能不以之兴怀，况修短随化，终期于尽！古人云：“死生亦大矣。”岂不痛哉！" },
            { context: "每览昔人兴感之由，若合一契，未尝不临文嗟悼，不能喻之于怀。固知一死生为虚诞，齐彭殇为妄作。后之视今，亦犹今之视昔，悲夫！故列叙时人，录其所述，虽世殊事异，所以兴怀，其致一也。后之览者，亦将有感于斯文。" },

        ]
    }, {
        title: "滕王阁序",
        data: [
            { context: "豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。" },
            { context: "时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。" },
            { context: "披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。" },
            { context: "遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？" },
            { context: "嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！" },
            { context: "勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？" },
            { context: "呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：" },
        ]
    }, {
        title: "忆江南",
        data: [
            { context: "江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？" },
        ]
    }, 
    //自古表白多白表，从来姻缘没原因。笑叹少年多年少，哪知自负终负自。悠长情书难书情，惨遭拒绝成绝句。纵使往事皆失望，他朝逢春沐春风。不惧历练结连理，一旦爱久忘旧爱。空慕道德欲得道，怎知俗世多世俗。莫忆青年悔年轻，唯与生人道人生。
    {
        title: "摸鱼儿·雁丘词",
        data: [
            { context: "问世间，情为何物，直教生死相许？天南地北双飞客，老翅几回寒暑。欢乐趣，离别苦，就中更有痴儿女。君应有语，渺万里层云，千山暮雪，只影向谁去？" },
        ]
    }, 
    
    {
        title: "国标二十四式太极拳口诀",
        data: [
            { context: "1.起式" },
            { context: "2.左右野马分鬃" },
            { context: "3.白鹤亮翅" },
            { context: "4.左右搂膝拗步" },
            { context: "5.手挥琵琶" },
            { context: "6.左右倒卷肱" },
            { context: "7.左拦雀尾" },
            { context: "8.右拦雀尾" },
            { context: "9.单鞭" },
            { context: "10.云手" },
            { context: "11.单鞭" },
            { context: "12.高探马" },
            { context: "13.右蹬脚" },
            { context: "14.双峰贯耳" },
            { context: "15.转身左蹬脚" },
            { context: "16.左下式独立" },
            { context: "17.右下式独立" },
            { context: "18.左右穿梭" },
            { context: "19.海底针" },
            { context: "20.闪通臂" },
            { context: "21.转身搬拦捶" },
            { context: "22.如封似闭" },
            { context: "23.十字手" },
            { context: "24.收式" },
        ]
    }
    ]
}
//英文签名
var demo07 = {
    title: "英文签名",
    name: "英文签名",
    data: [{
        title: "一句英文签名",
        data: [
            { context: "" },
            { context: "" },
            { context: "I like you,but just like you" },
            { context: "纵然万劫不复， 纵然相思入骨，我也待你眉眼如初，岁月如故" },
            { context: "Knowing is not enough,we must apply. Willing is not enough, we must do" },
            { context: "光知道不够，得学会运用，光有决心不行，得付出行动。" },
            { context: "May the best if your todays be the worst of your tomorrows" },
            { context: "愿你的明天只会过得比今天更好" },
            { context: "For being different,it's easy,But to be unique ,it's complicated thing" },
            { context: "与众不同很简单，独一无二却不容易" },
            { context: "i love you as no love on earth is wrought;i love you now and love you evermore" },
            { context: "世间的哎有千千万，也不及我爱你，从今往后，有增无减" },
            { context: "Never look back unless you are planning to go that way" },
            { context: "永远不要回头，除非你想走回头路" },
            { context: "Beauty is found within" },
            { context: "美源自内心" },
            { context: "We grow fearless when we do the things we fear" },
            { context: "做自己畏惧的事，会让我们变的无所畏惧" },
            { context: "Doubt kills more dreams than failure ever will" },
            { context: "比起失败，怀疑自己会扼杀更多的梦想" },
            { context: "Great men are not born great; they grow great" },
            { context: "伟大的人 并非生来如此，是经历造就了他们的伟大" },
            { context: "Success is not forever and failure isn't fatal" },
            { context: "没有永远的成功，亦无致命的失败" },
            { context: "The very essence of romance is uncertainty" },
            { context: "浪漫的精髓就在于它充满种种可能" },
            { context: "The key to winning is poise under stress" },
            { context: "获胜的关键是在压力下依旧保持镇静" },
            { context: "Beauty is how you feel inside,and it reflects in your eyes" },
            { context: "美是一种内心的感觉，并反映在你的眼睛里" },
            { context: "What's comming will come, and we'll meet it when it does" },
            { context: "该来的总会来，我们只要迎接即可" },
            { context: "Without new experiences,something inside of us sleeps" },
            { context: "没有新乡的经历，我们内心的某些东西就会沉睡" },
            { context: "Just because someone stumbles and loses their path,doesn't mean they're lost forever." },
            { context: "人偶尔会失足、迷失方向，但不等于会永远迷失下去" },
            { context: "Dare, and the world always yields" },
            { context: "大胆挑战，世界总会让步" },
            { context: "it is beautiful day.do not let it get away" },
            { context: "今天如此美好，不要白白浪费" },
            { context: "it is up to you to give life a meaning" },
            { context: "生命的意义由你自己来赋予" },
            { context: "tomrrow is always fresh, with no mistakes in it yet" },
            { context: "明日永远新鲜如初，纤尘不染" },
            { context: "Any time spent being unhappy is wasted" },
            { context: "任何不快乐的时光都是浪费" },
            { context: "like so many things,it is not what is outside, but what is inside that counts" },
            { context: "许多事物都是如此，外表看起来虽不起眼，但是内在却惊为天人" },
            { context: "Today's special moments are tomorrow's menories" },
            { context: "今天的特别时刻，将会成为明天的美好回忆" },
            { context: "Creativity is intelligence having fun" },
            { context: "创意是智慧在找乐子" },
            { context: "You are strong because you are imperfect.you are wise because you have doubts" },
            { context: "因为不完美，所以才强大。因为有疑虑，所以才睿智" },
        ]
    }, {
        title: "On time 准时",
        data: [
            { context: "New York is 3 hours ahead of California" },
            { context: "纽约时间比加州时间早三个小时" },
            { context: "but it does not make Callifornia slow," },
            { context: "但加州时间并没有变慢" },
            { context: "Someone graduated at the age of 22, " },
            { context: "有人22岁毕业了" },
            { context: "but waited 5 years before securing a good job," },
            { context: "但等了五年才找到好的工作" },
            { context: "Someone became a CEO at 25," },
            { context: "有人25岁就当上了CEO" },
            { context: "and died at 50, " },
            { context: "却在50岁去世" },
            { context: "While another became a CEO at 50," },
            { context: "也有人迟到50岁才当上CEO" },
            { context: "and lived to 90 years," },
            { context: "然后活到了90岁" },
            { context: "Someone is still single " },
            { context: "有人依然单身" },
            { context: "While someone else got married," },
            { context: "同时也有人已婚" },
            { context: "Obama retires at " },
            { context: "55，奥巴马55岁就退休，" },
            { context: "but Trump starts at 70," },
            { context: "川普70岁才开始当总统" },
            { context: "Absoutely everyone in this world works based on their Time Zone," },
            { context: "世上每个人本来就有自己的发展时区" },
            { context: "People around you might seem to go ahead of you," },
            { context: "身边有些人看似走在你前面" },
            { context: "some might seem to be behind you," },
            { context: "也有人看似走在你后面" },
            { context: "But everyone is running their own race, in their own time," },
            { context: "但其实每个人在自己的市区有自己的步程" },
            { context: "don’t envy them or mock them " },
            { context: "，不用嫉妒或嘲笑他们" },
            { context: "they are in their time zone,and you are in yours," },
            { context: "他们都在自己的时区里，你也是" },
            { context: "Life is about waiting for the right moment to act," },
            { context: "生命就是等待正确的行动时机" },
            { context: "So,Relax " },
            { context: "所以,放轻松。" },
            { context: "You're not late " },
            { context: "你没有落后" },
            { context: "you're not early " },
            { context: "你没有领先" },
            { context: "you are very much on time ,and in your time zone destiny set up for you," },
            { context: "在命运为你安排的属于自己的时区里，一切都准时" },
        ]
    }]
}
//经典短句抄录
var demo08 = {
    title: "经典短句抄录",
    name: "经典短句抄录",
    data: [{
        title: "经典短句集一",
        data: [
            { context: "机遇只垂青于那些追求她的人" },
            { context: "盖世人读书，第一要有志，第二要有识，第三要有恒。有志则不甘为下流；有识则知学问无尽，不敢以一得自足，如河伯之观海，如井蛙之窥天，皆无识者也；有恒则断无不成之事。" },
            { context: "我们到了尴尬的年纪，此时谈爱已晚，谈死尚早，和年轻人谈经历太幼稚，和老人们谈人生太肤浅，想出去放纵一下又觉得喧嚣难忍，想一个人静静又心有不甘。想任性点，人家说你要成熟；想沉默些，人家说你装清高；想时尚点，人家说你有点妖；想朴素些，人家说你有点老。刚想消极放弃，却发现上有老，下有小" },
            { context: "" },
            { context: "生气1小时＝熬夜6小时，所以啊，好好吃饭，好好睡觉，好好挣钱，好好花钱，不为不值得的人生气，不为不值得的事失眠，既然活着就好好活着，每分钟都为自己活着。" },
            { context: "人所缺乏的不是才干而是志向，不是成功的能力而是勤劳的意志" },
            { context: "我以为别人尊重我，是因为我很优秀；后来才明白，别人尊重我，是因为别人很优秀" },
            { context: "坚持的本身，就是一种不易" },
            { context: "种瓜得瓜 种豆得豆 施薄报薄 施厚报厚 有施无报。何异禽兽" },
            { context: "据《汉书&#8226;艺文志》载，兵家有四种，即兵形势家、兵权谋家、兵阴阳家和兵技巧家" },
            { context: "人心就是如此，见贵者谄，遇贱者骄，天上的风向变了，地上的草木也得跟着折腰，这就是生存之道。" },
            { context: "都是下九流。别谁也瞧不起谁。" },
            { context: "历史就在眼前 却证明不了" },
            { context: "人们常说人心不古，其实每个人都是人心 当年那个吝茶者是，我这个施茶者也是，当遇到他时，你就会感到人心不古，世风日下，当遇到我时，你就会感到世风尚好，人心有救" },
            { context: "假的太多 殊不知我们每个人 都是在组成这世界假的一部分" },
            { context: "所有的热闹过后 都如烟花散尽  热闹是他们的 我什么也没有" },
            { context: "仗义多晒屠狗辈 负心多是读书人" },
            { context: "我们只不过是要努力奋斗，使当初的选择变得正确" },
            { context: "不要试图鹤立鸡群，而要离开那群鸡" },
            { context: "社交网络最可怕的地方，在于把光阴虚度的好像很充实" },
            { context: "他们把对客户的研究了解，结合自身的长处，发挥到极致，---狼文化正解" },
            { context: "读书终是读自己 ----- 白岩松 （以上摘自2017.3.1）" },
            { context: "自由是见惯各种活法，却不羡慕，不嫉妒，不必是，安心走在自己的人生路上，不慌张，不急躁，在日复一日的坚持中活得越来越像自己" },
            { context: "天下若没有花，什么也不用提了，因为有花我们就得去闻；天下若没有鸟声，什么也不用提了，既然有了鸟声，我们就得去听，天下既然有了女人，我们就得去爱。就得怜香惜玉。" },
            { context: "智商低，情商高的人，总能有贵人相助；智商高，情商低的人，总觉得生不逢时" },
            // { context: "莫笑此生心不闲，流云惊风舞晴天 2016.9.30" },
            { context: "人们总是喜欢拿“顺其自然”来敷衍人生道路上的荆棘坎坷，却很少承认，真正的顺其自然，其实是竭尽所能之后的不强求，而非两手一摊的不作为。" },
            { context: "我们为什么非要读书不可呢？「你们给我好好觉醒吧。还不明白吗？读书，不是非做不可的事。而是想要去做的事。今后你们可能会碰到很多很多你们不知道的事。也会碰到很多你们觉得美好的、开心的、不可思议的事物。这时候做为一个人，自然想了解更多，学习更多。失去好奇心和求知欲的人，不能称为人，连猴子都不如。连自己生存的这个世界都不想理解。还能做什么呢？不论如何学习，只要人活著，就有很多不懂的东西。这个世界上有很多大人好像什么都懂的样子，那都是骗人的。进了大学也好，进了好公司也好，如果有活到老学到老的想法，那就有无限的可能性。失去好奇心的那一瞬间，人就死了。读书不是为了考试，而是为了成为出色的大人。 」 ----《女王的教室》" },
        ]
    }]
}
data = [demo01, demo02, demo03, demo04, demo05, demo06, demo07, demo08]