// 西北游记一

// 穷山恶水出刁民，钟灵毓秀出人才，古人不欺我。在这火车之上就是一个小社会，回想大河北遇到的人，素质比这好了不知几何。这是民风彪悍的象征吗。

// 火车上勇于让座，体现的是素质，一种骨子里的素质，至少我没做到，同是西北人，也分地域。结论便是河北地区 即使是农村也属于钟灵毓秀了。

// 文化，国人的基础平均素质有待提高。上车不动。觉悟不够。这已经不是文化问题了。坏人的习惯于好人的习惯都是会传递的。莫名想起了茶客。这世道是否有救，全看民心。

// 决定境界的不是文化，而是素质。如果在那种情况下教育出来的人，素质必然不会太高。教育本就不仅仅是学校的责任，家庭环境影响更甚。而这环境对人影响更是深远。一人救不了西北。平均素质在那里摆着，文化也跟不上，反应意识也没有。

// 都没错，道德的东西本来就无对错之分。全是素质高低而已，与人方便，与己方便。

// 活着不易且行且珍惜

/**
西北游记三  

塔尔寺 四绝 唐卡 酥油茶画   拉脊山 牧民的奶茶 酸奶

 */
/**
 西北游记四

今天行程从日出开始
 茶卡的盐湖
 */
/**
 西北游记五

当所有的东西归于虚无的时候 连公路都显的那么美

所有未见过的东西 都是最美的，荒凉的隔壁 沙漠等等 只有这样 戈壁草才显的那么珍贵

卡丹地貌 丹霞地貌 只有真正见识过才能更容易区分这些

鸣沙山的日落 大漠的荒凉能营造出如此绝妙的美景大自然的鬼斧神工确实不是人类能够仿造的
沙滩的摩托车确实刺激 
沙漠不是自己原来想象的样子。大漠非平原而多沙丘与自己想象的不一样
 */

 /**
 西北游记六

早上吃饭方圆没有吃的
莫高窟游记 破坏严重 这些东西就不应该出土 就应该像楼兰古城一样葬在这黄沙之中。如乾陵一样保持原貌
喜欢无字碑的人应该也会喜欢着莫高窟，如果我是一位画家我也喜欢同台竞技，无关成败后人评说
莫高窟的宝贵不在文化，最珍贵的应该是传承，一代代才俊 一代代，江山代有才人出，各领风骚数百年 而莫高窟就是这样的一座宝库，现在的人多了一份浮躁，从宋代都开始了 延续到今的不是艺术而是浮躁之气 可悲可叹上

朝代变迁，历史更迭，不变的是。这大漠风光存在千年，千年一叹确实是适合那亘古不变可发一叹的场景

中国人如果有信仰这些东西算什么

黄水晶爱到底埋藏多少故事 知道的未知道的
 */

 /**
 西北游记七
喝酒的我就起不来，现在的脑袋还晕晕乎乎，早上一碗豆浆一个肉夹馍差不多了

一直处于河西走廊的跑路中，中午椒麻鸡
丹霞地貌

喝酒做游戏
 */

 /**
西北游记八

日出随便找的山头
 
 */



 /**
        刹那樱花

    无意中看到樱花的花期只有大概一周的时间 ， 路过北大校园院墙的时候看见桃花开的那般鲜艳，而樱花将要落尽，可以知道看到的资料不虚。前几天的樱花还与桃花争奇斗艳而今天却是另一片景象。樱花从来不为人而开，他的美丽只属于刹那。

    曾见过顺平的桃花，洛阳的牡丹，路边的梅花。青海的油菜。家乡的栗花，植物园的迎春，丰润的银杏，唐山的梧桐。每一个都给我深刻的印象。樱花与其不同的地方，也许就是他从不来不为人开放，只为自己开放，错过了就是错过了。

    许多的花生来就是等待人，只有他是为自己而开的。樱花的美丽不会停留在时间里，只会停留在记忆中

  未完待续....
  * 
  * 
  */



  /**
   * 
  江苏之行   端午假期
        -- 20190606 - 20190608 
  5号晚上就出发了 北京站到南京 19点多的火车第二天早上五点多到的南京，这样就开启了整个江苏之行
  5号 
    意外之喜 - 大栅栏
  6号 
    老门东
    江南多雨 - 秦淮河畔夫子庙
        古人云江南多雨，古人诚不欺我，第一次来这江南就赶上了梅雨时节，而我临行之时忘记带雨伞，还好江苏南京地铁可以租借雨伞。但是只收现金。虽说电子时代的今天。现金还是硬通货啊。 有了现金租了雨伞，然后目标就去了秦淮河
        秦淮河一个让人浮想联翩的地方。古来多少文人墨客在这里，但是没有来过的人，心中也许只有秦淮河吧，殊不知对面就是夫子庙，可以说是以前所有高级知识分子汇聚的地方，所以和当今人们想想的并不一样，雨天走在这秦淮河畔更有一种古镇的感觉。这样的老街，对于我这种农村出来的特别新鲜，从来没见过小桥流水，在整个苏州随处可见。
        青楼与妓院是有区别的 那样的历史文化沉淀，又怎会没有大义呢。
    天下为公 - 总统府
        民族英雄永垂不朽。蒋公千古。没啥说的，成王败寇，红色注意的当今，谁又能宣传那青天白日，即使红色主义，也抹不去抗日战争你的功绩，也会记得清王朝被谁推翻的。于世界交流，可以说中国的地基是你打下的，历史没有如果，只是没有给你更多的时间来平定国内的矛盾。你值的我敬一杯。
    六朝古都 - 博物院
        不忘历史才能进步，我们曾经辉煌，也曾没落，但依然没有停止传承，我们的历史，我们铭记，了解南京，了解整个江苏还是博物院最好，这片中国大地任何的角落，每一寸土地，都曾经辉煌过，所谓的历史需要铭记，只有铭记过后，才能传承，这就是巨人的肩膀。
    三民主义 - 中山陵 民族民权民生
        青天白日满地红旗从你开始，我知道你走了，但三民主义，精神永存，是你开拓人们的思想。历史本来就是用鲜血书写的，三民主义到如今仍然适用，你开近代中国之心智。三民主义永记心间，这才是中国人的信仰。
        失民心易，得民心难啊，
    江南古镇 - 周庄
        南京奔苏州，从苏州下午六点去了周庄，江苏的车站果然是到了旅行的时节，本以为一票难求最终还是有去那里的大巴。在大巴上面，体会了苏州多水的感觉，湖面随处可见，打开了地图，我震惊了，整个苏州古镇之名随处可见。也许名字是最不值钱的东西了吧。对于我这样的北方人，才会来体会这些所谓的古镇。由是想到，我家乡的小村子又何尝不是北方的古镇的之名呢。
        一路无话，来到了江南小镇。似乎未脱其稚气，晚上八点多到的，居然很多店铺都已想着下班回家了。而我只想访这夜色下的江南水乡。这份宁静才是我梦寐以求的东西。从南到北，从东到西，都不是太远的距离，也并未见漫天繁星，相比于凤凰，缺少了一份灵动。它晚上沉寂了。安静才是对其最好的评价吧
        白天的周庄人渐渐多了，商业化的店铺。鳞次栉比一间挨着一间，最后顺着街走了走，找到了江南第一古镇，感觉原来也就这样啊。周庄里面有一道观和一寺庙，两个都去了佛教确实比道教有钱，查了一些资料，倒角比佛教更严格，不遇人不传教，道教只有一观，佛教里面东西就多了。这才是周国人目前的信仰吧，道教才是我们本土的文化啊。逛完了之后去了苏州。
  7号 
    人满为患 - 苏州园林
      苏州园林博物馆应该是最值得来的一个地方了吧，查了票三天之内，人满为患，所以我进不去啊。之后钻进了拙政园。
    四大名园 - 拙政园
      一直以为民间的园林和皇家园林没法比。所以一直想看看拙政园是什么样子，为什么能和皇家园林并列
    狮子林

    平江路 观前街

    金鸡湖
  8号
    留园
    寒山寺
    虎丘
    胥门 平门 苏州站。


  吃货总结
    老门东的烧饼
    早上的包子  
    8号早上的粥 包子不咋地
    口水鸡


吴：凝聚意志 保卫领袖，这八个字我研究了十五年哪，从复兴社到现在。
余：您研究出什么结果了？
吴：结果就是，人不为己 天诛地灭
   */

/**
 * 给青年的十二封信
 谈读书
  读书就是自己的事情，只有读的越多，才能找到自己的方向，与任何东西无关。没人能够规定你要读什么，也没人能够说出什么书是好的还是坏的

  从不读书到读书是一种跨越，从读书到读好书也是一种跨越，这些都是自己的历程还有读下去才能更好的确定自己的兴趣所在，并不是被人教出来的而是自己的走出来的。
 */

/**
 * 中国文物常识   -- 沈从文
 
 名岂文章著
文章并不是谁都写的 只有深厚的功底方能写出

那时候的文人实在真正的做事啊

书籍不错，文物常识让我们知道了很多关于文物的东西，特别是分类。大大的拓宽了我们的视野，我们普通人欣赏文物，只喜欢那些精美的东西，但是文物得历史价值并不是单纯的只有精美，只有如这般具体了解，我们在看文物的时候才能发现其中的历史变迁。一件我们认为的精美的文物，其中经过了近千年的文化变迁。对于外行的我们也许不喜欢商周时候的那些瓦瓮，但是后期的琉璃盘子都是通过他演变过来的。说实话我还是更喜欢最后的精美的东西，但是至少让我知道了这些东西的不易。这也许就是收货吧。

古人的智慧体现在一砖一瓦，一针一线，一笔一划。这份认真足以让人惊叹。人类最伟大的就是惊人的想象力。任何艺术形式，靠的都是这惊人的想象了。这真是太不可思议，而其中他们还能把这惊人想象力具体化。已经不能用惊叹来形容了。古人已经为我们开拓了一片天空，我们如何在这片天空的基础上发挥我们自己的想象力，创造更大的世界，这也许才是当今学者们该想的一件事情吧。

科普的书籍，犹豫身边并无多少文物，所以记住的并不多。但是其中文物的历史真的很值得研究，作者只是为读者打开了n扇大门，我们完全可以随便选一扇门进去，里面都会是一片世界，因为我们的任何一类都是一门艺术。而任何一门艺术都是一片世界。艺术无止境。从历史到文物，而历史永远跳不出政治与经济与文化。然后就会转变成未来的发展。最后都会变成哲学问题。



 * 第一讲　玉工艺
中国古玉
玉的应用
玉的价值判断色泽问题
第二讲　陶瓷及玻璃
中国古代陶瓷
清初陶瓷加工
玻璃工艺的历史探讨
第三讲　镜子史话
镜子的故事（上）
镜子的故事（下）
古代镜子的艺术
第四讲　漆器、螺甸工艺及马的艺术
漆工艺问题
我们从古漆器可学些什么
螺甸工艺试探
从一个马镫图案谈谈中国马具的发展及对于金铜漆镶嵌工艺的影响关系
第五讲　古人的“脚”与“手”
谈辇舆
谈车乘
扇子史话
第六讲　织绣染缬
谈锦——矩纹锦的本源及其发展
织金锦
谈刺绣
谈染缬——蓝底白印花布的历史发展
第七讲　服饰与胡子
从文物中所见古代服装材料和其他生活事物点点滴滴
古代人的穿衣打扮
我国古代人怎么穿衣打扮
宋元时装
从文物来谈谈古人的胡子问题
第八讲　龙凤和狮子艺术
龙凤艺术——龙凤图案的应用和发展
鱼的艺术——鱼的图案在人民生活中的应用及发展
狮子在中国艺术上的应用及其发展
第九讲　纸与字
谈金花笺
谈写字（一）
谈写字（二）
 */

/**
 给青少年的十二封信
 谈读书


 */