// 西北游记一

// 穷山恶水出刁民，钟灵毓秀出人才，古人不欺我。在这火车之上就是一个小社会，回想大河北遇到的人，素质比这好了不知几何。这是民风彪悍的象征吗。

// 火车上勇于让座，体现的是素质，一种骨子里的素质，至少我没做到，同是西北人，也分地域。结论便是河北地区 即使是农村也属于钟灵毓秀了。

// 文化，国人的基础平均素质有待提高。上车不动。觉悟不够。这已经不是文化问题了。坏人的习惯于好人的习惯都是会传递的。莫名想起了茶客。这世道是否有救，全看民心。

// 决定境界的不是文化，而是素质。如果在那种情况下教育出来的人，素质必然不会太高。教育本就不仅仅是学校的责任，家庭环境影响更甚。而这环境对人影响更是深远。一人救不了西北。平均素质在那里摆着，文化也跟不上，反应意识也没有。

// 都没错，道德的东西本来就无对错之分。全是素质高低而已，与人方便，与己方便。

// 活着不易且行且珍惜

/**
西北游记三  

塔尔寺 四绝 唐卡 酥油茶画   拉脊山 牧民的奶茶 酸奶

 */
/**
 西北游记四

今天行程从日出开始
 茶卡的盐湖
 */
/**
 西北游记五

当所有的东西归于虚无的时候 连公路都显的那么美

所有未见过的东西 都是最美的，荒凉的隔壁 沙漠等等 只有这样 戈壁草才显的那么珍贵

卡丹地貌 丹霞地貌 只有真正见识过才能更容易区分这些

鸣沙山的日落 大漠的荒凉能营造出如此绝妙的美景大自然的鬼斧神工确实不是人类能够仿造的
沙滩的摩托车确实刺激 
沙漠不是自己原来想象的样子。大漠非平原而多沙丘与自己想象的不一样
 */

 /**
 西北游记六

早上吃饭方圆没有吃的
莫高窟游记 破坏严重 这些东西就不应该出土 就应该像楼兰古城一样葬在这黄沙之中。如乾陵一样保持原貌
喜欢无字碑的人应该也会喜欢着莫高窟，如果我是一位画家我也喜欢同台竞技，无关成败后人评说
莫高窟的宝贵不在文化，最珍贵的应该是传承，一代代才俊 一代代，江山代有才人出，各领风骚数百年 而莫高窟就是这样的一座宝库，现在的人多了一份浮躁，从宋代都开始了 延续到今的不是艺术而是浮躁之气 可悲可叹上

朝代变迁，历史更迭，不变的是。这大漠风光存在千年，千年一叹确实是适合那亘古不变可发一叹的场景

中国人如果有信仰这些东西算什么

黄水晶爱到底埋藏多少故事 知道的未知道的
 */

 /**
 西北游记七
喝酒的我就起不来，现在的脑袋还晕晕乎乎，早上一碗豆浆一个肉夹馍差不多了

一直处于河西走廊的跑路中，中午椒麻鸡
丹霞地貌

喝酒做游戏
 */

 /**
西北游记八

日出随便找的山头
 
 */