var demo = {
    title: "古典文学",
    name: "古典文学",
    data: [{
        title: "与朱元思书",
        data: [
            { context: "风烟俱净，天山共色。从流飘荡，任意东西。自富阳至桐庐一百许里，奇山异水，天下独绝。" },
            { context: "水皆缥碧，千丈见底。游鱼细石，直视无碍。急湍甚箭，猛浪若奔。" },
            { context: "夹岸高山，皆生寒树，负势竞上，互相轩邈，争高直指，千百成峰。泉水激石，泠泠作响；好鸟相鸣，嘤嘤成韵。蝉则千转不穷，猿则百叫无绝。鸢飞戾天者，望峰息心；经纶世务者，窥谷忘反。横柯上蔽，在昼犹昏；疏条交映，有时见日。" },
        ]
    }, {
        title: "归去来兮辞 - 陶渊明",
        data: [
            { context: "余家贫，耕植不足以自给。幼稚盈室，瓶无储粟，生生所资，未见其术。亲故多劝余为长吏，脱然有怀，求之靡途。会有四方之事，诸侯以惠爱为德，家叔以余贫苦，遂见用于小邑。于时风波未静，心惮远役，彭泽去家百里，公田之利，足以为酒。故便求之。及少日，眷然有归欤之情。何则？质性自然，非矫厉所得。饥冻虽切，违己交病。尝从人事，皆口腹自役。于是怅然慷慨，深愧平生之志。犹望一稔，当敛裳宵逝。寻程氏妹丧于武昌，情在骏奔，自免去职。仲秋至冬，在官八十余日。因事顺心，命篇曰《归去来兮》。乙巳岁十一月也。" },
            { context: "归去来兮，田园将芜胡不归？既自以心为形役，奚惆怅而独悲？悟已往之不谏，知来者之可追。实迷途其未远，觉今是而昨非。舟遥遥以轻飏，风飘飘而吹衣。问征夫以前路，恨晨光之熹微。" },
            { context: "乃瞻衡宇，载欣载奔。僮仆欢迎，稚子候门。三径就荒，松菊犹存。携幼入室，有酒盈樽。引壶觞以自酌，眄庭柯以怡颜。倚南窗以寄傲，审容膝之易安。园日涉以成趣，门虽设而常关。策扶老以流憩，时矫首而遐观。云无心以出岫，鸟倦飞而知还。景翳翳以将入，抚孤松而盘桓。" },
            { context: "归去来兮，请息交以绝游。世与我而相违，复驾言兮焉求？悦亲戚之情话，乐琴书以消忧。农人告余以春及，将有事于西畴。或命巾车，或棹孤舟。既窈窕以寻壑，亦崎岖而经丘。木欣欣以向荣，泉涓涓而始流。善万物之得时，感吾生之行休。" },
            { context: "已矣乎！寓形宇内复几时？曷不委心任去留？胡为乎遑遑欲何之？富贵非吾愿，帝乡不可期。怀良辰以孤往，或植杖而耘耔。登东皋以舒啸，临清流而赋诗。聊乘化以归尽，乐夫天命复奚疑！" },
            { context: "" },

        ]
    }, {
        title: "(前)出师表",
        data: [
            { context: "先帝创业未半而中道崩殂，今天下三分，益州疲弊，此诚危急存亡之秋也。然侍卫之臣不懈于内，忠志之士忘身于外者，盖追先帝之殊遇，欲报之于陛下也。诚宜开张圣听，以光先帝遗德，恢弘志士之气，不宜妄自菲薄，引喻失义，以塞忠谏之路也。" },
            { context: "宫中府中，俱为一体，陟罚臧否，不宜异同。若有作奸犯科及为忠善者，宜付有司论其刑赏，以昭陛下平明之理，不宜偏私，使内外异法也。" },
            { context: "侍中、侍郎郭攸之、费祎、董允等，此皆良实，志虑忠纯，是以先帝简拔以遗陛下。愚以为宫中之事，事无大小，悉以咨之，然后施行，必能裨补阙漏，有所广益。" },
            { context: "将军向宠，性行淑均，晓畅军事，试用于昔日，先帝称之曰能，是以众议举宠为督。愚以为营中之事，悉以咨之，必能使行阵和睦，优劣得所。" },
            { context: "亲贤臣，远小人，此先汉所以兴隆也；亲小人，远贤臣，此后汉所以倾颓也。先帝在时，每与臣论此事，未尝不叹息痛恨于桓、灵也。侍中、尚书、长史、参军，此悉贞良死节之臣，愿陛下亲之信之，则汉室之隆，可计日而待也。" },
            { context: "臣本布衣，躬耕于南阳，苟全性命于乱世，不求闻达于诸侯。先帝不以臣卑鄙，猥自枉屈，三顾臣于草庐之中，咨臣以当世之事，由是感激，遂许先帝以驱驰。后值倾覆，受任于败军之际，奉命于危难之间，尔来二十有一年矣。" },
            { context: "先帝知臣谨慎，故临崩寄臣以大事也。受命以来，夙夜忧叹，恐托付不效，以伤先帝之明，故五月渡泸，深入不毛。今南方已定，兵甲已足，当奖率三军，北定中原，庶竭驽钝，攘除奸凶，兴复汉室，还于旧都。此臣所以报先帝而忠陛下之职分也。至于斟酌损益，进尽忠言，则攸之、祎、允之任也。" },
            { context: "愿陛下托臣以讨贼兴复之效，不效，则治臣之罪，以告先帝之灵。若无兴德之言，则责攸之、祎、允等之慢，以彰其咎；陛下亦宜自谋，以咨诹善道，察纳雅言，深追先帝遗诏，臣不胜受恩感激" },
            { context: "今当远离，临表涕零，不知所言。" },

        ]
    }, {
        title: "后出师表",
        data: [
            { context: "先帝深虑汉、贼不两立，王业不偏安，故托臣以讨贼也。以先帝之明，量臣之才，固知臣伐贼，才弱敌强也。然不伐贼，王业亦亡。惟坐而待亡，孰与伐之？是故托臣而弗疑也。臣受命之日，寝不安席，食不甘味。思惟北征。宜先入南。故五月渡泸，深入不毛，并日而食；臣非不自惜也，顾王业不可得偏安于蜀都，故冒危难，以奉先帝之遗意也，而议者谓为非计。今贼适疲于西，又务于东，兵法乘劳，此进趋之时也。谨陈其事如左：" },
            { context: "高帝明并日月，谋臣渊深，然涉险被创，危然后安。今陛下未及高帝，谋臣不如良、平，而欲以长策取胜，坐定天下，此臣之未解一也。" },
            { context: "刘繇、王朗各据州郡，论安言计，动引圣人，群疑满腹，众难塞胸，今岁不战，明年不征，使孙策坐大，遂并江东，此臣之未解二也。" },
            { context: "曹操智计，殊绝于人，其用兵也，仿佛孙、吴，然困于南阳，险于乌巢，危于祁连，逼于黎阳，几败北山，殆死潼关，然后伪定一时耳。况臣才弱，而欲以不危而定之，此臣之未解三也。曹操五攻昌霸不下，四越巢湖不成，任用李服而李服图之，委任夏侯而夏侯败亡，先帝每称操为能，犹有此失，况臣驽下，何能必胜？此臣之未解四也。" },
            { context: "自臣到汉中，中间期年耳，然丧赵云、阳群、马玉、阎芝、丁立、白寿、刘郃、邓铜等及曲长、屯将七十余人，突将、无前、賨叟、青羌、散骑、武骑一千余人。此皆数十年之内所纠合四方之精锐，非一州之所有；若复数年，则损三分之二也，当何以图敌？此臣之未解五也。" },
            { context: "今民穷兵疲，而事不可息；事不可息，则住与行劳费正等。而不及今图之，欲以一州之地，与贼持久，此臣之未解六也。" },
            { context: "夫难平者，事也。昔先帝败军于楚，当此时，曹操拊手，谓天下以定。然后先帝东连吴越，西取巴蜀，举兵北征，夏侯授首，此操之失计，而汉事将成也。然后吴更违盟，关羽毁败，秭归蹉跌，曹丕称帝。凡事如是，难可逆见。臣鞠躬尽瘁，死而后已。至于成败利钝，非臣之明所能逆睹也。" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },

        ]
    }, {
        title: "陈情表 【作者】李密 【朝代】魏晋",
        data: [
            { context: "臣密言：臣以险衅，夙遭闵凶。生孩六月，慈父见背；行年四岁，舅夺母志。祖母刘悯臣孤弱，躬亲抚养。臣少多疾病，九岁不行，零丁孤苦，至于成立。既无伯叔，终鲜兄弟，门衰祚薄，晚有儿息。外无期功强近之亲，内无应门五尺之僮，茕茕孑立，形影相吊。而刘夙婴疾病，常在床蓐，臣侍汤药，未曾废离。" },
            { context: "逮奉圣朝，沐浴清化。前太守臣逵察臣孝廉，后刺史臣荣举臣秀才。臣以供养无主，辞不赴命。诏书特下，拜臣郎中，寻蒙国恩，除臣洗马。猥以微贱，当侍东宫，非臣陨首所能上报。臣具以表闻，辞不就职。诏书切峻，责臣逋慢。郡县逼迫，催臣上道；州司临门，急于星火。臣欲奉诏奔驰，则刘病日笃；欲苟顺私情，则告诉不许：臣之进退，实为狼狈。" },
            { context: "伏惟圣朝以孝治天下，凡在故老，犹蒙矜育，况臣孤苦，特为尤甚。且臣少仕伪朝，历职郎署，本图宦达，不矜名节。今臣亡国贱俘，至微至陋，过蒙拔擢，宠命优渥，岂敢盘桓，有所希冀。但以刘日薄西山，气息奄奄，人命危浅，朝不虑夕。臣无祖母，无以至今日；祖母无臣，无以终余年。母、孙二人，更相为命，是以区区不能废远。" },
            { context: "臣密今年四十有四，祖母今年九十有六，是臣尽节于陛下之日长，报养刘之日短也。乌鸟私情，愿乞终养。臣之辛苦，非独蜀之人士及二州牧伯所见明知，皇天后土，实所共鉴。愿陛下矜悯愚诚，听臣微志，庶刘侥幸，保卒余年。臣生当陨首，死当结草。臣不胜犬马怖惧之情，谨拜表以闻。" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "西山陋室一碗粥",
        data: [
            { context: "想当年西山陋室一碗粥" },
            { context: "滋养的岂止是一部红楼" },
            { context: "卖书的因你尝了甜头" },
            { context: "写文的因你评了教授" },
            { context: "无业的靠你立了机构" },
            { context: "经营的拿你酿了烧酒" },
            { context: "聪明的把你化了旅游......" },
            { context: "先生的遗产好似不尽长江滚滚流，溯源头只是西山陋室一碗粥" },
        ]
    }, {
        title: "孤星独吟",
        data: [
            { context: "孤星独吟，风云易变，只情不忘。月照亭台依旧，这年冬，与谁芬芳？想前尘，柳下伴书香。只如今孤星独唱吟，路迢迢，尽是凄凉。雪夜残宵，难诉寸裂柔肠。 这雪夜笛萧，怎诉？一人独吟，谁和？" },
        ]
    }, {
        title: "孤星独吟-逝",
        data: [
            { context: "孤星独吟意翩跹 " },
            { context: "萧声撩拨弄琴弦 " },
            { context: "莫道天涯海角远 " },
            { context: "碧海潮生曲连天" },
        ]
    }, {
        title: "笑傲江湖",
        data: [
            { context: " 天下风云出我辈，一入江湖岁月催， " },
            { context: " 皇图霸业谈笑中，不胜人生一场醉。  " },
            { context: "提剑跨骑挥鬼雨， 白骨如山鸟惊飞;  " },
            { context: "尘事如潮人如水， 只叹江湖几人回" },

        ]
    }, {
        title: "兰亭集序",
        data: [
            { context: "永和九年，岁在癸丑，暮春之初，会于会稽山阴之兰亭，修禊事也。群贤毕至，少长咸集。此地有崇山峻岭，茂林修竹，又有清流激湍，映带左右，引以为流觞曲水，列坐其次。虽无丝竹管弦之盛，一觞一咏，亦足以畅叙幽情。" },
            { context: "是日也，天朗气清，惠风和畅。仰观宇宙之大，俯察品类之盛，所以游目骋怀，足以极视听之娱，信可乐也。" },
            { context: "夫人之相与，俯仰一世。或取诸怀抱，悟言一室之内；或因寄所托，放浪形骸之外。虽趣舍万殊，静躁不同，当其欣于所遇，暂得于己，快然自足，不知老之将至；及其所之既倦，情随事迁，感慨系之矣。向之所欣，俯仰之间，已为陈迹，犹不能不以之兴怀，况修短随化，终期于尽！古人云：“死生亦大矣。”岂不痛哉！" },
            { context: "每览昔人兴感之由，若合一契，未尝不临文嗟悼，不能喻之于怀。固知一死生为虚诞，齐彭殇为妄作。后之视今，亦犹今之视昔，悲夫！故列叙时人，录其所述，虽世殊事异，所以兴怀，其致一也。后之览者，亦将有感于斯文。" },

        ]
    }, {
        title: "滕王阁序",
        data: [
            { context: "豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。" },
            { context: "时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。" },
            { context: "披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。" },
            { context: "遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？" },
            { context: "嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！" },
            { context: "勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？" },
            { context: "呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：" },
        ]
    }, {
        title: "别赋",
        data: [
            { context: "黯然销魂者，唯别而已矣！况秦吴兮绝国，复燕赵兮千里。或春苔兮始生，乍秋风兮暂起。是以行子肠断，百感凄恻。风萧萧而异响，云漫漫而奇色。舟凝滞于水滨，车逶迟于山侧。棹容与而讵前，马寒鸣而不息。掩金觞而谁御，横玉柱而沾轼。居人愁卧，怳若有亡。日下壁而沉彩，月上轩而飞光。见红兰之受露，望青楸之离霜。巡层楹而空掩，抚锦幕而虚凉。知离梦之踯躅，意别魂之飞扬。" },
            { context: "故别虽一绪，事乃万族。至若龙马银鞍，朱轩绣轴，帐饮东都，送客金谷。琴羽张兮箫鼓陈，燕、赵歌兮伤美人，珠与玉兮艳暮秋，罗与绮兮娇上春。惊驷马之仰秣，耸渊鱼之赤鳞。造分手而衔涕，感寂寞而伤神。" },
            { context: "乃有剑客惭恩，少年报士，韩国赵厕，吴宫燕市。割慈忍爱，离邦去里，沥泣共诀，抆血相视。驱征马而不顾，见行尘之时起。方衔感于一剑，非买价于泉里。金石震而色变，骨肉悲而心死。" },
            { context: "或乃边郡未和，负羽从军。辽水无极，雁山参云。闺中风暖，陌上草薰。日出天而耀景，露下地而腾文。镜朱尘之照烂，袭青气之烟煴，攀桃李兮不忍别，送爱子兮沾罗裙。" },
            { context: "至如一赴绝国，讵相见期？视乔木兮故里，决北梁兮永辞，左右兮魄动，亲朋兮泪滋。可班荆兮憎恨，惟樽酒兮叙悲。值秋雁兮飞日，当白露兮下时，怨复怨兮远山曲，去复去兮长河湄。" },
            { context: "又若君居淄右，妾家河阳，同琼珮之晨照，共金炉之夕香。君结绶兮千里，惜瑶草之徒芳。惭幽闺之琴瑟，晦高台之流黄。春宫閟此青苔色，秋帐含此明月光，夏簟清兮昼不暮，冬凝兮夜何长！织锦曲兮泣已尽，回文诗兮影独伤。" },
            { context: "傥有华阴上士，服食还仙。术既妙而犹学，道已寂而未传。守丹灶而不顾，炼金鼎而方坚。驾鹤上汉，骖鸾腾天。暂游万里，少别千年。惟世间兮重别，谢主人兮依然。" },
            { context: "下有芍药之诗，佳人之歌，桑中卫女，上宫陈娥。春草碧色，春水渌波，送君南浦，伤如之何！至乃秋露如珠，秋月如圭，明月白露，光阴往来，与子之别，思心徘徊。" },
            { context: "是以别方不定，别理千名，有别必怨，有怨必盈。使人意夺神骇，心折骨惊，虽渊、云之墨妙，严、乐之笔精，金闺之诸彦，兰台之群英，赋有凌云之称，辨有雕龙之声，谁能摹暂离之状，写永诀之情着乎？" },
            { context: "" },
        ]
    },
    {
        title: "忆江南",
        data: [
            { context: "江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？" },
        ]
    },{
        title: "诸葛骂王朗",
        data: [
            { context: "王： （两军阵前，拱手）来者可是诸葛孔明？" },
            { context: "诸葛：（扶扇拱手）正是。" },
            { context: "王： 久闻公之大名，今日有幸相会！公既知天命，识时务，为何要兴无名之师？犯我疆界？" },
            { context: "诸葛：我奉诏讨贼，何谓之无名？" },
            { context: "王： 天数有变，神器更易，而归有德之人，此乃自然之理。（曹真在旁点头）" },
            { context: "诸葛：（羽扇遥指）曹贼篡汉，霸占中原，何称有德之人？" },
            { context: "王： 自桓帝、灵帝以来，黄巾猖獗，天下纷争，社稷有累卵之危，生灵有倒悬之急，我太祖武皇帝，扫清六合，席卷八荒，万姓倾心，四方仰德，此非以权势取之，实乃天命所归也！我世祖文皇帝，神文圣武，继承大统，应天合人，法尧禅舜，处中国以治万邦，这岂非天心人意乎？今公蕴大才，抱大器自比管仲，乐毅，何乃要逆天理，背人情而行事？岂不闻古人云：顺天者昌，逆天者亡。今我大魏带甲百万，良将千员。谅尔等腐草之萤光，如何比得上天空之皓月？你若倒戈卸甲，以礼来降，仍不失封侯之位，国安民乐，岂不美哉？" },
            { context: "诸葛：（狂笑数声，扶扇而答）我原以为你身为汉朝老臣，来到阵前，面对两军将士。必有高论，没想到竟说出如此粗鄙之语！我有一言，清诸位静听。昔日桓帝、灵帝之时，汉统衰落，宦官酿祸，国乱岁凶，四方扰攘。黄巾之后，董卓，李榷，郭汜等接踵而起。劫持汉帝，残暴生灵，因之，庙堂之上，朽木为官；殿陛之间，禽兽食禄。以至狼心狗肺之辈汹汹当朝，奴颜婢膝之徒纷纷秉政，以致社稷变为丘墟，苍生饱受涂炭之苦！值此国难之际，王司徒又有何作为？王司徒之生平，我素有所知，你世居东海之滨，初举孝廉入仕，理当匡君辅国，安汉兴刘，何期反助逆贼，同谋篡位！罪恶深重，天地不容！" },
            { context: "王： （手指诸葛亮）你……诸葛村夫，你敢……" },
            { context: "诸葛：（愤而站立）住口！无耻老贼，岂不知天下之人，皆愿生啖你肉，安敢在此饶舌！今幸天意不绝炎汉，昭烈皇帝于西川，继承大统，我今奉嗣君之旨，兴师讨贼，你既为谄谀之臣，只可潜身缩首，苟图衣食，怎敢在我军面前妄称天数！皓首匹夫？苍髯老贼？你即将命归九泉之下，届时有何面目去见汉朝二十四代先帝？！" },
            { context: "王： （手捂胸口，颤声）我、我、我……" },
            { context: "诸葛：（大声斥责）二臣贼子，你枉活七十有六，一生未立寸功，只会摇唇鼓舌！助曹为虐！一条断脊之犬，还敢在我军阵前狺狺狂吠，我从未见过有如此厚颜无耻之人！" },
            { context: "王： 你、你……啊……（坠于马下，左右上前扶起，已死）" },
            { context: "" },
            { context: "" },
            { context: "" },
        ]
    },
    //自古表白多白表，从来姻缘没原因。笑叹少年多年少，哪知自负终负自。悠长情书难书情，惨遭拒绝成绝句。纵使往事皆失望，他朝逢春沐春风。不惧历练结连理，一旦爱久忘旧爱。空慕道德欲得道，怎知俗世多世俗。莫忆青年悔年轻，唯与生人道人生。
    //一美天仙嫦娥舞, 二美富贵女儿情, 三美公主孔雀王, 四美杏仙艳无芳。四美皆为天地色,无分高低据一方,各配一曲释姿色, 道尽无限丽与殇。 
    {
        title: "摸鱼儿·雁丘词",
        data: [
            { context: "问世间，情为何物，直教生死相许？天南地北双飞客，老翅几回寒暑。欢乐趣，离别苦，就中更有痴儿女。君应有语，渺万里层云，千山暮雪，只影向谁去？" },
        ]
    },

    {
        title: "国标二十四式太极拳口诀",
        data: [
            { context: "1.起式" },
            { context: "2.左右野马分鬃" },
            { context: "3.白鹤亮翅" },
            { context: "4.左右搂膝拗步" },
            { context: "5.手挥琵琶" },
            { context: "6.左右倒卷肱" },
            { context: "7.左拦雀尾" },
            { context: "8.右拦雀尾" },
            { context: "9.单鞭" },
            { context: "10.云手" },
            { context: "11.单鞭" },
            { context: "12.高探马" },
            { context: "13.右蹬脚" },
            { context: "14.双峰贯耳" },
            { context: "15.转身左蹬脚" },
            { context: "16.左下式独立" },
            { context: "17.右下式独立" },
            { context: "18.左右穿梭" },
            { context: "19.海底针" },
            { context: "20.闪通臂" },
            { context: "21.转身搬拦捶" },
            { context: "22.如封似闭" },
            { context: "23.十字手" },
            { context: "24.收式" },
        ]
    }
    ]
}
data = [demo]


/**
 * 
 * 
上谥法
神　圣　贤　文　武　成　康　献　懿　元　章　僖（釐）景　宣　明　昭　正　敬　恭　庄　肃　穆　戴　翼　襄　烈　桓　威　勇　毅　克　庄　圉（御）魏　安　定　简　贞　节　白　匡　质　靖　真　顺　思　考　皓　显　和　元　高　光　大　英　睿　博　宪　坚　孝　忠　惠　德　仁　智　慎　礼　义　周　敏　信　达　宽　理　凯　清　直　钦　益　良　度　类　基　慈　齐　深　温　让　密　厚　纯　勤　谦　友　祁　广　淑　俭　灵　荣　厉　比　絜　舒　贲　逸　退　讷　偲　逑　懋　宜　哲　察　通　仪　经　庇　协　端　休　悦　绰　容　确　恒　熙　洽　绍　世　果　太 崇
上百三十一谥，用之君亲焉，用之君子焉。
中谥法
怀、悼、愍（亦作闵、湣）、哀、隐、幽、冲、夷、惧、息、携、恤、愿、儆。
上十四谥，用之闵伤焉，用之无后者焉。
下谥法
野、夸、躁、伐、荒、炀、戾、刺、虚、荡、墨、亢、千、褊、专、轻、苛、介、暴、虐、愎、悖、凶、慢、忍、毒、恶、残　奰、攘、顽、昏、骄、酗、湎、侥、狃、侈、惑、靡、溺、伪、妄、讟、谄、诬、诈、谲、诡、奷、邪、慝、蛊、危、圮、懦、挠、覆、败、斁、疵、饕、费。


哀：早孤短折曰哀；恭仁短折曰哀；德之不建曰哀；遭难已甚曰哀；处死非义曰哀
安：好和不争曰安；兆民宁赖曰安；宽容平和曰安；宽裕和平曰安；所保惟贤曰安；中心宅仁曰安；修己宁民曰安；务德不争曰安；庄敬尽礼曰安；敬而有礼曰安；貌肃辞定曰安；止于义理曰安；恭德不劳曰安；静正不迁曰安；懿恭中礼曰安；凝重合礼曰安
比：择善而从曰比；事君有党曰比
成：安民立政曰成；刑民克服曰成；佐相克终曰成；制义克服曰成；礼乐明具曰成；持盈守满曰成；遂物之美曰成；通达强立曰成；经德秉德曰成；民和神福曰成；道兼圣智曰成；夙夜警戒曰成；曲直赴礼曰成；仁化纯被曰成；不忘久要曰成；德备礼乐曰成；德见于行曰成；久道化隆曰成；内德纯备曰成；坤宁化洽曰成
诚：纯德合天曰诚；从容中道曰诚；推心御物曰诚；秉德纯一曰诚；明信率下曰诚；肫笃无欺曰诚；实心施惠曰诚
冲：幼少在位曰冲；幼少短折曰冲
崇：能修其官曰崇
纯：中正精粹曰纯；见素抱朴曰纯；安危一心曰纯；志虑忠实曰纯；至诚无息曰纯；内心和一曰纯；治理精粹曰纯
慈：视民如子曰慈；爱育必周曰慈；抚柔平恕曰慈
聪：声入心通曰聪；迩言必察曰聪
达：质直好义曰达；疏通中理曰达
大：则天法尧曰大
戴：爱民好治曰戴；典礼不愆曰戴
荡：好内远礼曰荡；狂而无据曰荡
悼：肆行劳祀曰悼；中年早夭曰悼；恐惧从处曰悼；未中早夭曰悼
道：以德化民曰道
德：绥柔士民曰德；谏争不威曰德；谋虑不威曰德；贵而好礼曰德；忠和纯备曰德；绥怀来人曰德；强直温柔曰德；勤恤民隐曰德；忠诚上实曰德；辅世长民曰德；宽众忧役曰德；刚塞简廉曰德；惠和纯淑曰德；富贵好礼曰德；功成民用曰德；修文来远曰德；睿智日新曰德；善政养民曰德；尊贤亲亲曰德；仁而有化曰德；忧在进贤曰德；宽栗扰毅曰德；直温强义曰德；谏诤不违曰德；周旋中礼曰德；泽及遐外曰德；懿修罔懈曰德
丁：述善不克曰丁；述义不悌曰丁；迷而不悌曰丁
鼎：追改前过曰鼎
定：大虑静民曰定；安民大虑曰定；纯行不爽曰定；安民法古曰定；纯行不二曰定；追补前过曰定；仁能一众曰定；嗣成武功曰定；践行不爽曰定；审于事情曰定；德操纯固曰定；以劳定国曰定；克绥邦家曰定；静正无为曰定；大应慈仁曰定；义安中外曰定；镇静守度曰定
度：心能制义曰度；进退可轨曰度；守法纬民曰度；从容有常曰度；礼仪咨善曰度；宽裕有容曰度；创制垂法曰度；懿徽足式曰度
端：守礼执义曰端；圣修式化曰端；严恭莅下曰端；恭己有容曰端；秉心贞静曰端；守礼自重曰端
敦：善行不怠曰敦；温仁忠厚曰敦；能记国善曰敦；温仁厚下曰敦；笃亲睦族曰敦；树德纯固曰敦
干：犯国之纪曰干
刚：追补前过曰刚；强毅果敢曰刚；致果杀敌曰刚；强而能断曰刚；自强不息曰刚；政刑明断曰刚；威强不屈曰刚；强义果敢曰刚
高：德覆万物曰高；功德盛大曰高；覆帱同天曰高
革：献敏成行曰革
公：立志及众曰公
恭：尊贤贵义曰恭；敬事供上曰恭；尊贤敬让曰恭；既过能改曰恭；执事坚固曰恭；爱民长弟曰恭；执礼御宾曰恭；芘亲之阙曰恭；尊长让善曰恭；渊源流通曰恭；夙夜敬事曰恭；知过能改曰恭；贤而不伐曰恭；率事以信曰恭；不懈于位曰恭；卑以自牧曰恭；不懈于德曰恭；治典不易曰恭；责难于君曰恭；正德美容曰恭；不懈为德曰恭；正己接物曰恭；昭事不忒曰恭；勤恤民隐曰恭；庄以莅下曰恭；谦和不懈曰恭；逊顺事上曰恭
光：功格上下曰光；能绍前业曰光；居上能谦曰光；功烈耿着曰光
广：美化及远曰广；所闻能行曰广
果：好力致勇曰果；好学近智曰果；临事善断曰果
暠：综善典法曰暠
和：不刚不柔曰和；推贤让能曰和；柔远能迩曰和；号令悦民曰和；敦睦九族曰和；怀柔胥洽曰和；温厚无苛曰和
厚：思虑不爽曰厚；强毅敦朴曰厚；敦仁爱众曰厚
胡：弥年寿考曰胡；保民耆艾曰胡；保民畏惧曰胡；
怀：执义扬善曰怀；慈仁短折曰怀；慈仁知节曰怀；失位而死曰怀；慈仁哲行曰怀；民思其惠曰怀
桓：辟土服远曰桓；克敬勤民曰桓；辟土兼国曰桓；武定四方曰桓；克亟成功曰桓；克敌服远曰桓；能成武志曰桓；壮以有力曰桓；
荒：凶年无谷曰荒；外内从乱曰荒；好乐怠政曰荒；昏乱纪度曰荒；从乐不反曰荒；狎侮五常曰荒
徽：元德充美曰徽
惠：柔质慈民曰惠；爱民好与曰惠；柔质爱课曰惠；柔质受谏曰惠；施勤无私曰惠；慈仁好与曰惠；爱民好学曰惠；宽裕慈仁曰惠；和而不流曰惠；慈哲远识曰惠；能绥四方曰惠；子爱困穷曰惠；俭以厚下曰惠；淑质受谏曰惠；恩能及下曰惠；宽裕不苛曰惠；遗爱在民曰惠；分人以财曰惠；利而不费曰惠；抚字心殷曰惠；兴利裕民曰惠；德威可怀曰惠；泽及万世曰惠；仁恕中存曰惠；慈恩广被曰惠
惑：满志多穷曰惑；以欲忘道曰惑；淫溺丧志曰惑；妇言是用曰惑；夸志多穷曰惑
基：德性温恭曰基
坚：彰义掩过曰坚；磨而不磷曰坚
俭：菲薄废礼曰俭；节以制度曰俭；举事有经曰俭
简：一德不懈曰简；平易不訾曰简；治典不杀曰简；正直无邪曰简；易从有功曰简；平易无疵曰简；至德临下曰简；仕不躁进曰简；能行直道曰简；执要能固曰简
节：好廉自克曰节；不侈情欲曰节；巧而好度曰节；能固所守曰节；谨行节度曰节；躬俭中礼曰节；直道不挠曰节；临义不夺曰节；艰危莫夺曰节
介：执一不迁曰介
景：由义而济曰景；耆意大虑曰景；布义行刚曰景；致志大图曰景；繇义而成曰景；德行可仰曰景；法义而齐曰景；明照旁周曰景
敬：夙夜警戒曰敬；令善典法曰敬；夙夜恭事曰敬；象方益平曰敬；象方益年曰敬；夙兴夜寐曰敬；众方克就曰敬；齐庄中正曰敬；广直勤正曰敬；廉直劲正曰敬；难不忘君曰敬；受命不迁曰敬；畏天爱民曰敬；陈善闭邪曰敬；威仪悉备曰敬；戒尊师傅曰敬；戒惧无违曰敬；小心恭事曰敬；戒慎几微曰敬；肃恭无怠曰敬；齐庄自持曰敬；应事无慢曰敬
靖：柔德安众曰靖；恭己鲜言曰靖；宽乐令终曰靖；柔德教众曰靖；柔直考终曰靖；虚己鲜言曰靖；缉熙宥密曰靖；式典安民曰靖；仁敬鲜言曰靖；慎以处位曰靖；政刑不扰曰靖；纲纪肃布曰靖；厚德安贞曰靖；律身恭简曰靖；以德安众曰靖
开：信道轻仕曰开
凯：中心乐易曰凯
康：渊源流通曰康；温柔好乐曰康；安乐抚民曰康；合民安乐曰康；丰年好乐曰康；安乐治民曰康；好乐怠政曰康；能安兆民曰康；俊民用章曰康；久膺多福曰康；寿考且宁曰康；保民迪吉曰康；务德不争曰康；宽裕和平曰康；敬而有礼曰康；保卫社稷曰康；造道自行曰康；动而无妄曰康；温柔好善曰康；思善无逸曰康；温良好学曰康；视履安和曰康
考：大虑行节曰考；秉德不回曰考
克：爱民在刑曰克；秉义行刚曰克；胜敌得俊曰克；胜己之私曰克；
宽：含光得众曰宽；大德包蒙曰宽；御众不近曰宽
匡：贞心大度曰匡；以法正国曰匡；辅弼王室曰匡；弥缝灾害曰匡；正君之过曰匡
旷：审音知化曰旷
类：施勤无私曰类；勤政无私曰类；不忝前哲曰类
礼：奉义顺则曰礼；恭俭庄敬曰礼；善自防间曰礼；躬俭中节曰礼；审节而和曰礼；着诚去伪曰礼；纳民轨物曰礼；恭俭合度曰礼；内则克修曰礼
理：才理审谛曰理；政平刑肃曰理；措正施行曰理；表章道术曰理；才敏详审曰理；治繁不扰曰理
厉（刺）：杀戮无辜曰厉；暴虐无亲曰厉；愎狠无礼曰厉；扶邪违正曰厉；长舌阶祸曰厉；不思忘爱曰刺；复狠遂过曰刺；暴戾无亲曰刺；暴慢九卿曰刺；不思安乐曰刺
戾：不悔前过曰戾；不思顺受曰戾；知过不改曰戾
良：温良好乐曰良；理顺习善曰良；小心敬事曰良；温敬寡言曰良；孝悌成性曰良；小心敬畏曰良；谋猷归美曰良；竭忠无隐曰良；宅衷易直曰良
烈：有功安民曰烈；秉德遵业曰烈；圣功广大曰烈；海外有截曰烈；业成无兢曰烈；光有大功曰烈；戎业有光曰烈；刚正曰烈；宏济生民曰烈；庄以临下曰烈
灵：不勤成名曰灵；死而志成曰灵；死见神能曰灵；乱而不损曰灵；好祭鬼神曰灵；极知鬼神曰灵；不遵上命曰灵；德之精明曰灵
懋：以德受官曰懋；以功受赏曰懋
密：追补前过曰密；思虑详审曰密
闵：慈仁不寿曰闵；在国遭忧曰愍；在国逢艰曰愍；祸乱方作曰愍；使民悲伤曰愍；使民折伤曰愍；在国连忧曰愍；佐国逢难曰愍；危身奉上曰愍（一般和愍混用）
敏：应事有功曰敏；明作有功曰敏；英断如神曰敏；明达不滞曰敏；闻义必徙曰敏；才猷不滞曰敏；好古不怠曰敏
明：照临四方曰明；谮诉不行曰明；思虑果远曰明；保民耆艾曰明；任贤致远曰明；总集殊异曰明；独见先识曰明；能扬仄陋曰明；察色见情曰明；容义参美曰明；无幽不察曰明；圣能作则曰明；令闻不已曰明；奉若天道曰明；遏恶扬善曰明；视能致远曰明；内治和理曰明；诚身自知曰明；守静知常曰明；至诚先觉曰明；远虑防微曰明；懿行宣着曰明；智能晰理曰明；昭晰群性曰明
缪：名与实爽曰缪；伤人蔽贤曰缪；蔽仁伤善曰缪
穆：布德执义曰穆；中情见貌曰穆；贤德信修曰穆；德政应和曰穆；敬和在位曰穆；德化肃和曰穆；圣敬有仪曰穆；粹德深远曰穆；肃容持敬曰穆；容仪肃敬曰穆
宁：裕以安民曰宁；渊衷湛一曰宁；端重自毖曰宁
彭：述而不作曰彭；信而好古曰彭
平：治而无眚曰平；执事有制曰平；惠内无德曰平；治而清省曰平；布纲治纪曰平；克定祸乱曰平；理而无责曰平；布德均政曰平；无常无偏曰平；治道如砥曰平；分不求多曰平；政以行辟曰平；推心行恕曰平
齐：执心克庄曰齐；资辅共就曰齐；轻輶恭就曰齐；执正克庄曰齐
祁：治典不杀曰祁；经典不易曰祁；治定不陂曰祁
迁：博物多爱曰迁；良史实录曰迁
强：和而不流曰强；中立不倚曰强；守道不变曰强；死不迁情曰强；自胜其心曰强。梁光禄大夫江革谥“强”。
钦：威仪悉备曰钦；敬事节用曰钦；克慎成宪曰钦；肃敬而承上曰钦；夙夜祗畏曰钦；敬慎万几曰钦；神明俨翼曰钦；小心励翼曰钦；寅恭供职曰钦
勤：温年好乐曰勤；能修其官曰勤；服劳无怨曰勤；广业不怠曰勤；勤行世业曰勤；好学力行曰勤；能修内职曰勤；夙夜匪懈曰勤；宣劳中外曰勤
清：避远不义曰清；洁己自爱曰清；洁己奉法曰清
顷：甄心动惧曰顷；敏以敬慎曰顷；祗勤追惧曰顷；慈仁和敏曰顷；堕覆社稷曰顷；震动过惧曰顷；阴靖多谋曰顷
悫：行见中外曰悫；执德不惑曰悫；诚以致志曰悫；表里如一曰悫；诚心中孚曰悫；率真御下曰悫
确：执德不惑曰确；执德不回曰确
让：推功尚善曰让；德性宽柔曰让
仁：蓄义丰功曰仁；慈民爱物曰仁；克己复礼曰仁；贵贤亲亲曰仁；杀身成仁曰仁；能以国让曰仁；利泽万世曰仁；率性安行曰仁；功施于民曰仁；屈己逮下曰仁；度功而行曰仁；宽信敏惠曰仁；爱仁立物曰仁；体元立极曰仁；如天好生曰仁；教化溥浃曰仁；慈心为质曰仁；惠爱溥洽曰仁
荣：宠禄光大曰荣；先义后利曰荣
容：宽裕温柔曰容
柔：顺德丽贞曰柔；至顺法坤曰柔
睿：克念作圣曰睿；深思远虑曰睿；圣知通微曰睿；虑周事表曰睿
伤：未家短折曰伤；短折不成曰伤；短折不成曰殇；未家短折曰殇；童蒙短折曰殇（谥号中一般写作殇）
商：昭功宁民曰商；文学博识曰商
绍：疏远继位曰绍
深：秉心塞渊曰深
神：民无能名曰神；壹民无为曰神；安仁立政曰神；物妙无方曰神；圣不可知曰神；阴阳不测曰神；治民无为曰神；应变远方、不疾而速曰神；能妙万物曰神；道化宜民曰神；显仁藏用曰神；则天广运曰神
慎：敏以敬曰慎；沉静寡言曰慎；思虑深远曰慎；谨饬自持曰慎；夙夜敬畏曰慎；小心克勤曰慎
声：不生其国曰声；不主其国曰声
圣：扬善赋简曰圣；敬宾厚礼曰圣；虚己从谏曰圣；敬祀亨礼曰圣；行道化民曰圣；穷理尽性曰圣；穷神知化曰圣；通达先知曰圣；大而化之曰圣；博施济众曰圣；极深研几曰圣；能听善谋曰圣；裁成天地曰圣；睿智天纵曰圣；百姓与能曰圣；备物成器曰圣；备道全美曰圣；神化难名曰圣
胜：容仪恭美曰胜
世：承命不迁曰世；景物四方曰世；贻庥奕叶曰世
淑：言行不回曰淑；虑善从宜曰淑；温仁咸仰曰淑；善行着闻曰淑
舒：举事而迟曰舒；言行轨物曰舒
庶：心能制义曰庶
顺：慈和遍服曰顺；慈仁和民曰顺；柔质慈惠曰顺；和比于理曰顺；德合帝则曰顺；受天百禄曰顺；柔德承天曰顺；德性宽柔曰顺；淑慎其身曰顺；德容如玉曰顺；克将君美曰顺；好恶公正曰顺；德协自然曰顺
舜：仁圣盛明曰舜
思：道德纯一曰思；大省兆民曰思；外内思索曰思；追悔前过曰思；不眚兆民曰思；谋虑不衍曰思；柔能自勉曰思；通明爽愿曰思；深虑道远曰思；念终如始曰思；辟土兼国曰思；追悔前愆曰思
肃：刚德克就曰肃；执心决断曰肃；威德克就曰肃；正己摄下曰肃；能执妇道曰肃；好德不怠曰肃；貌敬行祗曰肃；刚德克服曰肃；身正人服曰肃；法度修明曰肃；严畏自饬曰肃；摄下有礼曰肃；貌恭心敬曰肃：达礼蔽乐曰素
太：克启行禩曰太
泰：循礼安舒曰泰；临政无慢曰泰
通：物至能应曰通；事起而辨曰通
威：猛以刚果曰威；强毅信正曰威；服叛怀远曰威；强毅执政曰威；赏劝刑怒曰威；以刑服远曰威；蛮夷率服曰威；信赏必罚曰威；德威可畏曰威；声灵震叠曰威；庄以临下曰威；
温：德性宽柔曰温；和顺可即曰温；仁良好礼曰温；乐育群生曰温；宽仁惠下曰温
文：经纬天地曰文；道德博闻曰文；慈惠爱民曰文；愍民惠礼曰文；赐民爵位曰文；勤学好问曰文；博闻多见曰文；忠信接礼曰文；能定典礼曰文；经邦定誉曰文；敏而好学曰文；施而中礼曰文；修德来远曰文；刚柔相济曰文；修治班制曰文；德美才秀曰文；万邦为宪曰文；帝德运广曰文；坚强不暴曰文；徽柔懿恭曰文；圣谟丕显曰文；化成天下曰文；纯穆不已曰文；克嗣徽音曰文；敬直慈惠曰文；与贤同升曰文；绍修圣绪曰文；声教四讫曰文
武：刚强直理曰武；威强敌德曰武；克定祸乱曰武；刑民克服曰武；夸志多穷曰武；威强睿德曰武；除伪宁真曰武；威强恢远曰武；帅众以顺曰武；保大定功曰武；刚强以顺曰武；辟土斥境曰武；折冲御侮曰武；除奸靖难曰武；拓地开封曰武；肃将天威曰武；安民和众曰武；克有天下曰武；睿智不杀曰武；恤民除害曰武；赴敌无避曰武；德威遐畅曰武；
息：谋虑不成曰息
熙：允僖庶绩曰熙；敬德光明曰熙；隆称赫奕曰熙
僖（釐）：小心畏忌曰僖；质渊受谏曰僖；有罚而还曰僖；刚克曰僖；有过曰僖；慈惠爱亲曰僖；小心恭慎曰僖；乐闻善言曰僖；恭慎无过曰僖
熹：有功安人曰熹
贤：仁义合道曰贤；宠至益戒曰贤；行义合道曰贤；明德有成曰贤；内治隆备曰贤；内德有成曰贤
显：行见中外曰显；受禄于天曰显；圣德昭临曰显；百辟惟刑曰显；有光前烈曰显；中外仰德曰显；德美宣昭曰显
宪：博闻多能曰宪；赏善罚恶曰宪；行善可记曰宪；在约纯思曰宪；圣能法天曰宪；圣善周达曰宪；创制垂法曰宪；刑政四方曰宪；文武可法曰宪；聪明法天曰宪；表正万邦曰宪；懿行可纪曰宪；仪范永昭曰宪
献：博闻多能曰献；惠而内德曰献；智哲有圣曰献；聪明睿智曰献；文资有成曰献；敏惠德元曰献；圣哲有谋曰献；贤德有成曰献；智能翼君曰献；学该古训曰献；智质有理曰献；智质有操曰献；智质有礼曰献
襄：辟地有德曰襄；甲胄有劳曰襄；因事有功曰襄；执心克刚曰襄；协赞有成曰襄；威德服远曰襄
向：简易多闻曰向
孝：五宗安之曰孝；慈惠爱亲曰孝；秉德不回曰孝；协时肇享曰孝；大虑行节曰孝；慈惠爱民曰孝；慈爱忘劳曰孝；从命不违曰孝；善事父母曰孝；遵义安仁曰孝；几谏不倦曰孝；姻睦其党曰孝；博于备养曰孝；敬慎所安曰孝；尊仁爱义曰孝；能养能恭曰孝；干蛊用誉曰孝；继志成事曰孝；践修世德曰孝；丕承先志曰孝；博施被物曰孝；教刑四海曰孝；德通神明曰孝；先意承志曰孝；能奉祭祀曰孝；志不忘亲曰孝；富贵不骄曰孝；德加百姓曰孝；徽音克嗣曰孝
信：守命共时曰信；出言可复曰信；周仁承命曰信；守礼不违曰信；宽仁孚众曰信；政令划一曰信
修：勤其世业曰修；好学近习曰修；克勤世业曰修
虚：凉德薄礼曰虚；华言无实曰虚
宣：圣善周闻曰宣；施而不成曰宣；善问周达曰宣；施而不秘曰宣；诚意见外曰宣；重光丽日曰宣；义问周达曰宣；能布令德曰宣；浚达有德曰宣；力施四方曰宣；哲惠昭布曰宣；善闻式布曰宣
玄：含和无欲曰玄；应真主神曰玄
逊：谦和善让曰逊
炀：好内远礼曰炀；去礼远众曰炀；好内怠政曰炀；肆行劳神曰炀；去礼远正曰炀；逆天虐民曰炀
尧：翼善传圣曰尧；大而难名曰尧
野：质胜其文曰野；敬而不中礼曰野
仪：善行足法曰仪
夷：克杀秉政曰夷；安心好静曰夷；隐居求志曰夷；失礼基乱曰夷
义：制事合宜曰义；见利能终曰义；先君后己曰义；除天地害曰义；取而不贪曰义；理财正辞曰义；仁能制命曰义；能成其志曰义；道无不理曰义；推功尚善曰义；以礼节行曰义；行礼不疚曰义；见利能让曰义；以公灭私曰义；正身肃下曰义；
逸：隐居放言曰逸
毅：致果杀敌曰毅；强而能断曰毅；勇而近仁曰毅；善行不怠曰毅；温仁忠厚曰毅；能纪国善曰毅；英明有执曰毅；经德不回曰毅；致果克敌曰毅
翼：刚克为伐曰翼；思虑深远曰翼；爱民好治曰翼；小心事天曰翼；小心昭事曰翼；赞宣德化曰翼
懿：温柔贤善曰懿；温和圣善曰懿；体和居中曰懿；爱人质善曰懿；柔克有光曰懿；浸以光大曰懿；行见中外曰懿；爱民质渊曰懿；德浸广大曰懿；文德充实曰懿；秉彝好德曰懿；尚能不争曰懿；主极精纯曰懿；柔德流光曰懿；贤善着美曰懿
隐：陷拂不成曰隐；不显尸国曰隐；见美坚长曰隐；隐括不成曰隐；不尸其位曰隐；违拂不成曰隐；怀情不尽曰隐；不明误国曰隐；威德刚武曰隐；
英：出类拔萃曰英；道德应物曰英；德华茂着曰英；明识大略曰英
婴：恭俭好礼曰婴
雍：居敬行简曰雍
勇：胜敌壮志曰勇；率义死国曰勇；致命为仁曰勇；奋身为义曰勇；持义不挠曰勇；知死不避曰勇；率义共用曰勇；以义死用曰勇；临事屡断曰勇；临难不惧曰勇；见义必为曰勇
幽：壅遏不通曰幽；动静乱常曰幽；早孤有位曰幽；早孤陨位曰幽；早孤销位曰幽；违礼乱常曰幽；暴民残义曰幽；淫德灭国曰幽
友：睦于兄弟曰友
俞：愚智适时曰俞
禹：渊源通流曰禹；受禅成功曰禹
圉：威德刚武曰圉
裕：强学好问曰裕；建中垂统曰裕；宽仁得众曰裕；性量宽平曰裕；仁惠克广曰裕；宽和不迫曰裕；宽和自得曰裕
誉：状古述今曰誉
渊：不幸短命曰渊；沉潜用晦曰渊；德信静深曰渊；沉几烛隐曰渊
元：能思辩众曰元；行义说民曰元；始建国都曰元；主义行德曰元；道德纯一曰元；遵仁贵德曰元；善行仁德曰元；宣慈惠和曰元；至善行德曰元；忠肃恭懿曰元；体仁长民曰元；茂德丕绩曰元；体乾启祚曰元；万邦以贞曰元；体仁内恕曰元；仁明道合曰元；
原：思虑不爽曰原；植德开基曰原；庆流奕叶曰原
远：疏远继位曰远
愿：思厚不爽曰愿；弱无立志曰愿；败乱无度曰愿；忘德败礼曰愿；柔无立志曰愿
章：温克令仪曰章；法度明大曰章；出言有文曰章；敬慎高亢曰章；文教远耀曰章
昭：容仪恭美曰昭；昭德有劳曰昭；圣闻周达曰昭；声闻宣远曰昭；威仪恭明曰昭；明德有功曰昭；圣问达道曰昭；圣德嗣服曰昭；德业升闻曰昭；智能察微曰昭；德礼不愆曰昭；高朗令终曰昭；遐隐不遗曰昭；德辉内蕴曰昭；柔德有光曰昭
哲：知人曰哲；明知渊深曰哲；官人应实曰哲；明知周通曰哲；识微虑终曰哲；知能辨物曰哲
贞：清白守节曰贞；大虑克就曰贞；大宪克就曰贞；不隐无屈曰贞；内外用情曰贞；忧国忘死曰贞；内外无怀曰贞；忠道不扰曰贞；保节扬名曰贞；履正中馈曰贞；守教难犯曰贞；幽间专一曰贞；恒德从一曰贞；直道不挠曰贞；名实不爽曰贞；事君无猜曰贞；德性正固曰贞；率义好修曰贞；德信正周曰贞
真：肇敏行成曰真；不隐无藏曰真
正：内外宾服曰正；大虑克就曰正；内外用情曰正；清白守洁曰正；图国忘死曰正；内外无怀曰正；直道不挠曰正；靖恭其位曰正；其仪不忒曰正；精爽齐肃曰正；诚心格非曰正；庄以率下曰正；息邪讵诐曰正；主极克端曰正；万几就理曰正；淑慎持躬曰正；端型式化曰正；心无偏曲曰正；守道不移曰正
直：肇敏行成曰直；治乱守正曰直；不隐其亲曰直；守道如矢曰直；言行不邪曰直；质而中正曰直；正人之曲曰直；折狱在中曰直；孝弟成性曰直；小心敬事曰直；敏行不挠曰直；率行无邪曰直；秉道正物曰直；
质：名实不爽曰质；忠正无邪曰质；章义掩过曰质；言行相应曰质；恬淡无为曰质；直心靡他曰质；真纯一德曰质；至治还淳曰质；宅心笃实曰质；淳茂无华曰质；静正无华曰质；朴直无华曰质；强立守义曰质
智：官人应实曰智；尊明胜患曰智；默行言当曰智；推芒折廉曰智；临事不惑曰智；察言知人曰智；择任而往曰智
中：王心克一曰中；刚柔不偏曰中；因时致治曰中
忠：危身奉上曰忠；虑国忘家曰忠；让贤尽诚曰忠；危身利国曰忠；安居不念曰忠；临患不反曰忠；盛衰纯固曰忠；廉方公正曰忠；事君尽节曰忠；推贤尽诚曰忠；中能应外曰忠；杀身报国曰忠；世笃勤劳曰忠；善则推君曰忠；死卫社稷曰忠；以德复君曰忠；以孝事君曰忠；安不择事曰忠；教人以善曰忠；中能虑外曰忠；广方公正曰忠；肫诚翊赞曰忠
终：有始有卒曰终；克成令名曰终
纣：残义损善曰纣
专：好功自是曰专；违命自用曰专
庄：兵甲亟作曰庄；睿圉克服曰庄；胜敌志强曰庄；死于原野曰庄；屡征杀伐曰庄；武而不遂曰庄；真心大度曰庄；好勇致力曰庄；威而不猛曰庄；严敬临民曰庄；履正志和曰庄；维德端严曰庄；恭敬端肃曰庄；端恪临民曰庄；端一克诚曰庄；齐敬中礼曰庄；执德不矜曰庄；德盛礼恭曰庄；严恭自律曰庄；严恪有仪曰庄；威德刚武曰壮；赫围克服曰壮；胜敌克乱曰壮；好力致勇曰壮；屡行征伐曰壮；武德刚毅曰壮；非礼弗履曰壮（庄和壮一般混用）
纵：弱而立志曰纵；败乱百度曰纵；忘德败礼曰纵
 * 
 */

