//现代文欣赏
var demo = {
    title: "现代文欣赏",
    name: "摘抄",
    data: [{
        title: "别说你不屑于模仿",
        data: [
            { context: "很多人谈起中国人善于“模仿”(或者叫山寨)时无不轻视。但我却认为，当你有能力模仿某件东西，并且知道这样做肯定能赚钱时，为什么还要去发明新东西并承担风险呢？在硅谷，如果每个人都能简单的从抄袭创意中赚到大钱，他们肯定也会这样做。" },
            { context: " 中国之所以曾经热衷于模仿，是因为当时中国市场不够开放，导致硅谷等引领创新之地和中国对领先创意的消化吸收之间存在一个时间差，从而为创业者提供了机会。巨大的价值就在这样的时间差中被创造了出来。" },
            { context: " 现在中国互联网“三巨头”百度、阿里巴巴、腾讯最初的业务模式都来自于模仿市场领先企业，但现在他们都已经完成了超越。搜索引擎公司百度模仿的是谷歌；电商平台阿里巴巴混合了亚马逊、ebay、Paypal的基本元素；腾讯的QQ和微信最初是从ICQ和Kakao， Talk中获得灵感。现在，这三家企业的创新能力已经超越了人们的预期，正在拓展全球市场，并且正在被其他企业所模仿。所以，更实际的创业道路可能是：能模仿就模仿，无法模仿就创新。" },
            { context: " 而现在，中国也已经走出了模仿时代，有如此多的中国初创企业在寻找源自硅谷的最新创意，所以哪怕你模仿的速度非常快，最终也会和数十家其他中国模仿者一起竞争。仅靠模仿来获取成功的可能性已经越来越低。" },
            { context: " 我总是听到一些中国政府官员和商界人士感叹中国初创企业创新力度不足。还有不少人在设想一些复杂的解决方案来帮助创业者提高创新能力。在我看来，大多数这样的担心和投入都是没有必要的，因为问题其实可以靠自身解决。中国人将会开创自己的原创之路，因为他们不得不这样做。只要模仿不再有效，人们就会停止模仿。" },
            { context: " 如果说得更直白一些，所有的创新都是从模仿它们之前的某种东西开始的，这就是我们学习的方式。区别在于，伟大的创业者不仅仅模仿，还会把模仿下来的东西转化成为自己的东西。就像毕加索曾说的那样：“巧匠摹形，大师窃意”。每一个硅谷天才，从脸书的扎克伯格到特斯拉的埃隆.马斯克，都是从学习别人的创意开始的，但他们作出的贡献远远超出了始创者。所以，在创新之前，别说你不屑于模仿！" },
        ]
    }, {
        title: "我们只不过是要努力奋斗，使当初的选择变得正确",
        data: [
            { context: "前几天收拾东西，从柜子里掉出来一摞汇款单。汇款单用曲别针别着一百多张，最上面的一张用钢笔写着“这就是成长啊！”下面签着我和一个叫Lily的女孩的名字。我坐在地上，翻着每一张汇款单，一页页的看。那是我大三第一次正式的实习，和一个叫lily的实习生一组。" },
            { context: "我们从来没有填写过汇款单，里面的很多要求我们不知道，比如数字的汉字要大写，每个字之间不能有空隙等等，越是严格，就越是紧张，然后我们写一个错一个，写了100多张才写好那么几个人。记得当时老板拿着一摞废掉的汇款单跟我们说：“保存起来，五年之后再翻出来看看，这就是你们的成长。”" },
            { context: "我真的很乖的保存下来了。那份实习我做了六个月，和Lily一起，一起中午吃便宜的午餐，一起互帮互助写每一份文案和策划，一起战战兢兢去财务部领1200块钱的工资还要看财务的脸色。那时候的我，每天要坐两小时公交车上班，再坐两小时公交车下班，那时候一天的公交费2块钱，地铁费要10块钱，不舍得地铁，只能坐公交车神游三环一大圈。" },
            { context: "Lily是外地高校的学生，实习期间住在当时的男友家。男友和父母住在一起，在北京胡同的平房里。她不怎么习惯平房，也不习惯对方的父母，大夏天有时候洗澡都困难，做什么事情都小心翼翼。相比我的远，她的寄人篱下更让人觉得难受，因此上班时间就是她最开心的时间了。" },
            { context: "Lily是个很美的姑娘，大长腿，模特身材，清新的感觉跟江一燕差不多，那时候的我们对未来都没什么明确的打算，她在学GRE靠托福想去美国读研究生，我在想是留在这家公司转正还是申请一家更好的公司去实习。我清楚的记得，我们都不知道未来，但谁都不迷茫。我们每天都特别开心，傻乐傻乐的，尽管我们穷，我们也土土的，我们干活多时间长还经常被当做劳力去跑腿做杂事，但真的没人抱怨什么。" },
            { context: "我们在一起度过了那份实习的所有时间，然后彼此离开。我去了下一家牛逼哄哄的公司继续实习，她真的考上了美国的研究生。再后来我毕业找到了梦想中的工作，Lily在美国读完研究生留在纽约工作。某次她跟我谈起她梦想中的公司要求要有“不带薪实习9个月”在前，我大呼“这哪里是实习，这分明是生存大考验啊，你这是纽约啊。”" },
            { context: "五年后的前几天，当我翻出那一摞汇款单的时候，我拍照发给Lily，她正在银行签贷款合同，在纽约买下自己人生的第一套公寓。她问我要不要代购奶粉什么的，我大笑的问她你能给我买十年吗？是的，五年后的我们，都各自长大，过着让自己感到合适和舒服的生活。我们都是普通的女孩，我们的每一步是不是都很成功很完美，我们彼此也没有谁强谁弱，我们都在洪荒宇宙中像一颗粒子一样慢慢前行，即使失败，也是一种成长；即使迷茫，也都是青春的代价。只是，我们都觉得，每走一步，都要对得起自己。" },
            { context: "有人问我：“我找了个工作，老板给我XXXX待遇，我觉得不公平。”“我刚毕业，月薪就2000元，你说这公司是不是骗子。”亲爱的，我不知道，我不知道你是如何的，这份工作值不值得你去做，我只能说说我自己。第一份社会实践卖饮料一天30元，拖半年才付款，其实也就几百块。" },
            { context: "第一份实习，两个月一共700元，还是500强公司，连纳税的起征点都不够；第一份工作，人见人羡慕的豪华公司，起薪3000元。我不是什么名校，我英语不如母语好，我没有别人那么多见识，没读过很多很多书，常年在学校里，第一次在公司门口吃过桥米线，都觉得好吃的好几年忘不了。我周围也有很多牛人，有的男生毕业就了高大奢的咨询公司和投行，连父母来北京旅游都可以用公司专车接送；有的女孩还没毕业就创业，一天能赚十几万；有的随便学学就能GRE考高分拿着奖学金去美国。" },
            { context: "但这些都不是我，他们都只是我身边最亮眼的那些光芒。我抬头看看他们，再看看自己，除了低头努力，真的说不出什么，要抱怨不出什么。抱怨社会不公？还是老板不人道？还是公司欺负我？还是投胎到了没什么钱与权的家庭？我不知道怎么去考虑自己做某个事情值不值得，我只知道以自己的背景和底子，在北京这种名校成堆，牛人成群的地方，想要得到自己梦想中的东西，就要一步步垒宝塔一样去做，一步踩着一步爬上去，才会有人愿意看见我，无论是工作与生活、还是爱情与婚姻。" },
            { context: "前几天看完一本美国名校学生奋斗的书。主人公像在中国混大学一样混在美国名校里，终有一天被勒令退学。他的导师给了他一个试读的机会，他在此期间奋发图强，做出了领全美国惊艳的成绩。一瞬间，他从一个人人讥笑的失败者变成了一个在大会上全场为之鼓掌的成功人士。所有的荣誉、鲜花，以及美国最美的小妞儿都围绕着他。而他也终于明白，被要求退学的时候，他以为全世界都对他不好，导师在报复他，前女友在恶意踩踏他，可事实上，一切都是自己造成的，是自己的混沌懈怠不学习，让自己掉进了人生的低谷，这世界从来不会跟你过不去，你得到的任何好与坏，都是自己作的。" },
            { context: "有句话是这么说的：“根本没有正确的选择，我们只不过是要努力奋斗，使当初的选择变得正确。”就是这样。" },
        ]
    }]
}
data = [demo]