var demo = {
    title: "东周列国志 部分",
    name: "东周列国志 部分",
    data: [{
        title: "开篇诗",
        data: [
            { context: "道德三皇五帝，功名夏后商周；" },
            { context: "英雄五霸闹春秋，顷刻兴亡过手！" },
            { context: "青史几行名姓，北邙无数荒丘；" },
            { context: "前人田地后人收，说甚龙争虎斗。" },
        ]
    }, {
        title: "列国诗",
        data: [
            { context: "东迁强国齐郑最，荆楚渐横开桓文，" },
            { context: "楚庄宋襄和秦穆，迭为王霸得专征。" },
            { context: "晋襄景悼称世霸，平哀齐景思代兴。" },
            { context: "晋楚两衰吴越进，阖闾句践何纵横？" },
            { context: "春秋诸国难尽数，几派源流略可寻。" },
            { context: "鲁卫晋燕曹郑蔡，与吴姬姓同宗盟。" },
            { context: "齐由吕尚宋商裔，禹后杞越颛顼荆。" },
            { context: "秦亦顼裔陈祖舜，许始太岳各有生。" },
            { context: "及交战国七雄起，韩赵魏氏晋三分。" },
            { context: "魏与韩皆周同姓，赵先造父同嬴秦。" },
            { context: "齐吕改田即陈后，黄歇代楚熊暗倾。" },
            { context: "宋亡于齐鲁入楚，吴越交胜总归荆。" },
            { context: "周鼎既迁合从散，六国相随浙属秦。" },
        ]
    }, {
        title: "结尾诗",
        data: [
            { context: "卜世虽然八百年，半由人事半由天。" },
            { context: "绵延过历缘忠厚，陵替随波为倒颠。" },
            { context: "六国媚秦甘北面，二周失祀恨东迁。" },
            { context: "总观千古兴亡局，尽在朝中用佞贤" },
        ]
    }
    ]
}
data = [demo]