var demo = {
    title: "三十六计",
    name: "三十六计",
    data: [{
        title: "三十六计·胜战计·瞒天过海",
        data: [
            { context: "【原典】：备周则意怠；常见则不疑。阴在阳之内，不在阳之对。太阳，太阴。" },
            { context: "【按语】：阴谋作为，不能于背时秘处行之。夜半行窃，僻巷杀人，愚俗之行，非谋士之所为也。" },
            { context: "如开皇九年，大举伐陈。先是弼请缘江防人，每交代之际，必集历阳，大列旗帜，营幕蔽野。陈人以为大兵至，悉发国中士马，既而知防人交代。其众复散，后以为常，不复设备，及若弼以大军济江，陈人弗之觉也。因袭南徐州，拔之。" }
        ]
    }, {
        title: "三十六计·胜战计·围魏救赵",
        data: [
            { context: "【原典】：共敌不如分敌，敌阳不如敌阴。" },
            { context: "【按语】：治兵如治水：锐者避其锋，如导疏；弱者塞其虚，如筑堰。" },
            { context: "如当齐救赵时，孙宾谓田忌曰：“夫解杂乱纠纷者不控拳，救斗者，不搏击，批亢捣虚，形格势禁，则自为解耳。”" }
        ]
    }, {
        title: "三十六计·胜战计·借刀杀人",
        data: [
            { context: "【原典】：敌已明，友未定，引友杀敌，不自出力，以《损》推演。" },
            { context: "【按语】：敌象已露，而另一势力更张，将有所为，便应借此力以毁敌人。" },
            { context: "如郑桓公将欲袭郐，先向郐之豪杰、良臣、辨智、果敢之士，尽书姓名，择郐之良田赂之，为官爵之名而书之，因为设坛场郭门之处而埋之，衅之以鸡缎，若盟状。郐君以为内难也，而尽杀其良臣。桓公袭郐，遂取之。诸葛亮之和吴拒魏，及关羽围樊、裹，曹欲徙都，懿及蒋济说曹曰：“刘备、孙权外亲内疏，关羽得志，权心不愿也。可遣人蹑其后，许割江南以封权，则樊围自释。”曹从之，羽遂见擒。" }
        ]
    }, {
        title: "三十六计·胜战计·以逸待劳",
        data: [
            { context: "【原典】：困敌之势，不以战；损刚益柔。" },
            { context: "【按语】：此即致敌之法也。兵书云：“凡先处战地而待敌者逸，后处战地而趋战者劳。故善战者，致人而不致于人。”兵书论敌，此为论势，则其旨非择地以待敌；而在以简驭繁，以不变应变，以小变应大变，以不动应动以小动应大动，以枢应环也。如：管仲寓军令于内政，实而备之；孙膑于马陵道伏击庞涓；李牧守雁门，久而不战，而实备之，战而大破匈奴。" },
            // { context: "【】" },
        ]
    }, {
        title: "三十六计·胜战计·趁火打劫",
        data: [
            { context: "【原典】：敌之害大，就势取利，刚决柔也。" },
            { context: "【按语】：敌害在内，则劫其地；敌害在外，则劫其民；内外交害，败劫其国。如：越王乘吴国内蟹稻不遗种而谋攻之，后卒乘吴北会诸侯于黄池之际，国内空虚，因而捣之，大获全胜。" },
            { context: "" },
        ]
    }, {
        title: "三十六计·胜战计·声东击西",
        data: [
            { context: "【原典】：敌志乱萃，不虞，坤下兑上之象，利其不自主而取之。" },
            { context: "【按语】：西汉，七国反，周亚夫坚壁不战。吴兵奔壁之东南陬，亚夫便备西北；已而吴王精兵果攻西北，遂不得入。此敌志不乱，能自去也。汉末，朱隽围黄巾于宛，张围结垒，起土山以临城内，鸣鼓攻其西南，黄巾悉众赴之，隽自将精兵五千，掩其东北，遂乘虚而入。此敌志乱萃，不虞也。然则声东击西之策，须视敌志乱否为定。乱，则胜；不乱，将自取败亡，险策也。" },
            { context: "" },
        ]
    }, {
        title: "三十六计·敌战计·无中生有",
        data: [
            { context: "【原典】：诳也，非诳也，实其所诳也。少阴、太阴、太阳。" },
            { context: "【按语】：无而示有，诳也。诳不可久而易觉，故无不可以终无。无中生有，则由诳而真，由虚而实矣，无不可以败敌，生有则败敌矣，如：令狐潮围雍丘，张巡缚嵩为人千余，披黑夜，夜缒城下；潮兵争射之，得箭数十万。其后复夜缒人，潮兵笑，不设备，乃以死士五百砍潮营，焚垒幕，追奔十余里。" },
        ]
    }, {
        title: "三十六计·敌战计·暗度陈仓",
        data: [
            { context: "【原典】：示之以动，利其静而有主，“益动而巽”。" },
            { context: "【按语】：奇出于正，无正不能出奇。不明修栈道，则不能暗渡陈仓。昔邓艾屯白水之北；姜维遥廖化屯白水之南，而结营焉。艾谓诸将日：“维令卒还，吾军少，法当来渡，而不作桥，此维使化持我．令不得还。必自东袭取洮城矣。”艾即夜潜军，径到洮城。维果来渡。而艾先至，据城，得以不破。此则是姜维不善用暗渡陈仓之计；而邓艾察知其声东击西之谋也。" },
        ]
    }, {
        title: "三十六计·敌战计·隔岸观火",
        data: [
            { context: "【原典】：阳乖序乱，阴以待逆。暴戾恣睢，其势自毙。顺以动豫，豫顺以动。" },
            { context: "【按语】：乖气浮张，逼则受击，退则远之，则乱自起。昔袁尚、袁熙奔辽东，众尚有数千骑。初，辽东太守公孙康，恃远不服。及曹操破乌丸，或说曹遂征之，尚兄弟可擒也。操曰：“吾方使斩送尚、熙首来，不烦兵矣。”九月，操引兵自柳城还，康即斩尚、熙，传其首。诸将问其故，操日：“彼素畏尚等，吾急之，则并力；缓之，则相图，其势然也。”或曰：此兵书火攻之道也，按兵书《火攻篇》前段言火攻之法，后段言慎动之理，与隔岸观火之意，亦相吻合。" },
        ]
    }, {
        title: "三十六计·敌战计·笑里藏刀",
        data: [
            { context: "【原典】：信而安之，阴以图之，备而后动， 勿使有变。刚中柔外也。" },
            { context: "【按语】：兵书云：“辞卑而益备者，进也；……无约而请和者，谋也。”故凡敌人之巧言令色，皆杀机之外露也。宋曹玮知渭州，号令明肃，西夏人惮之。一日玮方对客弈棋，会有叛夸数千，亡奔夏境。堠骑（骑马的侦宿员）报至，诸将相顾失色，公言笑如平时。徐谓骑日．“吾命也，汝勿显言。”西夏人闻之，以为袭己，尽杀之。此临机应变之用也。若勾践之事夫差．则意使其久而安之矣。" },
        ]
    }, {
        title: "三十六计·敌战计·李代桃僵",
        data: [
            { context: "【原典】：势必有损，损阴以益阳。" },
            { context: "【按语】：我敌之情，各有长短。战争之事，难得全胜，而胜负之诀，即在长短之相较，乃有以短胜长之秘诀。如以下驷敌上驷，以上驷敌中驷，以中驷敌下驷之类：则诚兵家独具之诡谋，非常理之可测也。" },
        ]
    }, {
        title: "三十六计·敌战计·顺手牵羊",
        data: [
            { context: "【原典】：微隙在所必乘；微利在所必得。少阴，少阳。" },
            { context: "【按语】：大军动处，其隙甚多，乘间取利，不必以胜。胜固可用，败亦可用。" },
        ]
    }, {
        title: "三十六计·攻战计·打草惊蛇",
        data: [
            { context: "【原典】：疑以叩实，察而后动； 复者，阴之媒也。" },
            { context: "【按语】：敌力不露，阴谋深沉，未可轻进，应遍探其锋。兵书云：“军旁有险阻、潢井、葭苇、山林、翳荟者，必谨复索之，此伏奸所藏也。”" },
        ]
    }, {
        title: "三十六计·攻战计·借尸还魂",
        data: [
            { context: "【原典】：有用者，不可借；不能用者，求借。借不能用者而用之，匪我求童蒙，童蒙求我。" },
            { context: "【按语】：换代之际，纷立亡国之后者，固借尸还境之意也。凡—切寄兵权于人，而代其攻宁者，皆此用也。" },
        ]
    }, {
        title: "三十六计·攻战计·调虎离山",
        data: [
            { context: "【原典】：待天以困之，用人以诱之，往蹇来连返。" },
            { context: "【按语】：兵书曰：“下政攻城”。若攻坚，则自取败亡矣。敌既得地利，则不可争其地。且敌有主而势大：有主，则非利不来趋；势大，则非天人合用，不能胜。汉末，羌率众数千，遮虞诩于队仓崤谷。诩即停军不进，而宣言上书请兵，须到乃发。羌闻之，乃分抄旁县。翔因其兵散，日夜进道，兼行百余里，令军士各作两灶，日倍增之，羌不敢逼，遂大破之。兵到乃发者，利诱之也；日夜兼进者，用天时以困之也；倍增其灶者，惑之以人事也。" },
        ]
    }, {
        title: "三十六计·攻战计·欲擒故纵",
        data: [
            { context: "【原典】：逼则反兵；走则减势。紧随勿迫。累其气力，消其斗志，散而后擒，兵不血刃。需，有孚，光。" },
            { context: "【按语】：所谓纵着，非放之也，随之，而稍松之耳。“穷寇勿追”，亦即此意，盖不追者，非不随也，不追之而已。武侯之七纵七擒，即纵而随之，故蹑展转推进，至于不毛之地。武侯之七纵，其意在拓地，在借孟获以服诸蛮，非兵法也。故论战，则擒者不可复纵。" },
        ]
    }, {
        title: "三十六计·攻战计·抛砖引玉",
        data: [
            { context: "【原典】：类以诱之，击蒙也。" },
            { context: "【按语】：诱敌之法甚多，最妙之法，不在疑似之间，而在类同，以固其惑。以旌旗金鼓诱敌者，疑似也；以老弱粮草诱敌者，则类同也。如：楚伐绞，军其南门，屈瑕曰：“绞小而轻，轻则寡谋，请勿捍采樵者以诱之。”从之，绞人获利。明日绞人争出，驱楚役徙于山中。楚人坐守其北门，而伏诸山下，大败之，为城下之盟而还。又如孙膑减灶而诱杀庞涓。" },
        ]
    }, {
        title: "三十六计·攻战计·擒贼擒王",
        data: [
            { context: "【原典】：摧其坚，夺其魁，以解其体。龙战于野，其道穷也。" },
            { context: "【按语】：攻胜则利不胜取。取小遗大，卒之利、将之累、帅之害、攻之亏也。舍胜而不摧坚擒王．是纵虎归山也。擒王之法，不可图辨旌旗，而当察其阵中之首动。昔张巡与尹子奇战，直冲敌营，至子奇麾下，营中大乱，斩贼将五十余人，杀士卒五千余人。迎欲射子奇而不识，剡蒿为矢，中者喜谓巡矢尽，走白子奇，乃得其状，使霁云射之，中其左目，几获之，子奇乃收军退还。" },
        ]
    }, {
        title: "三十六计·混战计·釜底抽薪",
        data: [
            { context: "【原典】：不敌其力，而消其势，兑下乾上之象。" },
            { context: "【按语】：水沸者，力也，火之力也，阳中之阳也，锐不可当；薪者，火之魄也，即力之势也，阴中之阴也，近而无害；故力不可当而势犹可消。尉缭子曰：“气实则斗，气夺则走。”面夺气之法，则在攻心，昔吴汉为大司马，有寇夜攻汉营，军中惊扰，汉坚卧不动，军中闻汉不动，有倾乃定。乃选精兵反击，大破之：此即不直当其力而扑消其势也。宋薛长儒为汉、湖、滑三州通判，驻汉州。州兵数百叛，开营门，谋杀知州、兵马监押，烧营以为乱。有来告者，知州、监押皆不敢出。长儒挺身徒步，自坏垣入其营中，以福祸语乱卒日：“汝辈皆有父母妻子，何故作此？叛者立于左，胁从者立于右！”于是，不与谋者数百人立于右；独主谋者十三人突门而出，散于诸村野，寻捕获。时谓非长儒，则一城涂炭矣！此即攻心夺气之用也。或日：敌与敌对，捣强敌之虚以败其将成之功也。" },
        ]
    }, {
        title: "三十六计·混战计·混水摸鱼",
        data: [
            { context: "【原典】：乘其阴乱，利其弱而无主。随，以向晦入宴息。" },
            { context: "【按语】：动荡之际，数力冲撞，弱者依违无主，散蔽而不察，我随而取之。《六韬》日：“三军数惊，士卒不齐，相恐以敌强，相语以不利，耳目相属，妖言不止，众口相惑，不畏法令，不重其将：此弱征也。”是鱼，混战之际，择此而取之。如：刘备之得荆州，取西川，皆此计也。" },
        ]
    }, {
        title: "三十六计·混战计·金蝉脱壳",
        data: [
            { context: "【原典】：存其形，完其势；友不疑，敌不动。巽而止蛊。" },
            { context: "【按语】：共友击敌，坐观其势。尚另有一敌，则须去而存势。则金蝉脱壳者，非徒走也，盖为分身之法也。故大军转动．而旌旗金鼓，俨然原阵，使敌不敢动，友不生疑，待己摧他敌而返，而友敌始知，或犹且不如。然则金蝉脱壳者，在对敌之际，而抽精锐以袭别阵也。如：诸葛亮卒于军，司马懿追焉，姜维令仪反旗鸣鼓，若向懿者，懿退，于是仪结营而去。檀道济被围，乃命军士悉甲，身自（白）服乘舆徐出外围，魏惧有伏，不敢逼，乃归。" },
        ]
    }, {
        title: "三十六计·混战计·关门捉贼",
        data: [
            { context: "【原典】：小敌困之。剥，不利有攸往。" },
            { context: "【按语】：捉贼而必关门，非恐其逸也，恐其逸而为他人所得也；且逸者不可复追，恐其诱也。贼署，奇兵也，游兵也，所以劳我者也。吴子曰：“今使一死贼，伏于矿野，千人追之，莫不枭视狼顾。何者？恐其暴起而害己也。是以—人投命，足惧千夫。”追贼者，贼有脱逃之机，势必死斗；若断其去路，则成擒矣。故小敌必困之，不能，则放之可也。" },
        ]
    }, {
        title: "三十六计·混战计·远交近攻",
        data: [
            { context: "【原典】：形禁势格，利从近取，害以远隔。上火下泽。" },
            { context: "【按语】：混战之局，纵横捭阖之中，各自取利。远不可攻，而可以利相结；近者交之，反使变生肘腑。范雎之谋，为地理之定则，其理甚明。" },
        ]
    }, {
        title: "三十六计·混战计·假道伐虢",
        data: [
            { context: "【原典】：两大之间，敌胁以从，我假以势。困，有言不信。" },
            { context: "【按语】：假地用兵之举，非巧言可诳，必其势不受—方之胁从，则将受双方之夹击。如此境况之际，敌必迫之以威，我则诳之以不害，利其幸存之心，速得全势，彼将不能自阵，故不战而灭之矣。如：晋侯假道于虞以伐虢，晋灭虢，虢公丑奔京师，师还，袭虞灭之。" },
        ]
    }, {
        title: "三十六计·并战计·偷梁换柱",
        data: [
            { context: "【原典】：频更其阵，抽其劲旅，待其自败， 而后乘之，曳其轮也。" },
            { context: "【按语】：阵有纵横，天衡为梁，地轴为柱。梁柱以精兵为之，故观其阵，则知精兵之所有。共战他敌时，频更其阵，暗中抽换其精兵，或竟代其为梁柱；势成阵塌，遂兼其兵。并此敌以击他敌之首策也。" },
        ]
    }, {
        title: "三十六计·并战计·指桑骂槐",
        data: [
            { context: "【原典】：大凌小者，警以诱之。刚中而应，行险而顺。" },
            { context: "【按语】：率数未服者以对敌，若策之不行，而利诱之，又反启其疑，于是故为自误，责他人之失，以暗警之。警之者，反诱之也。此盖以刚险驱之也。或曰：此遣将之法也。" },
        ]
    }, {
        title: "三十六计·并战计·假痴不癫",
        data: [
            { context: "【原典】：宁伪作不知不为，不伪作假知妄为。静不露机，云雷屯也。" },
            { context: "【按语】：假作不知而实知，假作不为而实不可为，或将有所为。司马懿之假病昏以诛曹爽，受巾帼假请命以老蜀兵，所以成功；姜维九伐中原，明知不可为而妄为之，则似痴矣，所以破灭。兵书曰：“故善战者之胜也，无智名，无勇功。”当其机未发时，静屯似痴；若假癫，则不但露机，则乱动而群疑。故假痴者胜，假癫者败。或日：假痴可以对敌，并可以用兵。宋代，南俗尚鬼。狄青征侬智高时，大兵始出桂林之南，因佯祝曰：“胜负无以为据。”乃取百钱自持，与神约，果大捷，则投此钱尽钱面也。左右谏止，傥不如意，恐沮师，青不听。万众方耸视，已而挥手一掷，百钱旨面。于是举兵欢呼，声震林野，青亦大喜；顾左右。取百丁（钉）来，即随钱疏密，布地而帖丁（钉）之，加以青纱笼，手自封焉。曰：“俟凯旋，当酬神取钱。”其后平邕州还师，如言取钱，幕府士大夫共祝视，乃两面钱也。" },
        ]
    }, {
        title: "三十六计·并战计·上屋抽梯",
        data: [
            { context: "【原典】：假之以便，唆之使前，断其援应，陷之死地。遇毒，位不当也。" },
            { context: "【按语】：唆者，利使之也。利使之而不先为之便，或犹且不行。故抽梯之局，须先置梯，或示之梯。如：慕容垂、姚苌诸人怂秦苻坚侵晋，以乘机自起。" },
        ]
    }, {
        title: "三十六计·并战计·树上开花",
        data: [
            { context: "【原典】：借局布势，力小势大。鸿渐于陆，其羽可用为仪也。" },
            { context: "【按语】：此树本无花，而树则可以有花，剪彩贴之，不细察者不易发，使花与树交相辉映，而成玲珑全局也。此盖布精兵于友军之阵，完其势以威敌也。" },
        ]
    }, {
        title: "三十六计·并战计·反客为主",
        data: [
            { context: "【原典】：乘隙插足，扼其主机，渐之进也。" },
            { context: "【按语】：为人驱使者为奴，为人尊处者为客，不能立足者为暂客，能立足者为久客，客久而不能主事者为贱客，能主事则可渐握机要，而为主矣。故反客为主之局：第—步须争客位；第二步须乘隙；第三步须插足；第四足须握机；第五乃为主。为主，则并人之军矣；此渐进之阴谋也。如李渊书尊李密，密卒以败；汉高视势未敌项羽之先，卑事项羽。使其见信，而渐以侵其势，至垓下—役，—亡举之。" },
        ]
    }, {
        title: "三十六计·败战计·美人计",
        data: [
            { context: "【原典】：兵强者，攻其将；将智者，伐其情。将弱兵颓，其势自萎。利用御寇，顺相保也。" },
            { context: "【按语】：兵强将智，不可以敌，势必事先。事之以土地，以增其势，如六国之事秦：策之最下者也。事之以币帛，以增其富，如宋之事辽金：策之下者也。惟事以美人，以佚其志，以弱其体，以增其下之怨。如勾践以西施重宝取悦夫差，乃可转败为胜。" },
        ]
    }, {
        title: "三十六计·败战计·空城计",
        data: [
            { context: "【原典】：虚者虚之，疑中生疑；刚柔之际，奇而复奇。" },
            { context: "【按语】：虚虚实实，兵无常势。虚而示虚，诸葛而后，不乏其人。如吐蕃陷瓜州，王君焕死，河西汹惧。以张守归圭为瓜州刺史，领余众，方复筑州城。版干（筑城墙用的夹板和立柱）裁立．敌又暴至。略无守御之具。城中相顾失色，莫有斗志。守圭日：“徒众我寡，又疮痍之后，不可以矢石相持，须以权道制之。”乃于城上，置酒作乐，以会将士。敌疑城中有备，不敢攻而退。又如齐祖铤为北徐州刺史，至州，会有阵寇百姓多反。铤不关城门，守陴者，皆令下城，静座街巷，禁断行人鸡犬。贼无所见闻，不测所以，或疑人走城空，不设警备。铤复令大叫，鼓噪聒天，贼大惊，顿时走散。" },
        ]
    }, {
        title: "三十六计·败战计· 反间计",
        data: [
            { context: "【原典】：疑中之疑。比之自内，不自失也。" },
            { context: "【按语】：间者，使敌自相疑忌也；反间者，因敌之间而间之也。如燕昭王薨，惠王自为太子时，不快于乐毅。田单乃纵反间曰：“乐毅与燕王有隙，畏诛，欲连兵王齐，齐人未附。故且缓攻即墨，以待其事。齐人唯恐他将来，即墨残矣。惠王闻之，即使骑劫代将，毅遂奔赵。又如周瑜利用曹操间谍，以间其将；陈平以金纵反间于楚军，间范增，楚王疑而去之。亦疑中之疑之局也。" },
        ]
    }, {
        title: "三十六计·败战计·苦肉计",
        data: [
            { context: "【原典】：人不自害，受害必真；假真真假，间以得行。童蒙之吉，顺以巽也。" },
            { context: "【按语】：间者，使敌人相疑也；反间者，因敌人之疑，而实其疑也；苦肉计者，盖假作自间以间人也。凡遣与己有隙者以诱敌人，约为响应，或约为共力者：皆苦肉计之类也。如：郑武公伐胡而先以女妻胡君，并戮关其思；韩信下齐而骊生遭烹。" },
        ]
    }, {
        title: "三十六计·败战计·连环计",
        data: [
            { context: "【原典】：将多兵众，不可以敌，使其自累，以杀其势。在师中吉，承天宠也。" },
            { context: "【按语】：庞统使曹操战舰勾连，而后纵火焚之，使不得脱。则连环计者，其结在使敌自累，而后图之。盖一计累敌，—计攻敌，两计扣用，以摧强势也。如宋毕再遇赏引敌与战，且前且却，至于数四。视日已晚，乃以香料煮黑，布地上。复前博战，佯败走。敌乘胜追逐。其马已饥，闻豆香，乃就食，鞭之不前。遇率师反攻，遂大胜。皆连环之计也。" },
        ]
    }, {
        title: "三十六计·败战计·走为上计",
        data: [
            { context: "【原典】：全师避敌。左次无咎，未失常也" },
            { context: "【按语】：敌势全胜，我不能战。则：必降；必和；必走。降则全败，和则半败，走则未败。未败者，胜之转机也。如宋毕再遇与金人对垒，度金兵至者日众，难与争锋。—夕拔营去，留旗帜于营，豫缚生羊悬之，置其前二足于鼓上，羊不堪悬，则足击鼓有声。金人不觉为空营，相持数日，乃觉，欲追之，则已远矣。（《战略考．南宋》）可谓善走者矣。" },
        ]
    }
    ]
}
data = [demo]