var demo = {
    title: "史记",
    name: "史记",
    data: [{
        title: "十二本纪",
        data: [
            {
                title: "五帝本纪",
                data: [
                    { context: "这是五帝本纪" }
                ]
            }, {
                title: "夏本纪",
                data: [
                    { context: "这是夏本纪" }
                ]
            }, {
                title: "殷本纪",
                data: [
                    { context: "这是殷本纪" }
                ]
            }, {
                title: "周本纪",
                data: [
                    { context: "这是周本纪" }
                ]
            }, {
                title: "秦本纪",
                data: [
                    { context: "这是秦本纪" }
                ]
            }, {
                title: "秦始皇本纪",
                data: [
                    { context: "这是秦始皇本纪" }
                ]
            }, {
                title: "项羽本纪",
                data: [
                    { context: "这是项羽本纪" }
                ]
            }, {
                title: "高祖本纪",
                data: [
                    { context: "这是高祖本纪" }
                ]
            }, {
                title: "吕太后本纪",
                data: [
                    { context: "这是吕太后本纪" }
                ]
            }, {
                title: "孝文本纪",
                data: [
                    { context: "这是孝文本纪" }
                ]
            }, {
                title: "孝景本纪",
                data: [
                    { context: "这是孝景本纪" }
                ]
            }, {
                title: "孝武本纪",
                data: [
                    { context: "这是孝武本纪" }
                ]
            },
        ]
    }, {
        title: "十表",
        data: [
            {
                title: "三代世表",
                data: [
                    { context: "这是三代世表" }
                ]
            }, {
                title: "十二诸侯年表",
                data: [
                    { context: "这是十二诸侯年表" }
                ]
            }, {
                title: "六国年表",
                data: [
                    { context: "这是六国年表" }
                ]
            }, {
                title: "秦楚之际月表",
                data: [
                    { context: "这是秦楚之际月表" }
                ]
            }, {
                title: "汉兴以来诸侯王年表",
                data: [
                    { context: "这是汉兴以来诸侯王年表" }
                ]
            }, {
                title: "高祖功臣侯者年表",
                data: [
                    { context: "这是高祖功臣侯者年表" }
                ]
            }, {
                title: "惠景间侯者年表",
                data: [
                    { context: "这是惠景间侯者年表" }
                ]
            }, {
                title: "建元以来侯者年表",
                data: [
                    { context: "这是建元以来侯者年表" }
                ]
            }, {
                title: "建元已来王子侯者年表",
                data: [
                    { context: "这是建元已来王子侯者年表" }
                ]
            }, {
                title: "汉兴以来将相名臣年表",
                data: [
                    { context: "这是汉兴以来将相名臣年表" }
                ]
            },
        ]
    }, {
        title: "八书",
        data: [
            {
                title: "礼书",
                data: [
                    { context: "这是礼书" }
                ]
            }, {
                title: "乐书",
                data: [
                    { context: "这是乐书" }
                ]
            }, {
                title: "律书",
                data: [
                    { context: "这是律书" }
                ]
            }, {
                title: "历书",
                data: [
                    { context: "这是历书" }
                ]
            }, {
                title: "天官书",
                data: [
                    { context: "这是天官书" }
                ]
            }, {
                title: "封禅书",
                data: [
                    { context: "这是封禅书" }
                ]
            }, {
                title: "河渠书",
                data: [
                    { context: "这是河渠书" }
                ]
            }, {
                title: "平准书",
                data: [
                    { context: "这是平准书" }
                ]
            },
        ]
    }, {
        title: "三十世家",
        data: [
            {
                title: "吴太伯世家",
                data: [
                    { context: "这是吴太伯世家" }
                ]
            }, {
                title: "齐太公世家",
                data: [
                    { context: "寡人南伐至召陵，望熊山；北伐山戎、离枝、孤竹；西伐大夏，涉流沙；束马悬车登太行，至卑耳山而还。诸侯莫违寡人。寡人兵车之会三，乘车之会六，九合诸侯，一匡天下。昔三代受命，有何以异於此乎？吾欲封泰山，禅梁父。" }
                ]
            }, {
                title: "鲁周公世家",
                data: [
                    { context: "这是鲁周公世家" }
                ]
            }, {
                title: "燕召公世家",
                data: [
                    { context: "这是燕召公世家" }
                ]
            }, {
                title: "管蔡世家",
                data: [
                    { context: "这是管蔡世家" }
                ]
            }, {
                title: "陈杞世家",
                data: [
                    { context: "这是陈杞世家" }
                ]
            }, {
                title: "卫康叔世家",
                data: [
                    { context: "这是卫康叔世家" }
                ]
            }, {
                title: "宋微子世家",
                data: [
                    { context: "三十七年，楚惠王灭陈。荧惑守心。心，宋之分野也。景公忧之。司星子韦曰：“可移於相。”景公曰：“相，吾之股肱。”曰：“可移於民。”景公曰：“君者待民。”曰：“可移於岁。”景公曰：“岁饥民困，吾谁为君！”子韦曰：“天高听卑。君有君人之言三，荧惑宜有动。”於是候之，果徙三度。" },
                    { context: "太史公言：孔子称“微子去之，箕子为之奴，比干谏而死，殷有三仁焉”。" }
                ]
            }, {
                title: "晋世家",
                data: [
                    { context: "五月丁未，献楚俘於周，驷介百乘，徒兵千。天子使王子虎命晋侯为伯，赐大辂，彤弓矢百，玈弓矢千，秬鬯一卣，珪瓚，虎贲三百人。晋侯三辞，然后稽首受之。周作晋文侯命：“王若曰：父义和，丕显文、武，能慎明德，昭登於上，布闻在下，维时上帝集厥命于文、武。恤朕身、继予一人永其在位。”於是晋文公称伯。癸亥，王子虎盟诸侯於王庭" },
                    { context: "六月，晋人复入卫侯。壬午，晋侯度河北归国。行赏，狐偃为首。或曰：“城濮之事，先轸之谋。”文公曰：“城濮之事，偃说我毋失信。先轸曰‘军事胜为右’，吾用之以胜。然此一时之说，偃言万世之功，柰何以一时之利而加万世功乎？是以先之。”" },
                    { context: "太史公曰：晋文公，古所谓明君也，亡居外十九年，至困约，及即位而行赏，尚忘介子推，况骄主乎？灵公既弑，其後成、景致严，至厉大刻，大夫惧诛，祸作。悼公以後日衰，六卿专权。故君道之御其臣下。固不易哉！" },
                ]
            }, {
                title: "楚世家",
                data: [
                    { context: "三十五年，楚伐随。是也。随曰：“我无罪。”楚曰：“我蛮夷也。今诸侯皆为叛相侵，或相杀。我有敝甲，欲以观中国之政，请王室尊吾号。”" },
                    { context: "昔夏启有钧台之飨，商汤有景亳之命，周武王有盟津之誓，成王有岐阳之蒐，康王有丰宫之朝，穆王有涂山之会，齐桓有召陵之师，晋文有践土之盟，君其何用？" },
                    { context: "桀为有仍之会，有缗叛之。纣为黎山之会，东夷叛之。幽王为太室之盟，戎、翟叛之。君其慎终！" }
                ]
            }, {
                title: "越王句践世家",
                data: [
                    { context: "这是越王句践世家" }
                ]
            }, {
                title: "郑世家",
                data: [
                    { context: "夫齐，姜姓，伯夷之後也，伯夷佐尧典礼。秦，嬴姓，伯翳之後也，伯翳佐舜怀柔百物。及楚之先，皆尝有功於天下。而周武王克纣後，成王封叔虞于唐，其地阻险，以此有德与周衰并，亦必兴矣" },
                    { context: "我亡国外居，伯父无意入我，亦甚矣。”原曰：“事君无二心，人臣之职也。原知罪矣。”遂自杀。厉公於是谓甫假曰：“子之事君有二心矣。”遂诛之。假曰：“重德不报，诚然哉！”" }
                ]
            }, {
                title: "赵世家",
                data: [
                    { context: "臣闻疑事无功，疑行无名。王既定负遗俗之虑，殆无顾天下之议矣。夫论至德者不和於俗，成大功者不谋於众。昔者舜舞有苗，禹袒裸国，非以养欲而乐志也，务以论德而约功也。愚者闇成事，智者睹未形，则王何疑焉。" },
                    { context: "王曰：“吾不疑胡服也，吾恐天下笑我也。狂夫之乐，智者哀焉；愚者所笑，贤者察焉。世有顺我者，胡服之功未可知也。虽驱世以笑我，胡地中山吾必有之。”於是遂胡服矣" },
                    { context: "先王不同俗，何古之法？帝王不相袭，何礼之循？虙戏、神农教而不诛，黄帝、尧、舜诛而不怒。及至三王，随时制法，因事制礼。法度制令各顺其宜，衣服器械各便其用。故礼也不必一道，而便国不必古。圣人之兴也不相袭而王，夏、殷之衰也不易礼而灭。然则反古未可非，而循礼未足多也。且服奇者志淫，则是邹、鲁无奇行也；俗辟者民易，则是吴、越无秀士也。且圣人利身谓之服，便事谓之礼。夫进退之节，衣服之制者，所以齐常民也，非所以论贤者也。故齐民与俗流，贤者与变俱。故谚曰‘以书御者不尽马之情，以古制今者不达事之变’。循法之功，不足以高世；法古之学，不足以制今。子不及也" }
                ]
            }, {
                title: "魏世家",
                data: [
                    { context: "君不察故也。居视其所亲，富视其所与，达视其所举，穷视其所不为，贫视其所不取，五者足以定之矣，何待克哉！" },
                ]
            }, {
                title: "韩世家",
                data: [
                    { context: "这是韩世家" }
                ]
            }, {
                title: "田敬仲完世家",
                data: [
                    { context: "宣王喜文学游说之士，自如驺衍、淳于髡、田骈、接予、慎到、环渊之徒七十六人，皆赐列第，为上大夫，不治而议论。是以齐稷下学士复盛，且数百千人。" }
                ]
            }, {
                title: "孔子世家",
                data: [
                    { context: "高山仰止，景行行止。”虽不能至，然心乡往之。" },
                    { context: "自天子王侯，中国言六艺者折中於夫子，可谓至圣矣！" }
                ]
            }, {
                title: "陈涉世家",
                data: [
                    { context: "这是陈涉世家" }
                ]
            }, {
                title: "外戚世家",
                data: [
                    { context: "这是外戚世家" }
                ]
            }, {
                title: "楚元王世家",
                data: [
                    { context: "这是楚元王世家" }
                ]
            }, {
                title: "荆燕世家",
                data: [
                    { context: "这是荆燕世家" }
                ]
            }, {
                title: "齐悼惠王世家",
                data: [
                    { context: "这是齐悼惠王世家" }
                ]
            }, {
                title: "萧相国世家",
                data: [
                    { context: "这是萧相国世家" }
                ]
            }, {
                title: "曹相国世家",
                data: [
                    { context: "这是曹相国世家" }
                ]
            }, {
                title: "留侯世家",
                data: [
                    { context: "这是留侯世家" }
                ]
            }, {
                title: "陈丞相世家",
                data: [
                    { context: "这是陈丞相世家" }
                ]
            }, {
                title: "绛侯周勃世家",
                data: [
                    { context: "这是绛侯周勃世家" }
                ]
            }, {
                title: "梁孝王世家",
                data: [
                    { context: "这是梁孝王世家" }
                ]
            }, {
                title: "五宗世家",
                data: [
                    { context: "这是五宗世家" }
                ]
            }, {
                title: "三王世家",
                data: [
                    { context: "这是三王世家" }
                ]
            },
        ]
    }, {
        title: "七十列传",
        data: [
            {
                title: "伯夷列传",
                data: [
                    { context: "伯夷、叔齐叩马而谏曰：“父死不葬，爰及干戈，可谓孝乎？以臣弑君，可谓仁乎？”左右欲兵之。太公曰：“此义人也。”扶而去之。武王已平殷乱，天下宗周，而伯夷、叔齐耻之，义不食周粟，隐於首阳山，采薇而食之。及饿且死，作歌。其辞曰：“登彼西山兮，采其薇矣。以暴易暴兮，不知其非矣。神农、虞、夏忽焉没兮，我安適归矣？于嗟徂兮，命之衰矣！”遂饿死於首阳山。由此观之，怨邪非邪？" },
                    { context: "子曰：“道不同不相为谋”，亦各从其志也。故曰：“富贵如可求，虽执鞭之士，吾亦为之。如不可求，从吾所好”。“岁寒，然後知松柏之後凋”。举世混浊，清士乃见。岂以其重若彼，其轻若此哉？" },
                    { context: "“君子疾没世而名不称焉。”贾子曰：“贪夫徇财，烈士徇名，夸者死权，众庶冯生。”“同明相照，同类相求。”“云从龙，风从虎，圣人作而万物睹。”伯夷、叔齐虽贤，得夫子而名益彰。颜渊虽笃学，附骥尾而行益显。岩穴之士，趣舍有时若此，类名堙灭而不称，悲夫！闾巷之人，欲砥行立名者，非附青云之士，恶能施于後世哉？" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "管晏列传",
                data: [
                    { context: "管仲既用，任政於齐，齐桓公以霸，九合诸侯，一匡天下，管仲之谋也。" },
                    { context: "吾始困时，尝与鲍叔贾，分财利多自与，鲍叔不以我为贪，知我贫也。吾尝为鲍叔谋事而更穷困，鲍叔不以我为愚，知时有利不利也。吾尝三仕三见逐於君，鲍叔不以我为不肖，知我不遭时也。吾尝三战三走，鲍叔不以我怯，知我有老母也。公子纠败，召忽死之，吾幽囚受辱，鲍叔不以我为无耻，知我不羞小节而耻功名不显于天下也。生我者父母，知我者鲍子也。" },
                    { context: "太史公曰：吾读管氏牧民、山高、乘马、轻重、九府，及晏子春秋，详哉其言之也。既见其著书，欲观其行事，故次其传。至其书，世多有之，是以不论，论其轶事。" },
                    { context: "管仲世所谓贤臣，然孔子小之。岂以为周道衰微，桓公既贤，而不勉之至王，乃称霸哉？语曰“将顺其美，匡救其恶，故上下能哙亲也”。岂管仲之谓乎？" },
                    { context: "方晏子伏庄公尸哭之，成礼然後去，岂所谓“见义不为无勇”者邪？至其谏说，犯君之颜，此所谓“进思尽忠，退思补过”者哉！假令晏子而在，余虽为之执鞭，所忻慕焉。" },
                    { context: "　夷吾成霸，平仲称贤。粟乃实廪，豆不掩肩。转祸为福，危言获全。孔赖左衽，史忻执鞭。成礼而去，人望存焉。" },
                ]
            }, {
                title: "老子韩非列传",
                data: [
                    { context: "孔子去，谓弟子曰：“鸟，吾知其能飞；鱼，吾知其能游；兽，吾知其能走。走者可以为罔，游者可以为纶，飞者可以为矰。至於龙，吾不能知其乘风云而上天。吾今日见老子，其犹龙邪！”" },
                    { context: "韩非者，韩之诸公子也。喜刑名法术之学，而其归本於黄老。非为人口吃，不能道说，而善著书。与李斯俱事荀卿，斯自以为不如非。" },
                    { context: "　然韩非知说之难，为说难书甚具，终死於秦，不能自脱。【说难 这本书不错】" },
                    { context: "太史公曰：老子所贵道，虚无，因应变化於无为，故著书辞称微妙难识。庄子散道德，放论，要亦归之自然。申子卑卑，施之於名实。韩子引绳墨，切事情，明是非，其极惨礉少恩。皆原於道德之意，而老子深远矣。" },
                ]
            }, {
                title: "司马穰苴列传",
                data: [
                    { context: "穰苴虽田氏庶孽，然其人文能附众，武能威敌，" },
                    { context: "齐威王使大夫追论古者司马兵法而附穰苴於其中，因号曰司马穰苴兵法。" },
                ]
            }, {
                title: "孙子吴起列传",
                data: [
                    { context: "魏文侯既卒，起事其子武侯。武侯浮西河而下，中流，顾而谓吴起曰：“美哉乎山河之固，此魏国之宝也！”起对曰：“在德不在险。昔三苗氏左洞庭，右彭蠡，德义不修，禹灭之。夏桀之居，左河济，右泰华，伊阙在其南，羊肠在其北，修政不仁，汤放之。殷纣之国，左孟门，右太行，常山在其北，大河经其南，修政不德，武王杀之。由此观之，在德不在险。若君不修德，舟中之人尽为敌国也。”武侯曰：“善。”" },
                    { context: "能行之者未必能言，能言之者未必能行。" },
                    { context: "孙子兵法，一十三篇。美人既斩，良将得焉。其孙膑脚，筹策庞涓。吴起相魏，西河称贤；惨礉事楚，死後留权" },
                ]
            }, {
                title: "伍子胥列传",
                data: [
                    { context: "太史公曰：怨毒之於人甚矣哉！王者尚不能行之於臣下，况同列乎！向令伍子胥从奢俱死，何异蝼蚁。弃小义，雪大耻，名垂於後世，悲夫！方子胥窘於江上，道乞食，志岂尝须臾忘郢邪？故隐忍就功名，非烈丈夫孰能致此哉？白公如不自立为君者，其功谋亦不可胜道者哉！" }
                ]
            }, {
                title: "仲尼弟子列传",
                data: [
                    { context: "这是仲尼弟子列传" }
                ]
            }, {
                title: "商君列传",
                data: [
                    { context: "这是商君列传" }
                ]
            }, {
                title: "苏秦列传",
                data: [
                    { context: "这是苏秦列传" }
                ]
            }, {
                title: "张仪列传",
                data: [
                    { context: "这是张仪列传" }
                ]
            }, {
                title: "樗里子甘茂列传",
                data: [
                    { context: "这是樗里子甘茂列传" }
                ]
            }, {
                title: "穰侯列传",
                data: [
                    { context: "这是穰侯列传" }
                ]
            }, {
                title: "白起王翦列传",
                data: [
                    { context: "这是白起王翦列传" }
                ]
            }, {
                title: "孟子荀卿列传",
                data: [
                    { context: "这是孟子荀卿列传" }
                ]
            }, {
                title: "孟尝君列传",
                data: [
                    { context: "这是孟尝君列传" }
                ]
            }, {
                title: "平原君虞卿列传",
                data: [
                    { context: "这是平原君虞卿列传" }
                ]
            }, {
                title: "魏公子列传",
                data: [
                    { context: "这是魏公子列传" }
                ]
            }, {
                title: "春申君列传",
                data: [
                    { context: "这是春申君列传" }
                ]
            }, {
                title: "范睢蔡泽列传",
                data: [
                    { context: "这是范睢蔡泽列传" }
                ]
            }, {
                title: "乐毅列传",
                data: [
                    { context: "这是乐毅列传" }
                ]
            }, {
                title: "廉颇蔺相如列传",
                data: [
                    { context: "这是廉颇蔺相如列传" }
                ]
            }, {
                title: "田单列传",
                data: [
                    { context: "这是田单列传" }
                ]
            }, {
                title: "鲁仲连邹阳列传",
                data: [
                    { context: "这是鲁仲连邹阳列传" }
                ]
            }, {
                title: "屈原贾生列传",
                data: [
                    { context: "这是屈原贾生列传" }
                ]
            }, {
                title: "吕不韦列传",
                data: [
                    { context: "这是吕不韦列传" }
                ]
            }, {
                title: "刺客列传",
                data: [
                    { context: "这是刺客列传" }
                ]
            }, {
                title: "李斯列传",
                data: [
                    { context: "这是李斯列传" }
                ]
            }, {
                title: "蒙恬列传",
                data: [
                    { context: "这是蒙恬列传" }
                ]
            }, {
                title: "张耳陈馀列传",
                data: [
                    { context: "这是张耳陈馀列传" }
                ]
            }, {
                title: "魏豹彭越列传",
                data: [
                    { context: "这是魏豹彭越列传" }
                ]
            }, {
                title: "黥布列传",
                data: [
                    { context: "这是黥布列传" }
                ]
            }, {
                title: "淮阴侯列传",
                data: [
                    { context: "这是淮阴侯列传" }
                ]
            }, {
                title: "韩信卢绾列传",
                data: [
                    { context: "这是韩信卢绾列传" }
                ]
            }, {
                title: "田儋列传",
                data: [
                    { context: "这是田儋列传" }
                ]
            }, {
                title: "樊郦滕灌列传",
                data: [
                    { context: "这是樊郦滕灌列传" }
                ]
            }, {
                title: "张丞相列传",
                data: [
                    { context: "这是张丞相列传" }
                ]
            }, {
                title: "郦生陆贾列传",
                data: [
                    { context: "这是郦生陆贾列传" }
                ]
            }, {
                title: "傅靳蒯成列传",
                data: [
                    { context: "这是傅靳蒯成列传" }
                ]
            }, {
                title: "刘敬叔孙通列传",
                data: [
                    { context: "这是刘敬叔孙通列传" }
                ]
            }, {
                title: "五帝本纪",
                data: [
                    { context: "这是" }
                ]
            }, {
                title: "季布栾布列传",
                data: [
                    { context: "这是季布栾布列传" }
                ]
            }, {
                title: "袁盎晁错列传",
                data: [
                    { context: "这是袁盎晁错列传" }
                ]
            }, {
                title: "张释之冯唐列传",
                data: [
                    { context: "这是张释之冯唐列传" }
                ]
            }, {
                title: "万石张叔列传",
                data: [
                    { context: "这是万石张叔列传" }
                ]
            }, {
                title: "田叔列传",
                data: [
                    { context: "这是田叔列传" }
                ]
            }, {
                title: "扁鹊仓公列传",
                data: [
                    { context: "这是扁鹊仓公列传" }
                ]
            }, {
                title: "吴王濞列传",
                data: [
                    { context: "这是吴王濞列传" }
                ]
            }, {
                title: "魏其武安侯列传",
                data: [
                    { context: "这是魏其武安侯列传" }
                ]
            }, {
                title: "韩长孺列传",
                data: [
                    { context: "这是韩长孺列传" }
                ]
            }, {
                title: "李将军列传",
                data: [
                    { context: "这是李将军列传" }
                ]
            }, {
                title: "匈奴列传",
                data: [
                    { context: "这是匈奴列传" }
                ]
            }, {
                title: "卫将军骠骑列传",
                data: [
                    { context: "这是卫将军骠骑列传" }
                ]
            }, {
                title: "平津侯主父列传",
                data: [
                    { context: "这是平津侯主父列传" }
                ]
            }, {
                title: "南越列传",
                data: [
                    { context: "这是南越列传" }
                ]
            }, {
                title: "东越列传",
                data: [
                    { context: "这是东越列传" }
                ]
            }, {
                title: "朝鲜列传",
                data: [
                    { context: "这是朝鲜列传" }
                ]
            }, {
                title: "西南夷列传",
                data: [
                    { context: "这是西南夷列传" }
                ]
            }, {
                title: "司马相如列传",
                data: [
                    { context: "这是司马相如列传" }
                ]
            }, {
                title: "淮南衡山列传",
                data: [
                    { context: "这是淮南衡山列传" }
                ]
            }, {
                title: "循吏列传",
                data: [
                    { context: "这是循吏列传" }
                ]
            }, {
                title: "汲郑列传",
                data: [
                    { context: "这是汲郑列传" }
                ]
            }, {
                title: "儒林列传",
                data: [
                    { context: "这是儒林列传" }
                ]
            }, {
                title: "酷吏列传",
                data: [
                    { context: "这是酷吏列传" }
                ]
            }, {
                title: "大宛列传",
                data: [
                    { context: "这是大宛列传" }
                ]
            }, {
                title: "游侠列传",
                data: [
                    { context: "这是游侠列传" }
                ]
            }, {
                title: "佞幸列传",
                data: [
                    { context: "这是佞幸列传" }
                ]
            }, {
                title: "滑稽列传",
                data: [
                    { context: "这是滑稽列传" }
                ]
            }, {
                title: "日者列传",
                data: [
                    { context: "这是日者列传" }
                ]
            }, {
                title: "龟策列传",
                data: [
                    { context: "这是龟策列传" }
                ]
            }, {
                title: "货殖列传",
                data: [
                    { context: "这是货殖列传" }
                ]
            }, {
                title: "太史公自序",
                data: [
                    { context: "这是太史公自序" }
                ]
            },
        ]
    }]
}
data = [demo]
