var demo = {
    title: "史记",
    name: "史记",
    data: [{
        title: "十二本纪",
        data: [
            {
                title: "五帝本纪",
                data: [
                    { context: "这是五帝本纪" }
                ]
            }, {
                title: "夏本纪",
                data: [
                    { context: "这是夏本纪" }
                ]
            }, {
                title: "殷本纪",
                data: [
                    { context: "这是殷本纪" }
                ]
            }, {
                title: "周本纪",
                data: [
                    { context: "这是周本纪" }
                ]
            }, {
                title: "秦本纪",
                data: [
                    { context: "这是秦本纪" }
                ]
            }, {
                title: "秦始皇本纪",
                data: [
                    { context: "这是秦始皇本纪" }
                ]
            }, {
                title: "项羽本纪",
                data: [
                    { context: "这是项羽本纪" }
                ]
            }, {
                title: "高祖本纪",
                data: [
                    { context: "这是高祖本纪" }
                ]
            }, {
                title: "吕太后本纪",
                data: [
                    { context: "这是吕太后本纪" }
                ]
            }, {
                title: "孝文本纪",
                data: [
                    { context: "这是孝文本纪" }
                ]
            }, {
                title: "孝景本纪",
                data: [
                    { context: "这是孝景本纪" }
                ]
            }, {
                title: "孝武本纪",
                data: [
                    { context: "这是孝武本纪" }
                ]
            },
        ]
    }, {
        title: "十表",
        data: [
            {
                title: "三代世表",
                data: [
                    { context: "这是三代世表" }
                ]
            }, {
                title: "十二诸侯年表",
                data: [
                    { context: "这是十二诸侯年表" }
                ]
            }, {
                title: "六国年表",
                data: [
                    { context: "这是六国年表" }
                ]
            }, {
                title: "秦楚之际月表",
                data: [
                    { context: "这是秦楚之际月表" }
                ]
            }, {
                title: "汉兴以来诸侯王年表",
                data: [
                    { context: "这是汉兴以来诸侯王年表" }
                ]
            }, {
                title: "高祖功臣侯者年表",
                data: [
                    { context: "这是高祖功臣侯者年表" }
                ]
            }, {
                title: "惠景间侯者年表",
                data: [
                    { context: "这是惠景间侯者年表" }
                ]
            }, {
                title: "建元以来侯者年表",
                data: [
                    { context: "这是建元以来侯者年表" }
                ]
            }, {
                title: "建元已来王子侯者年表",
                data: [
                    { context: "这是建元已来王子侯者年表" }
                ]
            }, {
                title: "汉兴以来将相名臣年表",
                data: [
                    { context: "这是汉兴以来将相名臣年表" }
                ]
            },
        ]
    }, {
        title: "八书",
        data: [
            {
                title: "礼书",
                data: [
                    { context: "这是礼书" }
                ]
            }, {
                title: "乐书",
                data: [
                    { context: "这是乐书" }
                ]
            }, {
                title: "律书",
                data: [
                    { context: "这是律书" }
                ]
            }, {
                title: "历书",
                data: [
                    { context: "这是历书" }
                ]
            }, {
                title: "天官书",
                data: [
                    { context: "这是天官书" }
                ]
            }, {
                title: "封禅书",
                data: [
                    { context: "这是封禅书" }
                ]
            }, {
                title: "河渠书",
                data: [
                    { context: "这是河渠书" }
                ]
            }, {
                title: "平准书",
                data: [
                    { context: "这是平准书" }
                ]
            },
        ]
    }, {
        title: "三十世家",
        data: [
            {
                title: "吴太伯世家",
                data: [
                    { context: "这是吴太伯世家" }
                ]
            }, {
                title: "齐太公世家",
                data: [
                    { context: "寡人南伐至召陵，望熊山；北伐山戎、离枝、孤竹；西伐大夏，涉流沙；束马悬车登太行，至卑耳山而还。诸侯莫违寡人。寡人兵车之会三，乘车之会六，九合诸侯，一匡天下。昔三代受命，有何以异於此乎？吾欲封泰山，禅梁父。" }
                ]
            }, {
                title: "鲁周公世家",
                data: [
                    { context: "这是鲁周公世家" }
                ]
            }, {
                title: "燕召公世家",
                data: [
                    { context: "这是燕召公世家" }
                ]
            }, {
                title: "管蔡世家",
                data: [
                    { context: "这是管蔡世家" }
                ]
            }, {
                title: "陈杞世家",
                data: [
                    { context: "这是陈杞世家" }
                ]
            }, {
                title: "卫康叔世家",
                data: [
                    { context: "这是卫康叔世家" }
                ]
            }, {
                title: "宋微子世家",
                data: [
                    { context: "三十七年，楚惠王灭陈。荧惑守心。心，宋之分野也。景公忧之。司星子韦曰：“可移於相。”景公曰：“相，吾之股肱。”曰：“可移於民。”景公曰：“君者待民。”曰：“可移於岁。”景公曰：“岁饥民困，吾谁为君！”子韦曰：“天高听卑。君有君人之言三，荧惑宜有动。”於是候之，果徙三度。" },
                    { context: "太史公言：孔子称“微子去之，箕子为之奴，比干谏而死，殷有三仁焉”。" }
                ]
            }, {
                title: "晋世家",
                data: [
                    { context: "五月丁未，献楚俘於周，驷介百乘，徒兵千。天子使王子虎命晋侯为伯，赐大辂，彤弓矢百，玈弓矢千，秬鬯一卣，珪瓚，虎贲三百人。晋侯三辞，然后稽首受之。周作晋文侯命：“王若曰：父义和，丕显文、武，能慎明德，昭登於上，布闻在下，维时上帝集厥命于文、武。恤朕身、继予一人永其在位。”於是晋文公称伯。癸亥，王子虎盟诸侯於王庭" },
                    { context: "六月，晋人复入卫侯。壬午，晋侯度河北归国。行赏，狐偃为首。或曰：“城濮之事，先轸之谋。”文公曰：“城濮之事，偃说我毋失信。先轸曰‘军事胜为右’，吾用之以胜。然此一时之说，偃言万世之功，柰何以一时之利而加万世功乎？是以先之。”" },
                    { context: "太史公曰：晋文公，古所谓明君也，亡居外十九年，至困约，及即位而行赏，尚忘介子推，况骄主乎？灵公既弑，其後成、景致严，至厉大刻，大夫惧诛，祸作。悼公以後日衰，六卿专权。故君道之御其臣下。固不易哉！" },
                ]
            }, {
                title: "楚世家",
                data: [
                    { context: "三十五年，楚伐随。是也。随曰：“我无罪。”楚曰：“我蛮夷也。今诸侯皆为叛相侵，或相杀。我有敝甲，欲以观中国之政，请王室尊吾号。”" },
                    { context: "昔夏启有钧台之飨，商汤有景亳之命，周武王有盟津之誓，成王有岐阳之蒐，康王有丰宫之朝，穆王有涂山之会，齐桓有召陵之师，晋文有践土之盟，君其何用？" },
                    { context: "桀为有仍之会，有缗叛之。纣为黎山之会，东夷叛之。幽王为太室之盟，戎、翟叛之。君其慎终！" }
                ]
            }, {
                title: "越王句践世家",
                data: [
                    { context: "这是越王句践世家" }
                ]
            }, {
                title: "郑世家",
                data: [
                    { context: "夫齐，姜姓，伯夷之後也，伯夷佐尧典礼。秦，嬴姓，伯翳之後也，伯翳佐舜怀柔百物。及楚之先，皆尝有功於天下。而周武王克纣後，成王封叔虞于唐，其地阻险，以此有德与周衰并，亦必兴矣" },
                    { context: "我亡国外居，伯父无意入我，亦甚矣。”原曰：“事君无二心，人臣之职也。原知罪矣。”遂自杀。厉公於是谓甫假曰：“子之事君有二心矣。”遂诛之。假曰：“重德不报，诚然哉！”" }
                ]
            }, {
                title: "赵世家",
                data: [
                    { context: "臣闻疑事无功，疑行无名。王既定负遗俗之虑，殆无顾天下之议矣。夫论至德者不和於俗，成大功者不谋於众。昔者舜舞有苗，禹袒裸国，非以养欲而乐志也，务以论德而约功也。愚者闇成事，智者睹未形，则王何疑焉。" },
                    { context: "王曰：“吾不疑胡服也，吾恐天下笑我也。狂夫之乐，智者哀焉；愚者所笑，贤者察焉。世有顺我者，胡服之功未可知也。虽驱世以笑我，胡地中山吾必有之。”於是遂胡服矣" },
                    { context: "先王不同俗，何古之法？帝王不相袭，何礼之循？虙戏、神农教而不诛，黄帝、尧、舜诛而不怒。及至三王，随时制法，因事制礼。法度制令各顺其宜，衣服器械各便其用。故礼也不必一道，而便国不必古。圣人之兴也不相袭而王，夏、殷之衰也不易礼而灭。然则反古未可非，而循礼未足多也。且服奇者志淫，则是邹、鲁无奇行也；俗辟者民易，则是吴、越无秀士也。且圣人利身谓之服，便事谓之礼。夫进退之节，衣服之制者，所以齐常民也，非所以论贤者也。故齐民与俗流，贤者与变俱。故谚曰‘以书御者不尽马之情，以古制今者不达事之变’。循法之功，不足以高世；法古之学，不足以制今。子不及也" }
                ]
            }, {
                title: "魏世家",
                data: [
                    { context: "君不察故也。居视其所亲，富视其所与，达视其所举，穷视其所不为，贫视其所不取，五者足以定之矣，何待克哉！" },
                ]
            }, {
                title: "韩世家",
                data: [
                    { context: "这是韩世家" }
                ]
            }, {
                title: "田敬仲完世家",
                data: [
                    { context: "宣王喜文学游说之士，自如驺衍、淳于髡、田骈、接予、慎到、环渊之徒七十六人，皆赐列第，为上大夫，不治而议论。是以齐稷下学士复盛，且数百千人。" }
                ]
            }, {
                title: "孔子世家",
                data: [
                    { context: "高山仰止，景行行止。”虽不能至，然心乡往之。" },
                    { context: "自天子王侯，中国言六艺者折中於夫子，可谓至圣矣！" }
                ]
            }, {
                title: "陈涉世家",
                data: [
                    { context: "这是陈涉世家" }
                ]
            }, {
                title: "外戚世家",
                data: [
                    { context: "这是外戚世家" }
                ]
            }, {
                title: "楚元王世家",
                data: [
                    { context: "这是楚元王世家" }
                ]
            }, {
                title: "荆燕世家",
                data: [
                    { context: "这是荆燕世家" }
                ]
            }, {
                title: "齐悼惠王世家",
                data: [
                    { context: "这是齐悼惠王世家" }
                ]
            }, {
                title: "萧相国世家",
                data: [
                    { context: "这是萧相国世家" }
                ]
            }, {
                title: "曹相国世家",
                data: [
                    { context: "这是曹相国世家" }
                ]
            }, {
                title: "留侯世家",
                data: [
                    { context: "这是留侯世家" }
                ]
            }, {
                title: "陈丞相世家",
                data: [
                    { context: "这是陈丞相世家" }
                ]
            }, {
                title: "绛侯周勃世家",
                data: [
                    { context: "这是绛侯周勃世家" }
                ]
            }, {
                title: "梁孝王世家",
                data: [
                    { context: "这是梁孝王世家" }
                ]
            }, {
                title: "五宗世家",
                data: [
                    { context: "这是五宗世家" }
                ]
            }, {
                title: "三王世家",
                data: [
                    { context: "这是三王世家" }
                ]
            },
        ]
    }, {
        title: "七十列传",
        data: [
            {
                title: "伯夷列传",
                data: [
                    { context: "伯夷、叔齐叩马而谏曰：“父死不葬，爰及干戈，可谓孝乎？以臣弑君，可谓仁乎？”左右欲兵之。太公曰：“此义人也。”扶而去之。武王已平殷乱，天下宗周，而伯夷、叔齐耻之，义不食周粟，隐於首阳山，采薇而食之。及饿且死，作歌。其辞曰：“登彼西山兮，采其薇矣。以暴易暴兮，不知其非矣。神农、虞、夏忽焉没兮，我安適归矣？于嗟徂兮，命之衰矣！”遂饿死於首阳山。由此观之，怨邪非邪？" },
                    { context: "子曰：“道不同不相为谋”，亦各从其志也。故曰：“富贵如可求，虽执鞭之士，吾亦为之。如不可求，从吾所好”。“岁寒，然後知松柏之後凋”。举世混浊，清士乃见。岂以其重若彼，其轻若此哉？" },
                    { context: "“君子疾没世而名不称焉。”贾子曰：“贪夫徇财，烈士徇名，夸者死权，众庶冯生。”“同明相照，同类相求。”“云从龙，风从虎，圣人作而万物睹。”伯夷、叔齐虽贤，得夫子而名益彰。颜渊虽笃学，附骥尾而行益显。岩穴之士，趣舍有时若此，类名堙灭而不称，悲夫！闾巷之人，欲砥行立名者，非附青云之士，恶能施于後世哉？" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "管晏列传",
                data: [
                    { context: "管仲既用，任政於齐，齐桓公以霸，九合诸侯，一匡天下，管仲之谋也。" },
                    { context: "吾始困时，尝与鲍叔贾，分财利多自与，鲍叔不以我为贪，知我贫也。吾尝为鲍叔谋事而更穷困，鲍叔不以我为愚，知时有利不利也。吾尝三仕三见逐於君，鲍叔不以我为不肖，知我不遭时也。吾尝三战三走，鲍叔不以我怯，知我有老母也。公子纠败，召忽死之，吾幽囚受辱，鲍叔不以我为无耻，知我不羞小节而耻功名不显于天下也。生我者父母，知我者鲍子也。" },
                    { context: "太史公曰：吾读管氏牧民、山高、乘马、轻重、九府，及晏子春秋，详哉其言之也。既见其著书，欲观其行事，故次其传。至其书，世多有之，是以不论，论其轶事。" },
                    { context: "管仲世所谓贤臣，然孔子小之。岂以为周道衰微，桓公既贤，而不勉之至王，乃称霸哉？语曰“将顺其美，匡救其恶，故上下能哙亲也”。岂管仲之谓乎？" },
                    { context: "方晏子伏庄公尸哭之，成礼然後去，岂所谓“见义不为无勇”者邪？至其谏说，犯君之颜，此所谓“进思尽忠，退思补过”者哉！假令晏子而在，余虽为之执鞭，所忻慕焉。" },
                    { context: "　夷吾成霸，平仲称贤。粟乃实廪，豆不掩肩。转祸为福，危言获全。孔赖左衽，史忻执鞭。成礼而去，人望存焉。" },
                ]
            }, {
                title: "老子韩非列传",
                data: [
                    { context: "孔子去，谓弟子曰：“鸟，吾知其能飞；鱼，吾知其能游；兽，吾知其能走。走者可以为罔，游者可以为纶，飞者可以为矰。至於龙，吾不能知其乘风云而上天。吾今日见老子，其犹龙邪！”" },
                    { context: "韩非者，韩之诸公子也。喜刑名法术之学，而其归本於黄老。非为人口吃，不能道说，而善著书。与李斯俱事荀卿，斯自以为不如非。" },
                    { context: "　然韩非知说之难，为说难书甚具，终死於秦，不能自脱。【说难 这本书不错】" },
                    { context: "太史公曰：老子所贵道，虚无，因应变化於无为，故著书辞称微妙难识。庄子散道德，放论，要亦归之自然。申子卑卑，施之於名实。韩子引绳墨，切事情，明是非，其极惨礉少恩。皆原於道德之意，而老子深远矣。" },
                ]
            }, {
                title: "司马穰苴列传",
                data: [
                    { context: "穰苴虽田氏庶孽，然其人文能附众，武能威敌，" },
                    { context: "齐威王使大夫追论古者司马兵法而附穰苴於其中，因号曰司马穰苴兵法。" },
                ]
            }, {
                title: "孙子吴起列传",
                data: [
                    { context: "魏文侯既卒，起事其子武侯。武侯浮西河而下，中流，顾而谓吴起曰：“美哉乎山河之固，此魏国之宝也！”起对曰：“在德不在险。昔三苗氏左洞庭，右彭蠡，德义不修，禹灭之。夏桀之居，左河济，右泰华，伊阙在其南，羊肠在其北，修政不仁，汤放之。殷纣之国，左孟门，右太行，常山在其北，大河经其南，修政不德，武王杀之。由此观之，在德不在险。若君不修德，舟中之人尽为敌国也。”武侯曰：“善。”" },
                    { context: "能行之者未必能言，能言之者未必能行。" },
                    { context: "孙子兵法，一十三篇。美人既斩，良将得焉。其孙膑脚，筹策庞涓。吴起相魏，西河称贤；惨礉事楚，死後留权" },
                ]
            }, {
                title: "伍子胥列传",
                data: [
                    { context: "太史公曰：怨毒之於人甚矣哉！王者尚不能行之於臣下，况同列乎！向令伍子胥从奢俱死，何异蝼蚁。弃小义，雪大耻，名垂於後世，悲夫！方子胥窘於江上，道乞食，志岂尝须臾忘郢邪？故隐忍就功名，非烈丈夫孰能致此哉？白公如不自立为君者，其功谋亦不可胜道者哉！" }
                ]
            }, {
                title: "仲尼弟子列传",
                data: [
                    { context: "宰予字子我。利口辩辞。既受业，问：“三年之丧不已久乎？君子三年不为礼，礼必坏；三年不为乐，乐必崩。旧穀既没，新穀既升，钻燧改火，期可已矣。”子曰：“於汝安乎？”曰：“安。”“汝安则为之。君子居丧，食旨不甘，闻乐不乐，故弗为也。”宰我出，子曰：“予之不仁也！子生三年然後免於父母之怀。夫三年之丧，天下之通义也。”" },
                    { context: "宰予昼寝。子曰：“朽木不可雕也，粪土之墙不可圬也。”" },
                    { context: "子贡问曰：“富而无骄，贫而无谄，何如？”孔子曰：“可也；不如贫而乐道，富而好礼。”" },
                    { context: "樊迟问仁，子曰：“爱人。”问智，曰：“知人。”" },
                    { context: "陈司败问孔子曰：“鲁昭公知礼乎？”孔子曰：“知礼。”退而揖巫马旗曰：“吾闻君子不党，君子亦党乎？鲁君娶吴女为夫人，命之为孟子。孟子姓姬，讳称同姓，故谓之孟子。鲁君而知礼，孰不知礼！”施以告孔子，孔子曰：“丘也幸，苟有过，人必知之。臣不可言君亲之恶，为讳者，礼也。”" },

                    { context: "" },
                ]
            }, {
                title: "商君列传 -  商鞅 公孙鞅",
                data: [
                    { context: "彼王不能用君之言任臣，又安能用君之言杀臣乎？" },
                    { context: "卫鞅曰：“疑行无名，疑事无功。且夫有高人之行者，固见非於世；有独知之虑者，必见敖於民。愚者闇於成事，知者见於未萌。民不可与虑始而可与乐成。论至德者不和於俗，成大功者不谋於众。是以圣人苟可以彊国，不法其故；苟可以利民，不循其礼。”孝公曰：“善。”甘龙曰：“不然。圣人不易民而教，知者不变法而治。因民而教，不劳而成功；缘法而治者，吏习而民安之。”卫鞅曰：“龙之所言，世俗之言也。常人安於故俗，学者溺於所闻。以此两者居官守法可也，非所与论於法之外也。三代不同礼而王，五伯不同法而霸。智者作法，愚者制焉；贤者更礼，不肖者拘焉。”杜挚曰：“利不百，不变法；功不十，不易器。法古无过，循礼无邪。”卫鞅曰：“治世不一道，便国不法古。故汤武不循古而王，夏殷不易礼而亡。反古者不可非，而循礼者不足多。”孝公曰：“善。”以卫鞅为左庶长，卒定变法之令。" },
                    { context: "卫鞅曰“此皆乱化之民也”，尽迁之於边城。其後民莫敢议令。" },
                    { context: "秦惠王车裂商君以徇" },
                    { context: "太史公曰：商君，其天资刻薄人也。迹其欲干孝公以帝王术，挟持浮说，非其质矣。且所因由嬖臣，及得用，刑公子虔，欺魏将卬，不师赵良之言，亦足发明商君之少恩矣。余尝读商君开塞耕战书，与其人行事相类。卒受恶名於秦，有以也夫" },
                    { context: "卫鞅入秦，景监是因。王道不用，霸术见亲。政必改革，礼岂因循。既欺魏将，亦怨秦人。如何作法，逆旅不宾！" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "苏秦列传",
                data: [
                    { context: "太史公曰：苏秦兄弟三人，皆游说诸侯以显名，其术长於权变。而苏秦被反间以死，天下共笑之，讳学其术。然世言苏秦多异，异时事有类之者皆附之苏秦。夫苏秦起闾阎，连六国从亲，此其智有过人者。吾故列其行事，次其时序，毋令独蒙恶声焉。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "张仪列传",
                data: [
                    { context: "张仪谓其妻曰：“视吾舌尚在不？”其妻笑曰：“舌在也。”仪曰：“足矣。”" },
                    { context: "仪说楚王曰：“大王诚能听臣，闭关绝约於齐，臣请献商於之地六百里，使秦女得为大王箕帚之妾，秦楚娶妇嫁女，长为兄弟之国。此北弱齐而西益秦也，计无便此者。”楚王大说而许之。群臣皆贺，陈轸独吊之。楚王怒曰：“寡人不兴师发兵得六百里地，群臣皆贺，子独吊，何也？”陈轸对曰：“不然，以臣观之，商於之地不可得而齐秦合，齐秦合则患必至矣。”" },
                    { context: "齐之交合，张仪乃朝，谓楚使者曰：“臣有奉邑六里，原以献大王左右。”楚使者曰：“臣受令於王，以商於之地六百里，不闻六里。”还报楚王，楚王大怒，发兵而攻秦。陈轸曰：“轸可发口言乎？攻之不如割地反以赂秦，与之并兵而攻齐，是我出地於秦，取偿於齐也，王国尚可存。”" },
                    { context: "太史公曰：三晋多权变之士，夫言从衡彊秦者大抵皆三晋之人也。夫张仪之行事甚於苏秦，然世恶苏秦者，以其先死，而仪振暴其短以扶其说，成其衡道。要之，此两人真倾危之士哉！" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "樗里子甘茂列传",
                data: [
                    { context: "甘茂起下蔡闾阎，显名诸侯，重彊齐楚。甘罗年少，然出一奇计，声称後世。虽非笃行之君子，然亦战国之策士也。方秦之彊时，天下尤趋谋诈哉" }
                ]
            }, {
                title: "穰侯列传",
                data: [
                    { context: "太史公曰：穰侯，昭王亲舅也。而秦所以东益地，弱诸侯，尝称帝於天下，天下皆西乡稽首者，穰侯之功也。及其贵极富溢，一夫开说，身折势夺而以忧死，况於羁旅之臣乎！" },
                    { context: "穰侯智识，应变无方。内倚太后，外辅昭王。四登相位，再列封疆。摧齐挠楚，破魏围梁。一夫开说，忧愤而亡。" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "白起王翦列传",
                data: [
                    { context: "武安君引剑将自刭，曰：“我何罪于天而至此哉？”良久，曰：“我固当死。长平之战，赵卒降者数十万人，我诈而尽阬之，是足以死。”遂自杀。武安君之死也，" },
                    { context: "始皇曰：“为听将军计耳。”於是王翦将兵六十万人，始皇自送至灞上。王翦行，请美田宅园池甚众。始皇曰：“将军行矣，何忧贫乎？”王翦曰：“为大王将，有功终不得封侯，故及大王之乡臣，臣亦及时以请园池为子孙业耳。”始皇大笑。王翦既至关，使使还请善田者五辈。或曰：“将军之乞贷，亦已甚矣。”王翦曰：“不然。夫秦王怚而不信人。今空秦国甲士而专委於我，我不多请田宅为子孙业以自坚，顾令秦王坐而疑我邪？”" },
                    { context: "秦始皇二十六年，尽并天下，王氏、蒙氏功为多，名施於後世。" },
                    { context: "太史公曰：鄙语云“尺有所短，寸有所长”。白起料敌合变，出奇无穷，声震天下，然不能救患於应侯。王翦为秦将，夷六国，当是时，翦为宿将，始皇师之，然不能辅秦建德，固其根本，偷合取容，以至筊身。及孙王离为项羽所虏，不亦宜乎！彼各有所短也。" },
                    { context: "白起、王翦，俱善用兵。递为秦将，拔齐破荆。赵任马服，长平遂阬。楚陷李信，霸上卒行。贲、离继出，三代无名。" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "孟子荀卿列传",
                data: [
                    { context: "太史公曰：余读孟子书，至梁惠王问“何以利吾国”，未尝不废书而叹也。曰：嗟乎，利诚乱之始也！夫子罕言利者，常防其原也。故曰“放於利而行，多怨”。自天子至於庶人，好利之弊何以异哉！" },
                    { context: "荀卿嫉浊世之政，亡国乱君相属，不遂大道而营於巫祝，信禨祥，鄙儒小拘，如庄周等又猾稽乱俗，於是推儒、墨、道德之行事兴坏，序列著数万言而卒。因葬兰陵。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "孟尝君列传",
                data: [
                    { context: "这是孟尝君列传" }
                ]
            }, {
                title: "平原君虞卿列传",
                data: [
                    { context: "这是平原君虞卿列传" }
                ]
            }, {
                title: "魏公子列传",
                data: [
                    { context: "太史公曰：吾过大梁之墟，求问其所谓夷门。夷门者，城之东门也。天下诸公子亦有喜士者矣，然信陵君之接岩穴隐者，不耻下交，有以也。名冠诸侯，不虚耳。高祖每过之而令民奉祠不绝也。" },
                    { context: "信陵下士，邻国相倾。以公子故，不敢加兵。颇知硃亥，尽礼侯嬴。遂卻晋鄙，终辞赵城。毛、薛见重，万古希声。" },
                    { context: "" },
                ]
            }, {
                title: "春申君列传",
                data: [
                    { context: "这是春申君列传" }
                ]
            }, {
                title: "范睢蔡泽列传",
                data: [
                    { context: "这是范睢蔡泽列传" }
                ]
            }, {
                title: "乐毅列传",
                data: [
                    { context: "这是乐毅列传" }
                ]
            }, {
                title: "廉颇蔺相如列传",
                data: [
                    { context: "李牧至，如故约。匈奴数岁无所得。终以为怯。边士日得赏赐而不用，皆原一战。於是乃具选车得千三百乘，选骑得万三千匹，百金之士五万人，彀者十万人，悉勒习战。大纵畜牧，人民满野。匈奴小入，详北不胜，以数千人委之。单于闻之，大率众来入。李牧多为奇陈，张左右翼击之，大破杀匈奴十馀万骑。灭襜褴，破东胡，降林胡，单于奔走。其後十馀岁，匈奴不敢近赵边城。" },
                    { context: "太史公曰：知死必勇，非死者难也，处死者难。方蔺相如引璧睨柱，及叱秦王左右，势不过诛，然士或怯懦而不敢发。相如一奋其气，威信敌国，退而让颇，名重太山，其处智勇，可谓兼之矣！" },
                    { context: "清梠凛凛，壮气熊熊。各竭诚义，递为雌雄。和璧聘返，渑池好通。负荆知惧，屈节推工。安边定策，颇、牧之功。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "田单列传",
                data: [
                    { context: "这是田单列传" }
                ]
            }, {
                title: "鲁仲连邹阳列传",
                data: [
                    { context: "这是鲁仲连邹阳列传" }
                ]
            }, {
                title: "屈原贾生列传",
                data: [
                    { context: "这是屈原贾生列传" }
                ]
            }, {
                title: "吕不韦列传",
                data: [
                    { context: "吾闻之，以色事人者，色衰而爱弛。今夫人事太子，甚爱而无子，不以此时蚤自结於诸子中贤孝者，举立以为適而子之，夫在则重尊，夫百岁之後，所子者为王，终不失势，此所谓一言而万世之利也。不以繁华时树本，即色衰爱弛後，虽欲开一语，尚可得乎？今子楚贤，而自知中男也，次不得为適，其母又不得幸，自附夫人，夫人诚以此时拔以为適，夫人则竟世有宠於秦矣。" },
                    { context: "吕不韦以秦之彊，羞不如，亦招致士，厚遇之，至食客三千人。是时诸侯多辩士，如荀卿之徒，著书布天下。吕不韦乃使其客人人著所闻，集论以为八览、六论、十二纪，二十馀万言。以为备天地万物古今之事，号曰吕氏春秋。布咸阳市门，悬千金其上，延诸侯游士宾客有能增损一字者予千金。" },
                    { context: "不韦钓奇，委质子楚。华阳立嗣，邯郸献女。及封河南，乃号仲父。徙蜀惩谤，悬金作语。筹策既成，富贵斯取。" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "刺客列传",
                data: [
                    { context: "这是刺客列传" }
                ]
            }, {
                title: "李斯列传",
                data: [
                    { context: "人之贤不肖譬如鼠矣，在所自处耳！" },
                    { context: "秦王乃拜斯为长史，听其计，阴遣谋士赍持金玉以游说诸侯。诸侯名士可下以财者，厚遗结之；不肯者，利剑刺之。离其君臣之计，秦王乃使其良将随其後。秦王拜斯为客卿。" },
                    { context: "谏逐客书" },
                    { context: "古者天下散乱，莫能相一，是以诸侯并作，语皆道古以害今，饰虚言以乱实，人善其所私学，以非上所建立。今陛下并有天下，别白黑而定一尊；而私学乃相与非法教之制，闻令下，即各以其私学议之，入则心非，出则巷议，非主以为名，异趣以为高，率群下以造谤。如此不禁，则主势降乎上，党与成乎下。禁之便。臣请诸有文学诗书百家语者，蠲除去之。令到满三十日弗去，黥为城旦。所不去者，医药卜筮种树之书。若有欲学者，以吏为师。”始皇可其议，收去诗书百家之语以愚百姓，使天下无以古非今。明法度，定律令，皆以始皇起。同文书。治离宫别馆，周遍天下。明年，又巡狩，外攘四夷，斯皆有力焉。" },
                    { context: "" },
                    { context: "嗟乎，悲夫！不道之君，何可为计哉！昔者桀杀关龙逢，纣杀王子比干，吴王夫差杀伍子胥。此三臣者，岂不忠哉，然而不免於死，身死而所忠者非也。今吾智不及三子，而二世之无道过於桀、纣、夫差，吾以忠死，宜矣。且二世之治岂不乱哉！日者夷其兄弟而自立也，杀忠臣而贵贱人，作为阿房之宫，赋敛天下。吾非不谏也，而不吾听也。凡古圣王，饮食有节，车器有数，宫室有度，出令造事，加费而无益於民利者禁，故能长久治安。今行逆於昆弟，不顾其咎；侵杀忠臣，不思其殃；大为宫室，厚赋天下，不爱其费：三者已行，天下不听。今反者已有天下之半矣，而心尚未寤也，而以赵高为佐，吾必见寇至咸阳，麋鹿游於朝也。" },
                    { context: "吾欲与若复牵黄犬俱出上蔡东门逐狡兔，岂可得乎！" },
                    { context: "太史公曰：李斯以闾阎历诸侯，入事秦，因以瑕衅，以辅始皇，卒成帝业，斯为三公，可谓尊用矣。斯知六之归，不务明政以补主上之缺，持爵禄之重，阿顺苟合，严威酷刑，听高邪说，废適立庶。诸侯已畔，斯乃欲谏争，不亦末乎！人皆以斯极忠而被五刑死，察其本，乃与俗议之异。不然，斯之功且与周、召列矣。" },
                    { context: "鼠在所居，人固择地。斯效智力，功立名遂。置酒咸阳，人臣极位。一夫诳惑，变易神器。国丧身诛，本同末异。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },

                ]
            }, {
                title: "蒙恬列传",
                data: [
                    { context: "始皇甚尊宠蒙氏，信任贤之。而亲近蒙毅，位至上卿，出则参乘，入则御前。恬任外事而毅常为内谋，名为忠信，故虽诸将相莫敢与之争焉。" },
                    { context: "臣闻故赵王迁杀其良臣李牧而用颜聚，燕王喜阴用荆轲之谋而倍秦之约，齐王建杀其故世忠臣而用后胜之议。此三君者，皆各以变古者失其国而殃及其身。今蒙氏，秦之大臣谋士也，而主欲一旦弃去之，臣窃以为不可。臣闻轻虑者不可以治国，独智者不可以存君。诛杀忠臣而立无节行之人，是内使群臣不相信而外使斗士之意离也，臣窃以为不可。" },
                    { context: "昔者秦穆公杀三良而死，罪百里奚而非其罪也，故立号曰‘缪’。昭襄王杀武安君白起。楚平王杀伍奢。吴王夫差杀伍子胥。此四君者，皆为大失，而天下非之，以其君为不明，以是籍於诸侯。故曰‘用道治者不杀无罪，而罚不加於无辜’。唯大夫留心！" },
                    { context: "蒙恬喟然太息曰：“我何罪於天，无过而死乎？”良久，徐曰：“恬罪固当死矣。起临洮属之辽东，城巉万馀里，此其中不能无绝地脉哉？此乃恬之罪也。”乃吞药自杀。" },
                    { context: "太史公曰：吾適北边，自直道归，行观蒙恬所为秦筑长城亭障，堑山堙谷，通直道，固轻百姓力矣。夫秦之初灭诸侯，天下之心未定，痍伤者未瘳，而恬为名将，不以此时彊谏，振百姓之急，养老存孤，务修众庶之和，而阿意兴功，此其兄弟遇诛，不亦宜乎！何乃罪地脉哉？" },
                    { context: "蒙氏秦将，内史忠贤。长城首筑，万里安边。赵高矫制，扶苏死焉。绝地何罪？劳人是。呼天欲诉，三代良然。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "张耳陈馀列传",
                data: [
                    { context: "这是张耳陈馀列传" }
                ]
            }, {
                title: "魏豹彭越列传",
                data: [
                    { context: "这是魏豹彭越列传" }
                ]
            }, {
                title: "黥布列传",
                data: [
                    { context: "这是黥布列传" }
                ]
            }, {
                title: "淮阴侯列传",
                data: [
                    { context: "大丈夫不能自食，吾哀王孙而进食，岂望报乎！" },
                    { context: "诸将易得耳。至如信者，国士无双。王必欲长王汉中，无所事信；必欲争天下，非信无所与计事者。顾王策安所决耳。" },
                    { context: "今大王诚能反其道：任天下武勇，何所不诛！以天下城邑封功臣，何所不服！以义兵从思东归之士，何所不散！" },
                    { context: "兵法不曰‘陷之死地而後生，置之亡地而後存’？且信非得素拊循士大夫也，此所谓‘驱市人而战之’，其势非置之死地，使人人自为战；今予之生地，皆走，宁尚可得而用之乎！" },
                    { context: "信问广武君曰：“仆欲北攻燕，东伐齐，何若而有功？”广武君辞谢曰：“臣闻败军之将，不可以言勇，亡国之大夫，不可以图存。今臣败亡之虏，何足以权大事乎！”信曰：“仆闻之，百里奚居虞而虞亡，在秦而秦霸，非愚於虞而智於秦也，用与不用，听与不听也。诚令成安君听足下计，若信者亦已为禽矣。以不用足下，故信得侍耳。”因固问曰：“仆委心归计，原足下勿辞。”广武君曰：“臣闻智者千虑，必有一失；愚者千虑，必有一得。故曰‘狂夫之言，圣人择焉’。" },
                    { context: "故善用兵者不以短击长，而以长击短。" },
                    { context: "贵贱在於骨法，忧喜在於容色，成败在於决断，以此参之，万不失一。" },
                    { context: "相君之面，不过封侯，又危不安。相君之背，贵乃不可言。" },
                    { context: "汉王遇我甚厚，载我以其车，衣我以其衣，食我以其食。吾闻之，乘人之车者载人之患，衣人之衣者怀人之忧，食人之食者死人之事，吾岂可以乡利倍义乎！" },
                    { context: "患生於多欲而人心难测也。今足下欲行忠信以交於汉王，必不能固於二君之相与也，而事多大於张黡、陈泽。故臣以为足下必汉王之不危己，亦误矣。大夫种、范蠡存亡越，霸句践，立功成名而身死亡。野兽已尽而猎狗烹。夫以交友言之，则不如张耳之与成安君者也；以忠信言之，则不过大夫种、范蠡之於句践也。此二人者，足以观矣。原足下深虑之。且臣闻勇略震主者身危，而功盖天下者不赏。" },
                    { context: "後数日，蒯通复说曰：“夫听者事之候也，计者事之机也，听过计失而能久安者，鲜矣。听不失一二者，不可乱以言；计不失本末者，不可纷以辞。夫随厮养之役者，失万乘之权；守儋石之禄者，阙卿相之位。故知者决之断也，疑者事之害也，审豪氂之小计，遗天下之大数，智诚知之，决弗敢行者，百事之祸也。故曰‘猛虎之犹豫，不若蜂虿之致螫；骐骥之跼躅，不如驽马之安步；孟贲之狐疑，不如庸夫之必至也；虽有舜禹之智，吟而不言，不如瘖聋之指麾也’。此言贵能行之。夫功者难成而易败，时者难得而易失也。时乎时，不再来。原足下详察之。”" },
                    { context: "果若人言，‘狡兔死，良狗亨；高鸟尽，良弓藏；敌国破，谋臣亡。’天下已定，我固当亨！" },
                    { context: "上问曰：“如我能将几何？”信曰：“陛下不过能将十万。”上曰：“於君何如？”曰：“臣多多而益善耳。”上笑曰：“多多益善，何为为我禽？”信曰：“陛下不能将兵，而善将将，此乃言之所以为陛下禽也。且陛下所谓天授，非人力也。”" },
                    { context: "吾如淮阴，淮阴人为余言，韩信虽为布衣时，其志与众异。其母死，贫无以葬，然乃行营高敞地，令其旁可置万家。余视其母冢，良然。假令韩信学道谦让，不伐己功，不矜其能，则庶几哉，於汉家勋可以比周、召、太公之徒，後世血食矣。不务出此，而天下已集，乃谋畔逆，夷灭宗族，不亦宜乎！" },
                    { context: "君臣一体，自古所难。相国深荐，策拜登坛。沈沙决水，拔帜传餐。与汉汉重，归楚楚安。三分不议，伪游可叹。" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                    { context: "" },
                ]
            }, {
                title: "韩信卢绾列传",
                data: [
                    { context: "这是韩信卢绾列传" }
                ]
            }, {
                title: "田儋列传",
                data: [
                    { context: "这是田儋列传" }
                ]
            }, {
                title: "樊郦滕灌列传",
                data: [
                    { context: "这是樊郦滕灌列传" }
                ]
            }, {
                title: "张丞相列传",
                data: [
                    { context: "这是张丞相列传" }
                ]
            }, {
                title: "郦生陆贾列传",
                data: [
                    { context: "这是郦生陆贾列传" }
                ]
            }, {
                title: "傅靳蒯成列传",
                data: [
                    { context: "这是傅靳蒯成列传" }
                ]
            }, {
                title: "刘敬叔孙通列传",
                data: [
                    { context: "这是刘敬叔孙通列传" }
                ]
            }, {
                title: "五帝本纪",
                data: [
                    { context: "这是" }
                ]
            }, {
                title: "季布栾布列传",
                data: [
                    { context: "这是季布栾布列传" }
                ]
            }, {
                title: "袁盎晁错列传",
                data: [
                    { context: "这是袁盎晁错列传" }
                ]
            }, {
                title: "张释之冯唐列传",
                data: [
                    { context: "这是张释之冯唐列传" }
                ]
            }, {
                title: "万石张叔列传",
                data: [
                    { context: "这是万石张叔列传" }
                ]
            }, {
                title: "田叔列传",
                data: [
                    { context: "这是田叔列传" }
                ]
            }, {
                title: "扁鹊仓公列传",
                data: [
                    { context: "这是扁鹊仓公列传" }
                ]
            }, {
                title: "吴王濞列传",
                data: [
                    { context: "这是吴王濞列传" }
                ]
            }, {
                title: "魏其武安侯列传",
                data: [
                    { context: "这是魏其武安侯列传" }
                ]
            }, {
                title: "韩长孺列传",
                data: [
                    { context: "这是韩长孺列传" }
                ]
            }, {
                title: "李将军列传",
                data: [
                    { context: "这是李将军列传" }
                ]
            }, {
                title: "匈奴列传",
                data: [
                    { context: "这是匈奴列传" }
                ]
            }, {
                title: "卫将军骠骑列传",
                data: [
                    { context: "这是卫将军骠骑列传" }
                ]
            }, {
                title: "平津侯主父列传",
                data: [
                    { context: "这是平津侯主父列传" }
                ]
            }, {
                title: "南越列传",
                data: [
                    { context: "这是南越列传" }
                ]
            }, {
                title: "东越列传",
                data: [
                    { context: "这是东越列传" }
                ]
            }, {
                title: "朝鲜列传",
                data: [
                    { context: "这是朝鲜列传" }
                ]
            }, {
                title: "西南夷列传",
                data: [
                    { context: "这是西南夷列传" }
                ]
            }, {
                title: "司马相如列传",
                data: [
                    { context: "这是司马相如列传" }
                ]
            }, {
                title: "淮南衡山列传",
                data: [
                    { context: "这是淮南衡山列传" }
                ]
            }, {
                title: "循吏列传",
                data: [
                    { context: "这是循吏列传" }
                ]
            }, {
                title: "汲郑列传",
                data: [
                    { context: "这是汲郑列传" }
                ]
            }, {
                title: "儒林列传",
                data: [
                    { context: "这是儒林列传" }
                ]
            }, {
                title: "酷吏列传",
                data: [
                    { context: "这是酷吏列传" }
                ]
            }, {
                title: "大宛列传",
                data: [
                    { context: "这是大宛列传" }
                ]
            }, {
                title: "游侠列传",
                data: [
                    { context: "这是游侠列传" }
                ]
            }, {
                title: "佞幸列传",
                data: [
                    { context: "这是佞幸列传" }
                ]
            }, {
                title: "滑稽列传",
                data: [
                    { context: "这是滑稽列传" }
                ]
            }, {
                title: "日者列传",
                data: [
                    { context: "这是日者列传" }
                ]
            }, {
                title: "龟策列传",
                data: [
                    { context: "这是龟策列传" }
                ]
            }, {
                title: "货殖列传",
                data: [
                    { context: "这是货殖列传" }
                ]
            }, {
                title: "太史公自序",
                data: [
                    { context: "这是太史公自序" }
                ]
            },
        ]
    }]
}
data = [demo]
