var demo01 = {
    title: "资治通鉴",
    name: "资治通鉴",
    data: [{
        title: "周纪·周纪一",
        data: [
            { context: "智伯之亡也，才胜德也。夫才与德异，而世俗莫之能辨，通谓之贤，此其所以失人也。夫聪察强毅之谓才，正直中和之谓德。才者，德之资也；德者，才之帅也。云梦之竹，天下之劲也，然而不矫揉，不羽括，则不能以入坚；棠溪之金，天下之利也，然而不熔范，不砥砺，则不能以击强。是故才德全尽谓之圣人，才德兼亡谓之愚人，德胜才谓之君子，才胜德谓之小人。凡取人之术，苟不得圣人、君子而与之，与其得小人，不若得愚人。何则？君子挟才以为善，小人挟才以为恶。挟才以为善者，善无不至矣；挟才以为恶者，恶亦无不至矣。愚者虽欲为不善，智不能周，力不能胜，譬之乳狗搏人，人得而制之。小人智足以遂其奸，勇足以决其暴，是虎而翼者也，其为害岂不多哉！夫德者人之所严，而才者人之所爱。爱者易亲，严者易疏，是以察者多蔽于才而遗于德。自古昔以来，国之乱臣，家之败子，才有馀而德不足，以至于颠覆者多矣，岂特智伯哉！故为国为家者，苟能审于才德之分而知所先后，又何失人之足患哉！ " },
            { context: "子击出，遭田子方于道，下车伏谒。子方不为礼。子击怒，谓子方曰：“富贵者骄人乎？贫贱者骄人乎？”子方曰：“亦贫贱者骄人耳，富贵者安敢骄人？国君而骄人则失其国，大夫而骄人则失其家。失其国者未闻有以国待之者也，失其家者未闻有以家待之者也。夫士贫贱者，言不用，行不合，则纳履而去耳，安往而不得贫贱哉！”子击乃谢之。" },
            { context: "文侯谓李克曰：“先生尝有言曰：‘家贫思良妻，国乱思良相。’今所置非成则璜，二子何如？”对曰：“卑不谋尊，疏不谋戚。臣在阙门之外，不敢当命。”文侯曰：“先生临事勿让。”克曰：“君弗察故也。居视其所亲，富视其所与，达视其所举，穷视其所不为，贫视其所不取，五者足以定之矣，何待克哉！”文侯曰：“先生就舍，吾之相定矣。”李克出，见翟璜。翟璜曰：“今者闻君召先生而卜相，果谁为之？”克曰：“魏成。”翟璜忿然作色曰：“西河守吴起，臣所进也；君内以鄴为忧，臣进西门豹；君欲伐中山，臣进乐羊；中山已拔，无使守之，臣进先生；君之子无傅，臣进屈侯鲋。以耳目之所睹记，臣何负于魏成？”李克曰：“子之言克于子之君者，岂将比周以求大官哉？君问相于克，克之对如是。所以知君之必相魏成者，魏成食禄千钟，什九在外，什一在内，是以东得卜子夏、田子方、段干木。此三人者，君皆师之；子所进五人者，君皆臣之。子恶得与魏成比也！”翟璜逡巡再拜曰：“璜，鄙人也，失对，愿卒为弟子。”" },
            { context: "在德不在险。若君不修德，舟中之人皆敌国也。 " },
            { context: " " },
        ]
    },{
        title: "周纪·周纪二",
        data: [
            { context: " 卫鞅言于秦孝公曰：“夫民不可与虑始，而可与乐成。论至德者不和于俗，成大功者不谋于众。是以圣人苟可以强国，不法其故。”甘龙曰：“不然。缘法而治者，吏习而民安之。”卫鞅曰：“常人安于故俗，学者溺于所闻，以此两者，居官守法可也，非所与论于法之外也。智者作法，愚者制焉；贤者更礼，不肖者拘焉。”" },
            { context: "夫信者，人君之大宝也。国保于民，民保于信。非信无以使民，非民无以守国。是故古之王者不欺四海，霸者不欺四邻，善为国者不欺其民，善为家者不欺其亲。不善者反之：欺其邻国，欺其百姓，甚者欺其兄弟，欺其父子。上不信下，下不信上，上下离心，以至于败。所利不能药其所伤，所获不能补其所亡，岂不哀哉！昔齐桓公不背曹沫之盟，晋文公不贪伐原之利，魏文侯不弃虞人之期，秦孝公不废徙木之赏。此四君者，道非粹白，而商君尤称刻薄，又处战攻之世，天下趋于诈力，犹且不敢忘信以畜其民，况为四海治平之政者哉！" },
            { context: "惠王曰：“齐亦有宝乎？”威王曰：“无有。”惠王曰：“寡人国虽小，尚有径寸之珠，照车前后各十二乘者十枚。岂以齐大国而无宝乎？”威王曰：“寡人之所以为宝者与王异。吾臣有檀子者，使守南城，则楚人不敢为寇，泗上十二诸侯皆来朝；吾臣有盼子者，使守高唐，则赵人不敢东渔于河；吾吏有黔夫者，使守徐州，则燕人祭北门，赵人祭西门，徙而从者七千馀家；吾臣有种首者，使备盗贼，则道不拾遗。此四臣者，将照千里，岂特十二乘哉！”" },
            { context: "楚昭奚恤为相。江乙言于楚王曰：“人有爱其狗者，狗尝溺井，其邻人见，欲入言之，狗当门而噬之。今昭奚恤常恶臣之见，亦犹是也。且人有好扬人之善者，王曰：‘此君子也，’近之；好扬人之恶者，王曰：‘此小人也，’远之。然则且有子弑其父、臣弑其主者，而王终己不知也。何者？以王好闻人之美而恶闻人之恶也。”王曰：“善！寡人愿两闻之。” " },
            { context: "千人之诺诺，不如一士之谔谔。仆请终烧正言而无诛，可乎？”商君曰“诺。”赵良曰：“五羖大夫，荆之鄙人也，穆公举之牛口之下，而加之百姓之上，秦国莫敢望焉。相秦六七年而东伐郑，三置晋君，一救荆祸。其为相也，劳不坐乘，暑不张盖。行于国中，不从车乘，不操干戈。五羖大夫死，秦国男女流涕，童子不歌谣，舂者不相杵。今君之见也，因嬖人景监以为主；其从政也，凌轹公族，残伤百姓。公子虔杜门不出已八年矣。君又杀祝欢而黥公孙贾。《诗》曰：‘得人者兴，失人者崩。’此数者，非所以得人也。君之出也，后车载甲，多力而骈胁者为骖乘，持矛而操闟戟者旁车而趋。此一物不具，君固不出。《书》曰：‘恃德者昌，恃力者亡。’此数者，非恃德也。君之危若朝露，而尚贪商於之富，宠秦国之政，畜百姓之怨。秦王一旦捐宾客而不立朝，秦国之所以收君者岂其微哉！" },
            { context: "王曰：“叟，不远千里而来，亦有以利吾国乎？”孟子曰：“君何必曰利，仁义而已矣！君曰何以利吾国，大夫曰何以利吾家，士庶人曰何以利吾身，上下交征利而国危矣。未有仁而遗其亲者也，未有义而后其君者也。”" },
            { context: "初，孟子师子思，尝问牧民之道何先。子思曰：“先利之。”孟子曰：“君子所以教民，亦仁义而已矣，何必利？”子思曰：“仁义固所以利之也。上不仁则下不得其所，上不义则下乐为诈也。此为不利大矣。故《易》曰：‘利者，义之和也。’又曰：‘利用安身，以崇德也。’此皆利之大者也。”" },
            { context: "臣光曰：子思、孟子之言，一也。夫唯仁者为知仁义之利，不仁者不知也。故孟子对梁王直以仁义而不及利者，所与言之人异故也。 " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    },{
        title: "周纪·周纪三",
        data: [
            { context: " 《孟子》论之曰：或谓：“张仪、公孙衍，岂不大丈夫哉！一怒而诸侯惧，安居而天下熄。”孟子曰：“是恶足以为大丈夫哉？君子立天下之正位，行天下之正道，得志则与民由之，不得志则独行其道，富贵不能淫，贫贱不能移，威武不能诎，是之谓大丈夫。”" },
            { context: "与肥义谋胡服骑射以教百姓，曰：“愚者所笑，贤者察焉。虽驱世以笑我，胡地、中山，吾必有之！”遂胡服。国人皆不欲，公子成称疾不朝。王使人请之曰：“家听于亲，国听于君。今寡人作教易服而公叔不服，吾恐天下议之也。制国有常，利民为本；从政有经，令行为上。明德先论于贱，而从政先信于贵，故愿慕公叔之义以成胡服之功也。”公子成再拜稽首曰：“臣闻中国者，圣贤之所教也，礼乐之所用也，远方之所观赴也，蛮夷之所则效也。今王舍此而袭远方之服，变古之道，逆人之心，臣愿王熟图之也！”使者以报。王自往请之，曰：“吾国东有齐、中山，北有燕、东胡，西有楼烦、秦、韩之边。今无骑射之备，则何以守之哉？先时中山负齐之强兵，侵暴吾地，系累吾民，引水围鄗；微社稷之神灵，则鄗几于不守也，先君丑之。故寡人变服骑射，欲以备四境之难，报中山之怨。而叔顺中国之俗，恶变服之名，以忘鄗事之丑，非寡人之所望也。”公子成听命，乃赐胡服，明日服而朝。于是始出胡服令，而招骑射焉。" },
            { context: " " },
        ]
    },{
        title: "周纪·周纪四",
        data: [
            { context: "　臣光曰：甚哉秦之无道也，杀其父而劫其子；楚之不竞也，忍其父而婚其仇！呜呼！楚之君诚得其道，臣诚得其人，秦虽强，乌得陵之哉！善乎荀卿论之曰：“夫道，善用之则百里之地可以独立，不善用之则楚六千里而为仇人役。”故人主不务得道而广有其势，是其所以危也。 " },
            { context: "荀子论之曰：国者，天下之利势也。得道以持之，则大安也，大荣也，积美之源也。不得道以持之，则大危也，大累也，有之不如无之。及其綦也，索为匹夫，不可得也。齐湣、宋献是也。故用国者义立而王，信立而霸，权谋立而亡。 " },
            { context: "德虽未至也，义虽未济也，然而天下之理略奏矣，刑赏已诺信乎天下矣，臣下晓然皆知其可要也。政令已陈，虽睹利败，不欺其民；约结已定，虽睹利败，不欺其与。如是，则兵劲城固，敌国畏之；国一綦明，与国信之。虽在僻陋之国，威动天下，五伯是也。是所谓信立而而霸也。 " },
            { context: "挈国以呼功利，不务张其义，齐其信，唯利之求；内则不惮诈其民而求小利焉，外则不惮诈其与而求大利焉。内不修正其所以有，然常欲人之有，如是，则臣下百姓莫不以诈心待其上矣。上诈其下，下诈其上，则是上下析也。如是，则敌国轻之，与国疑之，权谋日行而国不免危削，綦之而亡，齐湣、薛公是也。故用强齐，非以修礼义也，非以本政教也，非以一天下也，绵绵常以结引驰外为务。故强，南足以破楚，西足以诎秦，北足以败燕，中足以举宋。及以燕、赵起而攻之，若振槁然，而身死国亡，为天下大戮，后世言恶则必稽焉。是无他故焉，唯其不由礼义而由权谋也。 " },
            { context: "三者，明主之所谨择也，仁人之所务白也。善择者制人，不善择者人制之。 " },
            { context: "荀子论之曰：成侯、嗣君，聚敛计数之君也，未及取民也。子产，取民者也，未及为政也。管仲，为政者也，未及修礼也。故修礼者王，为政者强，取民者安，聚敛者亡。 " },
            { context: "《诗》曰：‘靡不有初，鲜克有终。’《易》曰：‘狐涉水，濡其尾。’此言始之易，终之难也。 " },
            { context: " " },
        ]
    },{
        title: "周纪·周纪五",
        data: [
            { context: " 木实繁者披其枝，披其枝者伤其心；大其都者危其国，尊其臣者卑其主。淖齿管齐，射王股，擢王筋，悬之于庙梁，宿昔而死。李兑管赵，囚主父于沙丘，百日而饿死。" },
            { context: "穰侯援立昭王，除其灾害，荐白起为将，南取鄢、郢，东属地于齐，使天下诸侯稽首而事秦。秦益强大者，穰侯之功也。虽其专恣骄贪足以贾祸，亦未至尽如范雎之言。若雎者，亦非能为秦忠谋，直欲得穰侯之处，故搤其吭而夺之耳。遂使秦王绝母子之义，失舅甥之恩。要之，雎真倾危之士哉！ " },
            { context: " " },
        ]
    },{
        title: "秦纪·秦纪一",
        data: [
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    },{
        title: "秦纪·秦纪二",
        data: [
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    },{
        title: "秦纪·秦纪三",
        data: [
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    }]
}
data = [demo01]