var demo01 = {
    title: "资治通鉴",
    name: "资治通鉴",
    data: [{
        title: "周纪·周纪一",
        data: [
            { context: "智伯之亡也，才胜德也。夫才与德异，而世俗莫之能辨，通谓之贤，此其所以失人也。夫聪察强毅之谓才，正直中和之谓德。才者，德之资也；德者，才之帅也。云梦之竹，天下之劲也，然而不矫揉，不羽括，则不能以入坚；棠溪之金，天下之利也，然而不熔范，不砥砺，则不能以击强。是故才德全尽谓之圣人，才德兼亡谓之愚人，德胜才谓之君子，才胜德谓之小人。凡取人之术，苟不得圣人、君子而与之，与其得小人，不若得愚人。何则？君子挟才以为善，小人挟才以为恶。挟才以为善者，善无不至矣；挟才以为恶者，恶亦无不至矣。愚者虽欲为不善，智不能周，力不能胜，譬之乳狗搏人，人得而制之。小人智足以遂其奸，勇足以决其暴，是虎而翼者也，其为害岂不多哉！夫德者人之所严，而才者人之所爱。爱者易亲，严者易疏，是以察者多蔽于才而遗于德。自古昔以来，国之乱臣，家之败子，才有馀而德不足，以至于颠覆者多矣，岂特智伯哉！故为国为家者，苟能审于才德之分而知所先后，又何失人之足患哉！ " },
            { context: "子击出，遭田子方于道，下车伏谒。子方不为礼。子击怒，谓子方曰：“富贵者骄人乎？贫贱者骄人乎？”子方曰：“亦贫贱者骄人耳，富贵者安敢骄人？国君而骄人则失其国，大夫而骄人则失其家。失其国者未闻有以国待之者也，失其家者未闻有以家待之者也。夫士贫贱者，言不用，行不合，则纳履而去耳，安往而不得贫贱哉！”子击乃谢之。" },
            { context: "文侯谓李克曰：“先生尝有言曰：‘家贫思良妻，国乱思良相。’今所置非成则璜，二子何如？”对曰：“卑不谋尊，疏不谋戚。臣在阙门之外，不敢当命。”文侯曰：“先生临事勿让。”克曰：“君弗察故也。居视其所亲，富视其所与，达视其所举，穷视其所不为，贫视其所不取，五者足以定之矣，何待克哉！”文侯曰：“先生就舍，吾之相定矣。”李克出，见翟璜。翟璜曰：“今者闻君召先生而卜相，果谁为之？”克曰：“魏成。”翟璜忿然作色曰：“西河守吴起，臣所进也；君内以鄴为忧，臣进西门豹；君欲伐中山，臣进乐羊；中山已拔，无使守之，臣进先生；君之子无傅，臣进屈侯鲋。以耳目之所睹记，臣何负于魏成？”李克曰：“子之言克于子之君者，岂将比周以求大官哉？君问相于克，克之对如是。所以知君之必相魏成者，魏成食禄千钟，什九在外，什一在内，是以东得卜子夏、田子方、段干木。此三人者，君皆师之；子所进五人者，君皆臣之。子恶得与魏成比也！”翟璜逡巡再拜曰：“璜，鄙人也，失对，愿卒为弟子。”" },
            { context: "在德不在险。若君不修德，舟中之人皆敌国也。 " },
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },{
        title: "周纪·周纪一",
        data: [
            { context: " " },
        ]
    },]
}
data = [demo01]