//左传
var demo = {
    title: "左传-左丘明",
    name: "左传",
    data: [{
        title: "【隐公十一年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【桓公十八年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【庄公三十二年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【闵公二年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【僖公三十三年】 [召陵之师]",
        data: [
            { context: "传：齐侯以诸侯之师侵蔡。蔡溃。遂伐楚。楚子使与师言曰：“君处北海，寡人处南海，唯是风马牛不相及也。不虞君之涉吾地也，何故？”管仲对曰：“昔召康公命我先君大公曰：‘五侯九伯，女实征之，以夹辅周室。’赐我先君履，东至于海，西至于河，南至于穆陵，北至于无棣。尔贡包茅不入，王祭不共，无以缩酒，寡人是征。昭王南征而不复，寡人是问。”对曰：“贡之不入，寡君之罪也，敢不共给。昭王之不复，君其问诸水滨。”师进，次于陉。夏，楚子使屈完如师。师退，次于召陵。齐侯陈诸侯之师，与屈完乘而观之。齐侯曰：“岂不谷是为？先君之好是继。与不谷同好，如何？”对曰：“君惠徼福于敝邑之社稷，辱收寡君，寡君之愿也。”齐侯曰：“以此众战，谁能御之？以此攻城，何城不克？”对曰：“君若以德绥诸侯，谁敢不服？君若以力，楚国方城以为城，汉水以为池，虽众，无所用之。”屈完及诸侯盟。陈辕涛涂谓郑申侯曰：“师出于陈、郑之间，国必甚病。若出于东方，观兵于东夷，循海而归，其可也。”申侯曰：“善。”涛涂以告，齐侯许之。申侯见，曰：“师老矣，若出于东方而遇敌，惧不可用也。若出于陈、郑之间，共其资粮扉屦，其可也。”齐侯说，与之虎牢。执辕涛涂。秋，伐陈，讨不忠也。许穆公卒于师，葬之以侯，礼也。凡诸侯薨于朝会，加一等；死王事，加二等。于是有以衮敛。冬，叔孙戴伯帅师，会诸侯之师侵陈。陈成，归辕涛涂。齐侯以诸侯之师侵蔡。蔡溃。遂伐楚。楚子使与师言曰：“君处北海，寡人处南海，唯是风马牛不相及也。不虞君之涉吾地也，何故？”管仲对曰：“昔召康公命我先君大公曰：‘五侯九伯，女实征之，以夹辅周室。’赐我先君履，东至于海，西至于河，南至于穆陵，北至于无棣。尔贡包茅不入，王祭不共，无以缩酒，寡人是征。昭王南征而不复，寡人是问。”对曰：“贡之不入，寡君之罪也，敢不共给。昭王之不复，君其问诸水滨。”师进，次于陉。夏，楚子使屈完如师。师退，次于召陵。齐侯陈诸侯之师，与屈完乘而观之。齐侯曰：“岂不谷是为？先君之好是继。与不谷同好，如何？”对曰：“君惠徼福于敝邑之社稷，辱收寡君，寡君之愿也。”齐侯曰：“以此众战，谁能御之？以此攻城，何城不克？”对曰：“君若以德绥诸侯，谁敢不服？君若以力，楚国方城以为城，汉水以为池，虽众，无所用之。”屈完及诸侯盟。陈辕涛涂谓郑申侯曰：“师出于陈、郑之间，国必甚病。若出于东方，观兵于东夷，循海而归，其可也。”申侯曰：“善。”涛涂以告，齐侯许之。申侯见，曰：“师老矣，若出于东方而遇敌，惧不可用也。若出于陈、郑之间，共其资粮扉屦，其可也。”齐侯说，与之虎牢。执辕涛涂。秋，伐陈，讨不忠也。许穆公卒于师，葬之以侯，礼也。凡诸侯薨于朝会，加一等；死王事，加二等。于是有以衮敛。冬，叔孙戴伯帅师，会诸侯之师侵陈。陈成，归辕涛涂。[僖公四年 召陵之师]" },
            { context: "传：夏，会于葵丘，寻盟，且修好，礼也。王使宰孔赐齐侯胙，曰：“天子有事于文武，使孔赐伯舅胙。”齐侯将下拜。孔曰：“且有后命。天子使孔曰：‘以伯舅耋老，加劳，赐一级，无下拜’”。对曰：“天威不违颜咫尺，小白余敢贪天子之命无下拜？恐陨越于下，以遗天子羞。敢不下拜？”下，拜；登，受。秋，齐侯盟诸侯于葵丘，曰：“凡我同盟之人，既盟之后，言归于好。”宰孔先归，遇晋侯曰：“可无会也。齐侯不务德而勤远略，故北伐山戎，南伐楚，西为此会也。东略之不知，西则否矣。其在乱乎。君务靖乱，无勤于行。”晋侯乃还。齐侯以诸侯之师伐晋，及高梁而还，讨晋乱也。[僖公九年 葵丘之盟]" },
            { context: "夏，宋公使邾文公用鄫子于次睢之社，欲以属东夷。司马子鱼曰：“古者六畜不相为用，小事不用大牲，而况敢用人乎？祭祀以为人也。民，神之主也。用人，其谁飨之？齐桓公存三亡国以属诸侯，义士犹曰薄德。今一会而虐二国之君，又用诸淫昏之鬼，将以求霸，不亦难乎？得死为幸！”陈穆公请修好于诸侯，以无忘齐桓之德。冬，盟于齐，修桓公之好也。[僖公十九年 齐桓公五霸之首]" },
            { context: "臣妾之本意为奴婢 -- 鲁僖公十七年" },
            { context: "鲁僖公二十八年，晋文公 践土之盟[班次为 晋鲁卫蔡郑齐宋莒(ju三声) 注姬之同姓为先齐宋虽大异姓在后 周之宗盟，异姓为后]。" },
            { context: "君子谓(晋)文公：“其能刑矣，三罪而民服。诗云‘惠此中国，以绥四方’,不失赏、刑之谓也”[僖公二十八年]" },
        ]

    }, {
        title: "【文公十八年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【宣公十八年】",
        data: [
            { context: "楚王问鼎：楚子伐陆浑之戎，遂至于洛，观兵于周疆。定王使王孙满劳楚子。楚子问鼎之大小轻重焉。对曰：“在德不在鼎。昔夏之方有德也，远方图物，贡金九牧，铸鼎象物，百物而为之备，使民知神、奸。故民入川泽山林，不逢不若。螭魅罔两，莫能逢之，用能协于上下以承天休。桀有昏德，鼎迁于商，载祀六百。商纣暴虐，鼎迁于周。德之休明，虽小，重也。其建回昏乱，虽大，轻也。天祚明德，有所底止。成王定鼎于郏鄏，卜世三十，卜年七百，天所命也。周德虽衰，天命未改，鼎之轻重，未可问也。”[宣公三年 楚王问鼎]" },
        ]
    }, {
        title: "【成公十八年】",
        data: [
            { context: "唯器与名，不可以假人，君之司也，名以出信；信以守器，器以至礼，礼以行义，义以生利，利以平民，政之大节也 [成公二年 鞌(an一声)之战]" }
        ]
    }, {
        title: "【襄公三十一年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【昭公三十二年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【定公十五年】",
        data: [
            { context: "" },
        ]
    }, {
        title: "【哀公二十七年】",
        data: [
            { context: "夏四月，乙丑[十一]，孔丘卒。[春秋经止于此。孔丘生年，左传无文，公羊毂梁传生于鲁襄公二十一年。孔子世家生于二十二年。前说终年七十三。后说七十二。一岁之差。千年未定]【哀公十六年】" },
            { context: "我卜伐郑，不卜敌齐【哀公二十七年 智伯[晋]言】" }
        ]
    }, {
        title: "一曲肝肠断",
        data: [
            { context: "一曲肝肠断，天涯何处觅知音？一曲肝肠断，轻羽此去莫留连，更有南国花正好，莫向白苹洲上独叹秋水寒。" },
            { context: "二曲肝肠断，深院梨花相谢早，五马罗堂久徘徊，油壁桐车载君去，去时盈盈红泪满红绡。" },
            { context: "三曲肝肠断，落花为雨侬为愁，秋千架上看笑靥，而今都随海棠瘦，唯自弄笛别院忆兰舟。" },
            { context: "四曲肝肠断，琵琶不语琴绝弦，鹦鹉架前说心事，垂画双立秉烛观，但得青鸟传信与香媛。" },
            { context: "五曲肝肠断，往事何堪忆从头，剪花笑谈灯影瘦，而今红螺渐蒙愁，明月华衫霓裳能记否？" },
            { context: "六曲肝肠断，欲倾心事无所藉，还自南园抚霜枝，云台黛色苍烟里，问君此去还谋定佳期？" },
        ]
    }, {
        title: "春秋左传注 --基本知识",
        data: [
            { context: "夫舞，所以行节八音而行八风, -- 八音 金(钟縛[金字旁]也)石()丝(琴，瑟)竹(管,箫)匏(笙)土(埙也)革(鼓,挑[提手换革])木(磬) ；何为八风：炎风(东北),滔风(东),薰风(东南),巨风(南),凄风(西南),飓风(西),厉风(西北),寒风(北)" },
            { context: "君子谓郑庄公“于是乎有礼，礼，经国家，定社稷，序民人，利后嗣者也。 许，无刑而伐之，服而舍之，度德而处之，量力而行之。相时而动，无累后人，可谓知礼矣”" },
            { context: "九族之亲： 杜预注（外祖父，外祖母，从母子及妻父，妻母，姑之子，姐妹之子，女子之子并己之同族，皆外亲有服而异族者）" },
            { context: "古代同姓不婚，故女子必著姓于下。迎时称王后，归时称其母家姓，盖当时书法如此" },
            { context: "君子曰：“酒以成礼，不继为淫，义也；以君成礼，弗纳于淫，仁也。”" },
            { context: "冬，杞伯姬来，归宁也[女子出嫁返回娘家问父母安曰归宁]。凡诸侯之女，归宁曰来[来者，仍将返回夫家也]，出曰来归[出者，见弃于夫家]；夫人归宁曰如某，出曰归于某" },
            { context: "凡师，有钟鼓曰伐，无曰侵，轻曰袭" },
        ]
    }]
}
data = [demo]