十三 敦煌边饰初步研究﻿

南北朝与隋唐之初的作品每一件都有力地证明我们在适应新的要求和吸取新的养料的过程中最主要的是没有失掉主动立场而能迅速发展起来，且发展得非常璨烂，智慧地运用旧基础，从没有作不加变革的模仿；一方面创造性极强，另一方面丰富而更巩固了中国原有优良的传统。﻿﻿

中国画匠怎样融会贯通各种民族杰出的各自不同的题材手法加以种种变革来发展自己，而不是亦步亦趋，一味的模仿或被任何异国情调所兼并吞没，如过去四五十年里中国工艺美术所遭受的破坏与迫害，正是我们今天应该学习而作为我们的借鉴的。﻿﻿

敦煌边饰的两个方面，一是起源于石造建筑的雕刻部分的外来花纹，主要的如忍冬叶等；一是继续自己木构上彩画的传统，﻿

敦煌边饰中还有一个第三种因素，就是它受到编织物花纹影响的方面，乃至于可说是绫锦图案的应用。﻿﻿

，敦煌图案花纹有主要的三种来源。一是伊兰系的石刻浮雕上的图案花纹，代表这种的是各种并列的忍冬叶纹。二是秦汉建筑物上的云气龙纹系统的图案，这种图案在敦煌多散见于壁画上或人字坡下木椽之间等。三是“文绣”锦文的系统，多见于画幅周沿，亦见于人物衣领上者。这三种来源基本地都是发展在建筑结构上的装饰同建筑结合在一起的。﻿

后代所常用的丰富的中国建筑彩画的主要源流都可以追溯至此。﻿﻿

敦煌图案中最引人注意的是北魏洞中四瓣侧面的忍冬草叶的图案类型，和唐卷草纹的多种变化和生动；再次则为忍冬以外手法和题材上显然为各种外来新鲜因素的渗入﻿

十二 《中国建筑彩画图案》序﻿

为书籍作序 没看过书籍 不想讨论了﻿﻿

十一 云冈石窟中所表现的北魏建筑﻿

一 洞名﻿

二 洞的平面及其建造年代﻿

西部五大洞建筑年代最早，中部偏东诸大洞次之，西部偏西诸洞又次之。中部偏西各洞及崖壁外大龛再次之。东部在雕刻细工上，则无疑的在最后。﻿

就塔祠论，洞中央之塔柱雕大尊像者较早之，雕楼阁者次之。﻿﻿

三 石窟的源流问题﻿﻿

四 石刻中所表现的建筑形式﻿

（一）塔﻿

云冈石窟所表现的塔分两种：一种是塔柱，另一种便是壁面上浮雕的塔。﻿

伯希和《敦煌图录》中认为北凉建造的第一百十一洞，就有塔柱，每面皆琢佛像。云冈东部第四洞，及中部第二洞，第七洞，也都是如此琢像在四面的，其受敦煌影响，当没有疑问﻿

二）殿宇﻿

壁上浮雕殿宇共有两种，一种是刻成殿宇正面模型；用每两柱间的空隙，镌刻较深佛龛而居像，另一种则是浅刻释迦事迹图中所表现的建筑物。﻿

三）洞口柱廊﻿

洞口因石质风化太甚，残破不堪，石刻建筑结构，多已不能辨认。﻿﻿

五 石刻中所见建筑部分﻿

一）柱﻿

二）阑额﻿

（三）斗栱﻿

四）屋顶﻿

五）门与栱﻿

（六）栏杆及踏步﻿

（七）藻井﻿﻿

六 石刻的飞仙﻿

七 云冈石刻中装饰花纹及色彩﻿

对汉代或更早的遗物有相当认识者，见到云冈石刻的雕饰，实不能不惊诧北魏时期由外传入崭新花样的数量及势力！盖在花纹方面，西域所传入的式样，实可谓喧宾夺主，从此成为十数世纪以来，中国雕饰的主要渊源。继后唐宋及后代一切装饰花纹，均无疑义的，无例外的，由此展进演化而成。﻿﻿

八 窟前的附属建筑﻿﻿

九 结论﻿

所以可以证明，在结构根本原则及形式上，中国建筑二千年来保持其独立性，不曾被外来影响所动摇。所谓受印度希腊影响者，实仅限于装饰雕刻两方面的。﻿﻿

飞仙雕刻亦如佛像，有上面所述两大派别；一为模仿，以印度像为模型；一为创造，综合模仿所得经验，与汉族固有趣味及审美倾向，作新的尝试﻿﻿

云冈石窟乃西域印度佛教艺术大规模侵入中国的实证。但观其结果，在建筑上并未动摇中国基本结构。在雕刻上只强烈的触动了中国雕刻艺术的新创造——其精神、气魄、格调，根本保持着中国固有的。而最后却在装饰花纹上，输给中国以大量的新题材，新变化，新刻法，散布流传直至今日，的确是个值得注意的现象。﻿﻿





十 晋汾古建筑预查纪略﻿

山西旅行游记  有文化 旅行都和别人不一样﻿

汾阳县 峪道河 龙天庙﻿

这座小小正殿，“前廊后无廊”，本为山西常见的做法，前廊檐下用硕大的斗栱，后檐却用极小，乃至不用斗栱，将前后不均齐的配置完全表现在外面，是河北省所不经见的，尤其是在旁面看其所呈现象，颇为奇特。﻿﻿

ps 自叹不如 看看人家旅行﻿﻿

汾阳县 大相村 崇胜寺﻿

虽然在雕工上看来，这些都是精妙绝伦的技艺，可惜太不得其道，以建筑物作卖技之场，结果因小失大，这巍峨大殿，在美术上竟要永远蒙耻低头。﻿﻿

ps 艺术不是每样做到最好，更是统一和协调性﻿﻿

汾阳县 杏花村 国宁寺﻿

文水县 开栅镇 圣母庙﻿

文水县 文庙﻿

院正中泮池，两边廊庑，碑石栏杆，围衬大成门及后殿，壮丽较之都邑文庙有过无不及；但建筑本身分析起来，颇多弱点，仅为山西中部清以后虚有其表的代表作之一种。﻿﻿

汾阳县 小相村 灵岩寺﻿

孝义县 吴屯村 东岳庙﻿

两旁有斜照壁，殿身屋顶是歇山造；抱厦亦然，但山面向前，与开栅圣母正殿极相似，但因前为抱厦，全顶呈繁乱状，加以装饰物，愈富缛不堪设想﻿﻿

霍县 太清观﻿

旧址现为公安局看守所，这样一座雄拔布局的庙宇已荡然无存，期间蹉跎不堪回首。﻿﻿

霍县 文庙﻿

2007年有人撰文道:霍县文庙是如今的第三中学校园，只有一位老教师还依稀对大成殿有些印象。昔日庭院深深，殿宇重重的文庙，只有幸存于两座教学楼间的明伦堂曾经见证过梁、林两先生的来访。﻿

……只剩唏嘘…﻿﻿

霍县 东福昌寺﻿

这始于唐，重建于元，复建于明的东西福昌寺早在50年代已被拆平，成当地五一广场。﻿

在正殿左右为朵殿，这朵殿与正殿殿身，正殿围廊三部屋顶连接的结构法，至为妥善，在清式建筑中已不见这种智巧灵活的做法，官式规制更守住呆板办法删除特种变化的结构，殊可惜﻿

ps  社会进步还是在退步﻿﻿

霍县 西福昌寺﻿

霍县 火星圣母庙﻿

霍县 县政府大堂﻿

在霍县县政府的大堂的结构上，我们得见到滑稽绝伦的建筑独例。大堂前有抱厦，面阔三间。当心间阔而梢间稍狭，四柱之上，以极小的阑额相联络，其上却托着一整根极大的普拍枋，将中国建筑传统的构材权衡完全颠倒。这还不足为奇；最荒谬的是这大普拍枋之上，承托斗栱七朵，朵与朵间都是等距离，而没有一朵是放在任何柱头之上，作者竟将斗栱在结构上之原意义，完全忘却，随便位置。斗栱位置不随立柱安排，除此一例外，惟在以善于作中国式建筑自命的慕菲氏所设计的南京金陵女子大学得又见之﻿﻿

霍县 北门外桥及铁牛﻿

ps 不同的知识见到的场景绝对是不一样的 我没看别具一格来﻿﻿

赵城县 侯村 女娲庙﻿

女娲庙，《志》称唐构，访谒时我们固是抱着很大的希望的﻿

ps 还是无知点好，就不会有希望，同时也就不会有失望了﻿﻿

赵城县 广胜寺下寺﻿

赵城宋版藏经之发现，轰动了学术界，广胜寺之名，已传遍全国了。国人只知藏经之可贵，而不知广胜寺建筑之珍奇﻿﻿

赵城县 广胜寺上寺﻿

琉璃宝塔 亦称飞虹塔。﻿﻿

赵城县 广胜寺 明应王殿﻿﻿

赵城县 霍山  中镇庙﻿

太原县 晋祠﻿

我们在探访古建的习惯中，多对“名胜”怀疑：因为最是“名胜”容易遭“重修”乃至于“重建”的大毁坏，原有建筑故最难得保存！所以我们虽然知道晋祠离太原近在咫尺，且在太原至汾阳的公路上，我们亦未尝预备去访“胜”的﻿

到车站里安顿时，我们几乎埋怨到晋祠的建筑太像样——如果花花簇簇的来个乾隆重建，我们这些麻烦不全省了么？﻿﻿

山西民居﻿

门楼 河北境内虽也有这种布局，但究竟不如山西普遍。﻿

ps我以为是近年才兴起的东西﻿﻿





九 由天宁寺谈到建筑年代之鉴别问题﻿﻿

唐以前的塔，我们所知道的，平面差不多全作正方形。﻿

我们所知的惟一的例外，在唐以前的，惟有嵩山嵩岳寺塔平面作十二角形，这十二角形平面，不惟在唐以前是例外，就是在唐以后，也没有第二个，所以它是个例外之最特殊者，是中国建筑史中之独例。除此以外，则直到中唐或晚唐，方有非正方形平面的八角形塔出现，这个罕贵的遗物即嵩山会善寺净藏禅师塔。按禅师于天宝五年圆寂，这塔的兴建，绝不会在这年以前，这塔短稳古拙亦是孤例，而比这塔还古的八角形平面塔，除去天宁寺——假设它是隋建的话——别处还未得见过。在我们今日，觉得塔的平面或作方形，或作多角形，没甚奇特。但是一个时代的作者，大多数跳不出他本时代盛行的作风或规律以外的——建筑物尤甚——所以生在塔平面作方形的时代，能做出一个平面不作方形的塔来，是极罕有的事。﻿﻿

唐以前的这类上段多层密檐塔，不惟是平面全作方形而且第一层之下无须弥座等等雕饰，且上层各檐是用砖层层垒出，不施斗栱，其所呈的外表，完全是两样的。﻿

在中国建筑中占位置最重要的，莫过于斗栱。斗栱演变的沿革，差不多就可以说是中国建筑结构法演变史。在看多了的人，差不多只须一看斗栱，对一座建筑物的年代，便有七八分把握。﻿﻿

最古的例如北周神通寺四门塔及东魏嵩岳寺十二角十五层塔，都没有斗栱。次古的如西安大雁塔及香积寺砖塔，皆属初唐物，只用斗而无栱。与之略同时或略后者如西安兴教寺玄奘塔则用简单的一斗三升交蚂蚱头在柱头上。直至会善寺净藏塔，我们始得见简单人字栱的补间铺作。神通寺龙虎塔建于唐末，只用双抄偷心华栱。真正用砖石来完全模仿成朵复杂的斗栱的，至五代宋初始见，其中如我们所见许多的“天宁式”塔。﻿﻿













八 平郊建筑杂录﻿

建筑意﻿

顽石会不会点头，我们不敢有所争辩，那问题怕要牵涉到物理学家，但经过大匠之手泽，年代之磋磨，有一些石头的确是会蕴含生气的。天然的材料经人的聪明建造，再受时间的洗礼，成美术与历史地理之和，使它不能不引起赏鉴者一种特殊的性灵的融会，神志的感触，这话或者可以算是说得通。﻿

一 卧佛寺的平面﻿

这种平面布置，在唐宋时代很是平常，敦煌画壁里的伽蓝都是如此布置，在日本各地也有飞鸟平安时代这种的遗例。﻿﻿

二 法海寺门与原先的居庸关﻿

特别留意到这寺门的人，却必定有。因为这寺门的形式是与寻常的极不相同：有圆栱门洞的城楼模样，上边却顶着一座喇嘛式的塔——一个缩小的北海白塔。这奇特的形式，不是中国建筑里所常见。﻿

主要的却是他的式样与原先的居庸关相类似﻿﻿

三 杏子口的三个石佛龛﻿

其中有几个年月人名，较古的有“承安五年四月廿三日到此”，和“至元九年六月十五日□□□贾智记”。承安是金章宗年号，五年是公元一二〇〇年。至元九年是元世祖的年号，元顺帝的至元到六年就改元了，所以是公元一二七二年。这小小的佛龛，至迟也是金代遗物，居然在杏子口受了七百多年以上的风雨，依然存在﻿﻿

七 谈北京的几个文物建筑﻿

天安门前广场和千步廊的制度﻿﻿

团城——古代台的实例﻿

团城已是这种建筑遗制的唯一实例，故极为珍贵。﻿﻿

北海琼华岛白塔的前身﻿﻿

正如层塔的峋峙，长廊的周绕也是最代表中国建筑特征的体型。用于各种建筑物之间它是既有实用，而又美丽的。﻿﻿





六 我们的首都﻿

作者如数家珍  本来就是家珍﻿

中山堂  它是中山公园内的中山堂﻿﻿

北京市劳动人民文化宫  它在天安门的左侧，同天安门右侧的中山公园正相对称。  这里过去称做“太庙”，只是沉寂地供着一些死人牌位和一年举行几次皇族的祭祖大典的地方。﻿﻿

故宫三大殿  太和、中和、保和三座殿﻿

北京城里的故宫中间，巍然崛起的三座大宫殿是整个故宫的重点，“紫禁城”内建筑的核心﻿

三殿中，太和殿最大，也是全国最大的一个木构大殿。﻿

三大殿中的两殿，一前一后，中间夹着略为低小的单位所造成的格局，是它美妙的特点。要用文字形容三殿是不可能的，而同时因环境之大，摄影镜头很难把握这三殿全部的雄姿。深刻的印象，必须亲自进到那动人的环境中，才能体会得到。﻿﻿

北海公园﻿﻿

天坛﻿

天坛在北京外城正中线的东边，占地差不多四千亩，围绕着有两重红色围墙。﻿﻿

颐和园  北京西郊的颐和园﻿﻿

天宁寺塔  北京广安门外的天宁寺塔，是北京城内和郊外的寺塔中完整立着的一个最古的建筑纪念物。﻿﻿

北京近郊的三座“金刚宝座塔”——西直门外五塔寺塔、德胜门外西黄寺塔和香山碧云寺塔﻿﻿

鼓楼、钟楼和什刹海﻿

北京城在整体布局上，一切都以城中央一条南北中轴线为依据。这条中轴线以永定门为南端起点，经过正阳门、天安门、午门、前三殿、后三殿、神武门、景山、地安门一系列的建筑重点，最北就结束在鼓楼和钟楼那里。﻿

海的四周本有十座佛寺，因而得到“什刹”的名称。﻿﻿

雍和宫﻿

北京城内东北角的雍和宫，是二百十几年来北京最大的一座喇嘛寺院﻿

雍和宫曾经是胤祯（清雍正）做王子时的府第。﻿﻿





五 北京——都市计划的无比杰作﻿

我们的祖先选择了这个地址﻿

北京在位置上是一个杰出的选择。它在华北平原的最北头；处于两条约略平行的河流的中间，它的西面和北面是一弧线的山脉围抱着，东面南面则展开向着大平原。它为什么坐落在这个地点是有充足的地理条件的。选择这地址的本身就是我们祖先同自然斗争的生活所得到的智慧。﻿﻿

北京城近千年来的四次改建﻿

现在北京最早的基础是唐朝的幽州城，它的中心在现在广安门外迤南一带。﻿

辽以后，金在旧城基础上扩充建设，便是北京第一次的大改建，但它的东面城墙还在现在的琉璃厂以西。﻿

元，前朝后市，这便是辽以后北京第二次的大改建。它的中心宫城基本上就是今天北京的故宫与北海中海。﻿

明朝经济政治影响  这个变动使景山中峰上的亭子成了全城南北的中心，替代了元朝的鼓楼的地位。这五十年间陆续完成的三次大工程便是北京在辽以后的第三次改建﻿﻿



北京的水源——全城的生命线﻿

北京的城市格式——中轴线的特征﻿﻿

北京的交通系统及街道系统﻿

北京城的土地使用——分区﻿

北京城是一个具有计划性的整体﻿

城墙上面面积宽敞，可以布置花池，栽种花草，安设公园椅，每隔若干距离的敌台上可建凉亭，供人游息。由城墙或城楼上俯视护城河，与郊外平原，远望西山远景或禁城宫殿，它将是世界上最特殊公园之一——一个全长达三九．七五公里的立体环城公园！﻿﻿

我们应该怎样保护这庞大的伟大的杰作？﻿

引用评论  同行的想法都是一样的 就像我们看到罗马式建筑会欣赏赞叹 而只有中国式的园林庭院才会让我们在惊艳流连之余有归属感 文化亦有基因 极难改变﻿﻿









四 《中国建筑史》第六章 宋·辽·金 部分﻿﻿

第二节 北宋宫殿苑囿寺观都市﻿

建筑厉害 原因 国家有钱，能工巧匠超多，宗教兴起﻿

第三节 辽之都市及宫殿﻿﻿

“宫殿制度苟务华饰，必不坚固。今仁政殿，辽时所建，全无华饰，但其它处岁岁修完，惟此殿如旧。以此见虚华无实者不能经久也。﻿﻿

第四节 金之都市宫殿佛寺﻿

第五节 南宋之临安﻿

南宋没钱了  高宗禅位后所辟别宫、园苑及所赐府第、私园，亦多工巧靡丽，但建筑无宏大者。﻿﻿

三 中国建筑发展的历史阶段﻿

第一阶段——从远古到殷（公元前一一二二年以前）  穴居﻿

第二阶段——西周到春秋·战国（公元前一一二二—前二四七年） 城邑﻿

第三阶段——秦·汉·三国（公元前二四七—公元二四六年）  华丽  天子以四海为家，非壮丽无以重威。﻿

第四阶段——晋·南北朝·隋（公元二六五—六一八年）六朝的建筑是衔接中国历史上两个伟大文化时期——汉代与唐代的——桥梁，也是这两时期建筑不同风格急剧转变的关键﻿﻿

第五阶段——唐·五代·辽（公元六一八—一一二五年）唐将外来许多新因素汉化了，将陌生的非中国的成分和典雅庄严对称的中国格局相结合﻿

唐朝是中国建筑最辉煌的一大阶段。﻿﻿

第六阶段——两宋到金·元（公元九六〇—一三六七年） 风格很乱 宋 辽远  资本主义流动性﻿﻿

宋朝由于资本主义的萌芽和消费阶层的活跃，开创了取消都城“夜禁”限制的先例，也可以这样说所谓“夜生活”“夜市”都是从宋而始。﻿﻿

第七阶段——明·清两朝和旧中国时期（公元一三六八—一九一九—一九四九年）﻿

明初两京的两次大建设将南北的高手匠工作了两次大规模调配，使南方北方建筑和工艺的特长都得以发挥出来，汇合为一，创造出明代的特殊风格。西南的巨大楠木，大量在北京使用。这样的建筑所反映的正是民族复兴的统一封建大帝国的雄伟气概。﻿﻿

总的说来，这个时期的洋房、玻璃方盒子似乎给我们带来新的工程技术，有许多房子是可以满足一定的物质需要的。但是，建筑是一个社会生活中最高度综合性的艺术。作为能满足物质和精神双重要求的建筑物来衡量这些洋式和半洋式建筑，它们是没有艺术上价值的，而且应受到批判。无可讳言的，这一百年中蔑视祖国传统，割断历史，硬搬进来的西洋各国资本主义国家的建筑形式对于祖国建筑是摧残而不是发展。历史上封建的建筑物虽已不能适应我们今天生活的新要求，但它们的优良传统，艺术造形上的成就却仍是我们新创造的最可宝贵的源泉。而殖民地建筑在精神上则起过摧毁民族自信心的作用，阻碍了我们自己建筑的发展；在物质上曾是破坏摧毁我们可珍贵的建筑遗产的凶猛势力。它们仅有的一点实用性，在今天面向社会主义生活的面前，也已经很不够了。﻿﻿

过去的匠师在当时的社会、材料、技术的局限性下尚且能为自己时代社会的需要，灵活地运用遗产，解决各式各样的问题。今天的中国所给予建筑师的条件是远远超过过去任何一个时代的。﻿﻿



1.2二 祖国的建筑传统与当前的建设问题﻿﻿

过去一世纪以来，我国沿海岸的大城市赤裸裸地反映了半殖民地的可耻的特性﻿

西洋文化的冲击是我们丢失了风格﻿﻿



建筑本来是有民族特性的，它是民族文化中最重要的表现之一；﻿

民族的才是世界的﻿﻿

另外还有一个特点：在中国建筑中，每一个露在外面的结构部分同时也就是它的装饰部分；那就是说，每一件装饰品都是加工了的结构部分。中国建筑的装饰与结构是完全统一的。天安门就是这一切优点的卓越的典型范例﻿﻿

检查我们过去的许多建筑物，我们注意到两种重要事实：一、无论是木结构或砖石结构，无论在各地方有多少不同的变化，中国建筑几千年来都保持着一致的、一贯的、明确的民族特性。二、我们古代的匠师们善于在自己的传统的基础上适当地吸收外来的影响，丰富了自己，但从来没有因此而丧失了自己的民族特性。﻿﻿





回想一下木质建筑 何尝不是保护环境﻿

木质建筑屹立不倒可以和当今豆腐渣有一拼，为什么啊﻿﻿







1.1﻿

在原则上，一种好建筑必含有以下三要点：实用；坚固；美观。﻿

大凡一派美术都分有创造，试验，成熟，抄袭，繁衍，堕落诸期，建筑也是一样﻿﻿

中国的主要建筑材料为木，次加砖石瓦之混用。外表上一座中国式建筑物，可明显的分作三大部：台基部分；柱梁部分；屋顶部分。﻿

总之“架构制”之最负责要素是：（一）那几根支重的垂直立柱；（二）使这些立柱，互相发生联络关系的梁与枋；（三）横梁以上的构造：梁架，横桁，木椽，及其它附属木造，完全用以支承屋顶的部分。﻿﻿

。南方手艺灵活的地方，过甚的飞檐便是这种证例。外观上虽是浪漫的姿态，容易引诱赞美，但到底不及北方的庄重恰当，合于审美的最真纯条件。﻿﻿

在《周礼》里发现有“上欲尊而宇欲卑；上尊而宇卑，则吐水疾而霤远”之句。﻿﻿



南方屋瓦上多加增极复杂的花样，完全脱离结构上任务纯粹的显示技巧，甚属无聊，不足称扬。﻿﻿



结构上细部枢纽，在西洋诸系中，时常成为被憎恶部分。建筑家不惜费尽心思来掩蔽它们。大者如屋顶用女儿墙来遮掩，如梁架内部结构，全部藏入顶篷之内；小者如钉，如合叶，莫不全是要掩藏的细部。独有中国建筑敢袒露所有结构部分，毫无畏缩遮掩的习惯，大者如梁，如椽，如梁头，如屋脊；小者如钉，如合叶，如箍头，莫不全数呈露外部，或略加雕饰，或布置成纹，使转成一种点缀。几乎全部结构各成美术上的贡献。这个特征在历史上，除西方高矗式建筑外，惟有中国建筑有此优点。﻿﻿

中国架构制既与现代方法恰巧同一原则，将来只需变更建筑材料，主要结构部分则均可不有过激变动，而同时因材料之可能，更作新的发展，必有极满意的新建筑产生。﻿﻿



一 论中国建筑之几个特征﻿

一、中国建筑，不容疑义的，曾经包含过以上三种要素。﻿

在原则上，一种好建筑必含有以下三要点：实用；坚固；美观。﻿

二。中国建筑的第二个显著特征，并且与屋顶有密切关系的，便是，“斗栱”部分。﻿

斗拱，又称枓栱、斗科、欂栌、铺作等[1]，是中国建筑特有的一种结构。在立柱顶、额枋和檐檩间或构架间，从枋上加的一层层探出成弓形的承重结构叫拱，拱与拱之间垫的方形木块叫斗，合称斗拱。﻿﻿

最后的一点关于中国建筑特征的，自然是它的特种的平面布置。﻿﻿

平面布置上最特殊处是绝对本着均衡相称的原则，左右均分的对峙。这种分配倒并不是由于结构，主要原因是起于原始的宗教思想和形式，社会组织制度，人民俗习，后来又因喜欢守旧仿古，多承袭传统的惯例。结果均衡相称的原则变成中国特有的一个固执嗜好。﻿﻿



‌