let demo = {
    title: "乌合之众",
    name: "乌合之众",
    data: [{
        title: "第1卷、群体心理　3、群体的观念、推理与想像力",
        data: [
            //第1卷、群体心理　3、群体的观念、推理与想像力
            { context: "群众在没有获得新闻报道的情况下，以为一艘穿越大西洋的汽轮可能在大西洋沉没了，这一事件足足影响了群体想象力一周的时间。然而，据官方的统计数字显示，仅在1894年这一年当中，就有850艘轮船和203艘蒸汽机船在大西洋失事。就从造成的生命和财产损失来看，它们要比那次大西洋海船的沉没带来的损失大得多，但是，无论何时，群体也没有关心过这些连续的事故。" },
            { context: "" },
        ]
    }, {
        title: "第2卷、群体的意见和信念　1、群体的意见和信念中的间接因素",
        data: [
            { context: "困难，在稳定和多变的状态之间找到平衡是非常困难的。倘若一个民族使自己的习俗变得根深蒂固，不被动摇，不再发生改变，那么它就会变得跟中国一样，无法改进自己。" },
            { context: "在当今时代占据主要地位的观念中，居于首位的要数这样一种观念，即认为教育能够在很大程度上使人改变，它会用可靠的方法提升他们，甚至能让他们变得平等。这种断言在被不间断地重复，单单这一个事实就完全可以让它最终成为最牢固的民主信条。从现在来看，想要打败它，就好比跟从前击败教会一样困难重重。" },
            { context: "许多杰出的哲学家，已经毫不费力地证明，教育既不会让一个人变得更加有道德，也不让他变得更快乐；它既不会改变他的本能，也不会改变他与生俱来的激情，而且有时——这种情况仅仅需要不良因素的诱导就会发生——是有百害而无一利的。" },
            { context: "国家通过教科书的力量创造出了这么多有学历的人，但是能够加以利用的却只有一小部分，只得让其他的人无事可做。" },
            { context: "可是向人们传授大量肤浅的知识，在不出现任何错误的情况下重复背诵教科书，毕竟能提升人们的智力。可是，它真的能提高这种水平吗？完全没有可能！拥有评判、经验、主动性和个性是在生活中取得成功的条件——这些品质并不是课本所能给予的。教科书和字典可以是有用的参考工具，但是，把它长时间放在人们的头脑里却完全没有用处。" },
            { context: "观念只能在自然且正常的环境中形成。提升观念，需要年轻人每天在工厂、矿区、法庭、书房、建筑工地和医院获得众多的感官印象；他需要让木头、材料和操作处在自己的视线范围之内；需要同消费者、工人和劳动者待在一起，无论他们的工作出色还是糟糕，也不管他们是赔钱还是获利。通过这种方式，我们才能对那些从眼睛、耳朵、双手甚至味觉当中获得的种种细节，得到一些无足轻重的感受。他们在不知不觉中得到了这些细节，静静地推敲，在心中成形" },]
    }, {
        title: "第2卷、群体的意见和信念　2、群体意见的直接因素",
        data: [
            { context: "幻觉的社会必要性——群众更喜欢幻觉而不是真理。" },
            { context: "理性。理性不会对群体产生任何影响——群体只受无意识感情的影响——逻辑在历史中产生的作用——发生不可思议的事情的秘密。" },
            { context: "语的力量和由它们所激起的形象之间有着密切的联系，又独立于它们真实的含义。有时候，那些定义最不准确的词语，反倒可以产生最大的影响力。比如民主、社会主义、平等和自由等，它们的含义太过于模糊，以至于用大量的专著也不足以确认它们的所指。" },
            { context: "如果有人摧毁了博物馆和图书馆，如果有人把教堂前面那些受到宗教启发而创造出来的艺术品和纪念物一并推翻的话，人类伟大的梦想之中还会留下什么呢？赋予人们希望和幻觉，不然他们将无法生存下去。这就是存在着众神、英雄和诗人的原因。科学承担起这一任务已有50年的时间，但是，科学在渴求理想的心灵之中却是有所缺失的，因为它没有胆量做出足够慷慨的承诺，因为它不能说谎。" },]
    }, {
        title: "第2卷、群体的意见和信念　3、群体领袖及其说服的手法",
        data: [
            { context: "作出纯粹简洁的断言，不去考虑任何推理和证据，是让一种观念走进群众头脑最行之有效的办法之一。一个断言越是简洁，证据和证明看上去就会越发贫乏，它的威力就会越大。" },
            { context: "然而，如果没有持续地重复断言——而且要尽最大可能保持措辞一致——它仍不会产生真正意义上的影响。我相信拿破仑曾经说过，只有一个修辞法极为重要，那就是重复。被断言的事情，是通过持续地重复才在头脑中稳定下来，并且这种方式最后能够让人把它看作得到证实的真理接受下来。" },]
    }, {
        title: "第2卷、群体的意见和信念　4、群体的信念和意见的变化范围",
        data: [
            { context: "一旦一个新的教条在群体的思维里形成，它就会成为鼓舞人心的源泉，并且会演变成各种制度、艺术和存在的方式。在这种情况下，它能够对人们施展绝对的控制。实干主义者力争要让这种普遍接受的信仰变为现实，立法者下定决心要将它付诸行动，哲学家、艺术家和文学家都致力于怎样才能用各种各样的方式来展现它，除此以外再无他想。" },
            { context: "哲学家的任务，就是研究古代的信仰在它们表面的变动背后，究竟隐藏着什么东西维持着它们，在持续变化的意见之中找出受到普遍信念和种族特性支配的成分。" },
            { context: "引导意见的力量的缺失，以及普遍信仰的毁灭，最终导致的结果就是对一切秩序都保持着极端分歧的信念，并且让群众对于一切没有触及他们直接利益的事情，采取越来越不关心的态度。类似社会主义信条的问题，只有在文化水平极其低下的阶层，如矿区和工厂里的工人当中，才能获得名望。中产阶级的低等成员以及具备一定能力的工人，要么变成了彻底的怀疑论者，要么就是抱着极不稳定的意见。" },]
    }, {
        title: "第3卷、不同群体的分类及其特点 4、选民群体",
        data: [
            { context: "不必怀疑，普选的弱点十分突出，所以人们很难视而不见。无可否认，文明是少数智力超常的人的产物，他们构成了一个金字塔的顶点。随着这个金字塔各个层次的加宽，智力相应地也越来越少，它们就是一个民族中的群众。一种文明的伟大，如果依靠仅仅以人多势众自夸的低劣成员的选票，是无法让人放心的。" },
            { context: "对选举权加以限制，如果必要的话，把这种权利限制在聪明人中间，如此便可认为，这样做会改进群众投票的结果吗？我永远也无法承认会出现这种情况，这是基于我已经说过的理由，即一切集体，不管其成员如何，全都患有智力低下症。在群体中，人们总是倾向于变得智力平平，在一般性问题上，40名院土的投票不会比40个卖水人所投的票更高明。我一点都不相信，如果只让有教养的和受过教育的人成为选民，受到谴责的普选的投票结果就会大为不同。一个人不会因为通晓希腊语或数学，因为是个建筑师、兽医、医生或大律师，便掌握了特殊的智力或社会问题。我们的政治经济学家全都受过高等教育，他们大都是教授或学者，然而他们何曾就哪个普遍性问题——贸易保护、双本位制等等——取得过一致意见？原因就在于，他们的学问不过是我们的普遍无知的一种十分弱化了的形式。在社会问题上，由于未知的因素数量众多，从本质上说人们的无知没有什么两样。" },
            { context: "因此，完全由掌握各种学问的人组成的选民，他们的投票结果不会比现在的情况好多少。他们将仍然主要受自己的感情和党派精神的支配。对于那些我们现在必须对付的困难，我们还是一个也解决不了，而且我们肯定会受到身份团体暴政的压迫。" },]
    }, {
        title: "第3卷、不同群体的分类及其特点 5、议会",
        data: [
            { context: "他的大部分影响力都归因于他遵从大众的意见，而这种大众的意见在殖民地的事务上，并没有超越之前的水平。领袖极少能够走在大众意见的前面，他所做的一切总是为了顺应大众的意见，因此会助长这些意见当中的所有错误。" },
            { context: "群体的领袖有时会拥有非常高的智商，受过高等教育，但是拥有这些品质对他们非但没有好处，反而会给他带来很多危害。倘若他想要了解事物的复杂程度，允许进行解释和促进理解，他的智力就会让他变得宽容，这会在很大的程度上削弱使徒们所必需的信念的强度与粗暴。" },
            { context: "在追求理想的过程中，从野蛮状态过渡到文明状态，然后，当这个理想失去自身的优势时，就会开始衰落和灭亡，这就是一个民族的生命循环过程。" },]
    }, {
        title: "乌合之众读后感",
        data: [
            { context: "这是一本研究群体心理学的书籍，人是群居动物，由于我们所处的环境，更多的地方是只认识自己，很少去关心我们身在群体之间的情况。人们常说两个人在一起，一定比一个人的力量大。从没人考虑过这种想法的对错。正如书中想法，只有正确的引导才能创造更大的价值，但是这是英雄主义，在群体之间这种英雄主义反而又微乎其微。群体之间的交流不需要证据与论证。换个角度来说两个人在一起对社会的破坏性也会很大。如何去引导这股力量，使我们应该注意的事情。而群体又很容易被引导了方向，走向好处还是坏处，就说不准了。" },
            { context: "这本书看看就行了，是从另外一种角度来观看我们身处的社会环境。为作者的远见叹服。很久以前的书籍，而今依然熠熠生辉，还能做到如此的知道作用，不得不佩服作者的见识。角度不同才能开放一片天地。高屋建瓴的感觉也许就是这样吧。书中反复论证群体心理学，受到太多方面的影响，与以前接触的确实不一样，为自己开辟了一片更广阔的的空间。想法也更多了这算是从书中的收获吧。毕竟我们的眼光不能局限于小小的身边，更应该从高处看一下这个社会，换一个角度看我们身边。毕竟我们虽然属于群体，同时我们也是属于个人的。" },
            { context: "大众心理学，确实是自己以前没有接触过的领域。开始的时候还以为是一本反动的书籍，看下去才知道，这些东西是在我们身边发生的，人们往往陷在别人建造的梦中，最关键的还是我们居然相信了它，我想如果这些思想只是对一个人说，也许没人会信，但是当所有人都信了时候，你也在不知不觉中信了，并且没有逻辑，没有论证，如果不信将融入不到这个群体之中。这就是群体的力量。正如文中所说，在群体之中，群体的智商变低了。大众也就变成了乌合之众。正如评论所言成为群体的时候，我们想把自己的成本变得最低，所以只能随声附和。群体这种东西也许正是为了节约成本，懒得动用自己的大脑了吧。也许在群体之中有个人的存在，只是没有人能够站出来，毕竟每个个人也是需要考虑说出来的成本的，正如跟随群体是自省心的事情不是吗。" },
            { context: "看看自己最近看的书籍，一本人类简史让我怀疑人生，一本乌合之众让我怀疑社会，对人类未来的发展方向持怀疑态度。但是正如乌合之众所说的这是一个群体的思想，我也不知道哪里来的自信相信社会一定会变得更好。也许这正是我属于群体的思想的表现吧，在某些情况下我们属于个人，另一些情况我们属于群体。这中间的分界线，作者没说，我们也不能够说得太准确吧。" },
            { context: "" },
            { context: "" },
        ]
    }
    ]
}
data = [demo];