var demo = {
    title: "千字文",
    name: "千字文",
    data: [ {
        title: "天地玄黄，宇宙洪荒。日月盈昃，辰宿列张。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "寒来暑往，秋收冬藏。闰余成岁，律吕调阳。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "云腾致雨，露结为霜。金生丽水，玉出昆冈。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "剑号巨阙，珠称夜光。果珍李柰，菜重芥姜。",
        data: [
            { context: "" },
        ]
    },{
        title: "海咸河淡，鳞潜羽翔。龙师火帝，鸟官人皇。",
        data: [
            { context: "" },
        ]
    },{
        title: "始制文字，乃服衣裳。推位让国，有虞陶唐。",
        data: [
            { context: "" },
        ]
    },{
        title: "吊民伐罪，周发殷汤。坐朝问道，垂拱平章。",
        data: [
            { context: "" },
        ]
    },{
        title: "爱育黎首，臣伏戎羌。遐迩一体，率宾归王。",
        data: [
            { context: "" },
        ]
    },{
        title: "鸣凤在竹，白驹食场。化被草木，赖及万方。",
        data: [
            { context: "" },
        ]
    },{
        title: "盖此身发，四大五常。恭惟鞠养，岂敢毁伤。",
        data: [
            { context: "" },
        ]
    },{
        title: "女慕贞洁，男效才良。知过必改，得能莫忘。",
        data: [
            { context: "" },
        ]
    },{
        title: "罔谈彼短，靡恃己长。信使可覆，器欲难量。",
        data: [
            { context: "" },
        ]
    },{
        title: "墨悲丝染，诗赞羔羊。景行维贤，克念作圣。",
        data: [
            { context: "" },
        ]
    },{
        title: "德建名立，形端表正。空谷传声，虚堂习听。",
        data: [
            { context: "" },
        ]
    },{
        title: "祸因恶积，福缘善庆。尺璧非宝，寸阴是竞。",
        data: [
            { context: "" },
        ]
    },{
        title: "资父事君，曰严与敬。孝当竭力，忠则尽命。",
        data: [
            { context: "" },
        ]
    },{
        title: "临深履薄，夙兴温凊。似兰斯馨，如松之盛。",
        data: [
            { context: "" },
        ]
    },{
        title: "川流不息，渊澄取映。容止若思，言辞安定。",
        data: [
            { context: "" },
        ]
    },{
        title: "笃初诚美，慎终宜令。荣业所基，籍甚无竟。",
        data: [
            { context: "" },
        ]
    },{
        title: "学优登仕，摄职从政。存以甘棠，去而益咏。",
        data: [
            { context: "" },
        ]
    },{
        title: "乐殊贵贱，礼别尊卑。上和下睦，夫唱妇随。",
        data: [
            { context: "" },
        ]
    },{
        title: "外受傅训，入奉母仪。诸姑伯叔，犹子比儿。",
        data: [
            { context: "" },
        ]
    },{
        title: "孔怀兄弟，同气连枝。交友投分，切磨箴规。",
        data: [
            { context: "" },
        ]
    },{
        title: "仁慈隐恻，造次弗离。节义廉退，颠沛匪亏。",
        data: [
            { context: "" },
        ]
    },{
        title: "性静情逸，心动神疲。守真志满，逐物意移。",
        data: [
            { context: "" },
        ]
    },{
        title: "坚持雅操，好爵自縻。都邑华夏，东西二京。",
        data: [
            { context: "" },
        ]
    },{
        title: "背邙面洛，浮渭据泾。宫殿盘郁，楼观飞惊。",
        data: [
            { context: "" },
        ]
    },{
        title: "图写禽兽，画彩仙灵。丙舍旁启，甲帐对楹。",
        data: [
            { context: "" },
        ]
    },{
        title: "肆筵设席，鼓瑟吹笙。升阶纳陛，弁转疑星。",
        data: [
            { context: "" },
        ]
    },{
        title: "右通广内，左达承明。既集坟典，亦聚群英。",
        data: [
            { context: "" },
        ]
    },{
        title: "杜稿钟隶，漆书壁经。府罗将相，路侠槐卿。",
        data: [
            { context: "" },
        ]
    },{
        title: "户封八县，家给千兵。高冠陪辇，驱毂振缨。",
        data: [
            { context: "" },
        ]
    },{
        title: "世禄侈富，车驾肥轻。策功茂实，勒碑刻铭。",
        data: [
            { context: "" },
        ]
    },{
        title: "盘溪伊尹，佐时阿衡。奄宅曲阜，微旦孰营。",
        data: [
            { context: "" },
        ]
    },{
        title: "桓公匡合，济弱扶倾。绮回汉惠，说感武丁。",
        data: [
            { context: "" },
        ]
    },{
        title: "俊义密勿，多士实宁。晋楚更霸，赵魏困横。",
        data: [
            { context: "" },
        ]
    },{
        title: "假途灭虢，践土会盟。何遵约法，韩弊烦刑。",
        data: [
            { context: "" },
        ]
    },{
        title: "起翦颇牧，用军最精。宣威沙漠，驰誉丹青。",
        data: [
            { context: "" },
        ]
    },{
        title: "九州禹迹，百郡秦并。岳宗泰岱，禅主云亭。",
        data: [
            { context: "" },
        ]
    },{
        title: "雁门紫塞，鸡田赤诚。昆池碣石，钜野洞庭。",
        data: [
            { context: "" },
        ]
    },{
        title: "旷远绵邈，岩岫杳冥。治本于农，务兹稼穑。",
        data: [
            { context: "" },
        ]
    },{
        title: "俶载南亩，我艺黍稷。税熟贡新，劝赏黜陟。",
        data: [
            { context: "" },
        ]
    },{
        title: "孟轲敦素，史鱼秉直。庶几中庸，劳谦谨敕。",
        data: [
            { context: "" },
        ]
    },{
        title: "聆音察理，鉴貌辨色。贻厥嘉猷，勉其祗植。",
        data: [
            { context: "" },
        ]
    },{
        title: "省躬讥诫，宠增抗极。殆辱近耻，林皋幸即。",
        data: [
            { context: "" },
        ]
    },{
        title: "两疏见机，解组谁逼。索居闲处，沉默寂寥。",
        data: [
            { context: "" },
        ]
    },{
        title: "求古寻论，散虑逍遥。欣奏累遣，戚谢欢招。",
        data: [
            { context: "" },
        ]
    },{
        title: "渠荷的历，园莽抽条。枇杷晚翠，梧桐蚤凋。",
        data: [
            { context: "" },
        ]
    },{
        title: "陈根委翳，落叶飘摇。游鹍独运，凌摩绛霄。",
        data: [
            { context: "" },
        ]
    },{
        title: "耽读玩市，寓目囊箱。易輶攸畏，属耳垣墙。",
        data: [
            { context: "" },
        ]
    },
    {
        title: "具膳餐饭，适口充肠。饱饫烹宰，饥厌糟糠。",
        data: [
            { context: "" },
        ]
    },
    {
        title: "亲戚故旧，老少异粮。妾御绩纺，侍巾帷房。",
        data: [
            { context: "" },
        ]
    },{
        title: "纨扇圆洁，银烛炜煌。昼眠夕寐，蓝笋象床。",
        data: [
            { context: "" },
        ]
    },{
        title: "弦歌酒宴，接杯举殇。矫手顿足，悦豫且康。",
        data: [
            { context: "" },
        ]
    },{
        title: "嫡后嗣续，祭祀烝尝。稽颡再拜，悚惧恐惶。",
        data: [
            { context: "" },
        ]
    },{
        title: "笺牒简要，顾答审详。骸垢想浴，执热愿凉。",
        data: [
            { context: "" },
        ]
    },{
        title: "驴骡犊特，骇跃超骧。诛斩贼盗，捕获叛亡。",
        data: [
            { context: "" },
        ]
    },{
        title: "布射僚丸，嵇琴阮箫。恬笔伦纸，钧巧任钓。",
        data: [
            { context: "" },
        ]
    },{
        title: "释纷利俗，并皆佳妙。毛施淑姿，工颦妍笑。",
        data: [
            { context: "" },
        ]
    },{
        title: "年矢每催，曦晖朗曜。璇玑悬斡，晦魄环照。",
        data: [
            { context: "" },
        ]
    },{
        title: "指薪修祜，永绥吉劭。矩步引领，俯仰廊庙。",
        data: [
            { context: "" },
        ]
    },{
        title: "束带矜庄，徘徊瞻眺。孤陋寡闻，愚蒙等诮。",
        data: [
            { context: "" },
        ]
    },{
        title: "谓语助者，焉哉乎也。",
        data: [
            { context: "" },
        ]
    }
    ]
}
data = [demo]

/**
 * 一、天地玄黄，宇宙洪荒①。日月盈昃②，辰宿③列张。

【注释】①洪荒：无边无际、混沌蒙昧的状态，指远古时代。洪，洪大、辽阔。荒，空洞、荒芜。

②盈昃（zè）：盈：月光圆满。昃（zè）：太阳西斜。

③宿（xiù）〈古〉中国天文学家将天空中某些星的集合体叫做“宿”。

【译文】天是青黑色的，地是黄色的，宇宙形成于混沌蒙昧的状态中。太阳正了又斜，月亮圆了又缺，星辰布满在无边的太空中。

二、寒来暑往，秋收冬藏。闰馀成岁①，律吕②调阳。

【注释】①闰馀成岁：中国古代历法以月亮圆缺变化一次为一个月，十二个月为一年，但人们实际经历一年（地球绕太阳运行一圈所用的时间）和它之间存在差额，这个时间差额被称为“闰余”。为了解决这个问题，古人每过几年就把积累到一定程度的“闰余”相加，合成“闰月”，插入该年份中，有“闰月”的这一年就是“闰年”。闰，余数。岁，年。

②律吕：律管和吕管，中国古代用来校定音律的一种设备，相当于现代的定音器。中国古代将一个八度分为十二个不完全相等的半音，从低到高依次排列，每个半音称为一律，其中奇数各律叫做“律”，偶数各律叫做“吕”，十二律分为“六律”、“六吕”，简称“律吕”。相传黄帝时伶伦制乐，用律吕以调阴阳。

【译文】寒暑循环变换，来了又去，去了又来；秋天收割庄稼，冬天储藏粮食。积累数年的闰余并成一个月，放在闰年里；古人用六律六吕来调节阴阳。

三、云腾致雨，露结为霜。金生丽水①，玉出昆冈②。

【注释】①丽水：即丽江，又名金沙江，出产黄金。

②昆冈：昆仑山。

【译文】云气上升遇冷就形成了雨，夜里露水遇冷就凝结成霜。黄金产在金沙江，玉石出在昆仑山岗。

四、剑号巨阙①，珠称夜光②。果珍李柰③，菜重芥姜。

【注释】①巨阙：越王允常命欧冶子铸造了五把宝剑，第一为巨阙，其余依次名为纯钩、湛卢（zhàn lú）、胜邪、鱼肠，全都锋利无比，而以巨阙为最。

②夜光：《搜神记》中说，隋侯救好了一条受伤的大蛇，后来大蛇衔了一颗珍珠来报答他的恩情，那珍珠夜间放射出的光辉能照亮整个殿堂，因此人称“夜光珠”。

③李柰（nài）：两种水果的名称，“李”是李子；“柰”是柰子，果木名，落叶小乔木，花白色，果小，俗名花红，又叫沙果。

【译文】最锋利的宝剑叫“巨阙”，最贵重的明珠叫“夜光”。水果里最珍贵的是李子和柰子，蔬菜中最重要的是芥菜和生姜。

五、海咸河淡，鳞潜羽翔。龙师①火帝②，鸟官③人皇④。

【注释】①龙师：相传伏羲氏用龙给百官命名，因此叫他“龙师”。

②火帝：神农氏用火给百官命名，因此叫他“火帝”。

③鸟官：少昊（hào）氏用鸟给百官命名，叫他“鸟官”。

④人皇：传说中的三皇之一。《史记·补三皇本纪》中说：“人皇有九个头，乘着云车，驾着六只大鸟，兄弟九人，分掌九州，各立城邑，共传了150代，合计45600年。

【译文】海水是咸的，河水是淡的，鱼儿在水中潜游，鸟儿在空中飞翔。龙师、火帝、鸟官、人皇，这都是上古时代的帝皇官员。

六、始制文字，乃服衣裳。推位让国，有虞①陶唐②。

【注释】①有虞：有虞氏，传说中的远古部落名，舜是它的首领。这里指舜，又称虞舜。

②陶唐：陶唐氏，传说中的远古部落名，尧是它的首领。这里指尧，又称唐尧。尧当了七十年君主，他死时把君位让给了舜；舜当了五十年君主，又把君位传给了禹；史称“禅（shàn）让”。

【译文】苍颉（jié）创制了文字，嫘（léi）祖制作了衣裳。唐尧、虞舜英明无私，主动把君位禅让给功臣贤人。

七、吊民伐罪，周发殷汤。坐朝问道，垂拱平章。

【译文】安抚百姓，讨伐暴君，是周武王姬发和商王成汤。贤明的君主坐在朝廷上向大臣们询问治国之道，垂衣拱手，毫不费力就能使天下太平，功绩彰著。

八、爱育黎首，臣伏戎羌。遐迩①一体，率宾②归王。

【注释】①遐迩（xiá ěr）：指远近。

②率宾：出自《诗经》：“普天之下，莫非王土；率土之滨，莫非王臣。”

【译文】 他们爱抚、体恤老百姓，使四方各族人俯首称臣。普天之下都统一成了一个整体，所有的老百姓都服服帖帖地归顺于他的统治。

九、鸣凤在竹，白驹①食场。化被②草木，赖及万方。

【注释】①驹（jū）：小马。②被：覆盖，恩泽。

【译文】凤凰在竹林中欢乐的鸣叫，小白马在草场上自由自在地吃着草食。圣君贤王的仁德之治使草木都沾受了恩惠，恩泽遍及天下百姓。

十、盖此身发①，四大②五常③。恭惟鞠养④，岂敢毁伤。

【注释】① 盖此身发：“盖”发语词，引起下面所说的话，本身并无实义。“身发”身体的头发。这里代指整个身体。

② 四大：指地、水、风、火四种元素。

③ 五常：指儒家认为人应具备的五种品德，即仁、义、礼、智、信。

④恭惟鞠养：恭惟也作恭维，对上的谦辞，一般用于文章开头。“鞠（jū）养：抚养，养育。

【译文】人的身体发肤分属于“四大”，一言一动都要符合“五常”。诚敬的想着父母养育之恩，哪里还敢毁坏损伤它。

十一、女慕贞洁，男效才良。知过必改，得能莫忘。

【译文】女子要仰慕那些持身严谨的贞妇洁女，男子要仿效那些有才能有道德的人。知道自己有过错，一定要改正；适合自己干的事，不要放弃。

十二、罔谈彼短，靡恃己长。信使可覆，器欲难量。

【译文】不要谈论别人的短处，也不要依仗自己有长处就不思进取。诚实的话要经得起考验，器度要大，让人难以估量。

十三、墨悲丝染，诗赞羔羊①。景行维贤，克念作圣。

【注释】①诗赞羔羊：“诗”：这里指《诗经》。《诗经》是中国古代有记载的第一部诗歌总集，共305篇，又取整数，称为“诗三百”，分为风、雅、颂三部分。羔羊：《诗经·召南》里有“羔羊”一篇，表面上是赞美羔羊的素白，实质上是称颂穿皮袄的人——士大夫具有羔羊般纯洁正直、不受污染的品德。

【译文】墨子悲叹白丝被染上了杂色，《诗经》赞颂羔羊能始终保持洁白如一。要仰慕圣贤的德行，要克制私欲，努力仿效圣人。

十四、德建名立，形端表正。空谷传声，虚堂习①听。

【注释】①习：长期反复地做，逐渐养成的不自觉的活动。

【译文】养成了好的道德，就会有好的名声；就如同形体端庄了，仪表就正直了一样。空旷的山谷中呼喊声传得很远，宽敞的厅堂里说话声非常清晰。

十五、祸因恶积，福缘善庆①。尺璧非宝，寸阴是竞。

【注释】①祸、福二句：语出《易?坤?文言》：“积善之家，必有余庆；积不善之家，必有余殃。”

【译文】灾祸是作恶多端的结果，福禄是乐善好施的回报。一尺长的美玉不能算是真正的宝贝，而即使是片刻时光也值得珍惜。

十六、资父事①君，曰严与敬。孝当竭力，忠则尽命。

【注释】①事：侍奉。

【译文】奉养父亲，侍奉君主，要严肃而恭敬。孝顺父母应当竭尽全力，忠于君主要不惜献出生命。

十七、临深履薄，夙兴①温凊②。似兰斯馨，如松之盛。

【注释】①夙兴：“夙兴夜寐”之略。夙，早。②温凊（qìng）：“冬温夏凊”之略。凊，凉。

【译文】要“如临深渊，如履薄冰”那样小心谨慎；要早起晚睡，侍候父母让他们感到冬暖夏凉。让自己的德行像兰草那样的清香，像松柏那样的茂盛。

十八、川流不息，渊澄取映。容止若思，言辞安定。

【译文】还能延及子孙，像大河川流不息；影响世人，像碧潭清澄照人。仪容举止要沉静安详，言语措辞要稳重，显得从容沉静。

十九、笃①初诚美，慎终宜令。荣业所基，藉甚②无竟。

【注释】①笃（dǔ）：忠实，诚信。

②籍甚：盛大。

【译文】无论修身、求学、重视开头固然不错，认真去做，有好的结果更为重要。这是一生荣誉的事业的基础，有此根基，发展就没有止境。

二十、学优①登仕，摄②职从政。存以甘棠③，去而益咏。

【注释】①学优：《论语》有“学而优则仕”之语。

②摄（shè）：代理。

③甘棠：木名。即棠梨。《史记·燕召公世家》：“周武王之灭纣，封召公于北燕……召公巡行乡邑，有棠树，决狱政事其下，自侯伯至庶人各得其所，无失职者。召公卒，而民人思召公之政，怀棠树不敢伐，哥咏之，作《甘棠》之诗。”后遂以“甘棠”称颂循吏的美政和遗爱。

【译文】书读好了就能做官，可以行使职权参加国政。周人怀念召伯的德政，召公活着时曾在甘棠树下理政，他过世后老百姓对他更加怀念歌咏。

二十一、乐殊贵贱，礼别尊卑。上和下睦，夫唱妇随。

【译文】音乐要根据人们身份的贵贱而有所不同，礼节要根据人们地位的高低而有所区别。上下要和睦相处，夫妇要一唱一随，协调和谐。

二十二、外受傅训，入奉母仪。诸姑伯叔，犹子比儿。

【译文】在外接受师傅的训诲，在家遵从父母的教导。对待姑姑、伯伯、叔叔等长辈，要像是他们的亲生子女一样。

二十三、孔怀兄弟，同气连根。交友投分，切磨箴规。

【译文】兄弟之间要相互关心，因为同受父母血气，如同树枝相连。结交朋友要意气相投，要能学习上切磋琢磨，品行上互相告勉。

二十四、仁慈隐恻，造次弗离。节义廉退，颠沛匪亏。

【译文】仁义、慈爱，对人的恻隐之心，在任何时候，任何地方都不能抛离。气节、正义、廉洁、谦让这些品德，在最穷困潦倒的时候也不可亏缺。

二十五、性静情逸，心动神疲。守真志满，逐物意移。

【译文】保持内心清静平定，情绪就会安逸舒适，心为外物所动，精神就会疲惫困倦。保持自己天生的善性，愿望就可以得到满足，追求物欲享受，善性就会转移改变。

二十六、坚持雅操，好爵自縻①。都邑②华夏，东西二京。

【注释】①縻（mí）：牵系，拴住，系住。

②邑（yì）：国都，京城。

【译文】坚定地保持着高雅情操，好的职位自然就会属于你。中国古代的都城华美壮观，有东京洛阳和西京长安。

二十七、背邙①面洛，浮渭据泾。宫殿盘郁，楼观飞惊。

【注释】①邙（máng）：山名， 北邙山，在河南省。

【译文】洛阳北靠邙山，面临洛水；长安北横渭水，远据泾河。宫殿回环曲折，楼台宫阙凌空欲飞，使人心惊。

二十八、图写禽兽，画彩仙灵。丙舍①傍启，甲帐②对楹。

【注释】①丙舍：宫中别室。

②甲帐：汉武帝时所造的帐幕。

【译文】宫殿里画着飞禽走兽，还有彩绘的天仙神灵。正殿两边的配殿从侧面开启，豪华的帐幕对着高高的楹柱。

二十九、肆筵设席，鼓瑟吹笙。升阶纳陛，弁转疑星。

【译文】宫殿里摆着酒席，弹琴吹笙一片欢腾。官员们上下台阶互相祝酒，珠帽转动，像满天的星斗。

三十、右通广内，左达承明。既集坟典，亦聚群英。

【译文】右面通向用以藏书的广内殿，左面到达朝臣休息的承明殿。这里收藏了很多的典籍名著，也集着成群的文武英才。

三十一、杜稿钟隶，漆书壁经。府罗将相，路侠⑤槐卿。

【译文】里边有杜度草书的手稿和钟繇隶书的真迹，有从汲（jí）县魏安厘王冢中发现掘出来的漆写古书，以及汉代鲁恭王在曲阜（fù）孔庙墙壁内发现的古文经书。宫延内将相依次排成两列，宫廷外大夫公卿夹道站立。

三十二、户封八县，家给千兵。高冠陪辇①，驱毂②振缨。

【注释】①辇（niǎn）：古时用人拉或推的车。②毂（gǔ）：泛指车。

【译文】他们每家都有八县以上的封地，还有上千名的侍卫武装。戴着高大帽子的官员们陪着皇帝出游，驾着车马，帽带飘舞着，好不威风。

三十三、世禄侈富，车驾肥轻。策功茂实，勒碑刻铭。

【译文】他们的子孙世代领受俸禄，奢侈豪富，出门时轻车肥马，春风得意。朝廷还详尽确实地记载他们的功德，刻在碑石上流传后世。

三十四、磻溪伊尹，佐时阿衡。奄宅曲阜，微旦孰营。

【译文】周武王磻溪遇吕尚，尊他为“太公望”；伊尹辅佐时政，商汤王封他为“阿衡”。周成王占领了古奄国曲阜一带地面，要不是周公旦辅政哪里能成？

三十五、桓公匡合，济弱扶倾。绮回汉惠，说感武丁。

【译文】齐桓公匡正天下诸侯，都打着“帮助弱小”、“拯救危亡”的旗号。汉惠帝做太子时靠绮里季才幸免废黜，商君武丁感梦而得贤相傅说。

三十六、俊乂①密勿②，多士寔宁。晋楚更霸，赵魏困横③。

【注释】①乂（yì）：“千人之英曰俊，百人之英曰乂”，乂是贤才的意思。②密勿是勤勤恳恳的意思。

③横：连横。战国时，苏秦说（shuì）六国联合拒秦，史称“合纵”。张仪主和拆散合纵，使六国一个个服从秦国，称为“连横”。由于连横，秦国采取远交近攻政策，首先打击赵、魏，所以说“赵魏困横”。

【译文】贤才的勤奋谨慎，换来了百官的各安其位。晋文公、楚庄王先后称霸，赵国、魏国受困于连横。

三十七、假途灭虢，践土会盟。何遵约法，韩弊烦刑。

【译文】晋国向虞国借路去消灭虢国，晋文公在践土召集诸侯歃血会盟。萧何遵奉汉高祖简约的法律，韩非惨死在他自己所主张的苛刑之下。

三十八、起翦颇牧①，用军最精。宣威沙漠，驰誉丹青。

【注释】①起翦（jiǎn）颇牧：起：白起；翦：王翦；颇：廉颇；牧：李牧。

【译文】秦将白起、王翦，赵将廉颇、李牧，用兵作战最为精通。他们的声威远扬到北方的沙漠，美名和肖像永远流传在千古史册之中。

三十九、九州禹迹，百郡秦并。岳宗泰岱①，禅主云亭。

【注释】①岱（dài）：泰山的别称。也叫“岱宗”、“岱岳”。

【译文】九州之内都留下了大禹治水的足迹，全国各郡在秦并六国后归于统一。五岳以泰山为尊，历代帝王都在云山和亭山主持禅礼。

四十、雁门紫塞，鸡田赤城。昆池碣石，巨野⑥洞庭。

【译文】名关有北疆雁门，要塞有万里长城，驿站有边地鸡田，奇山有天台赤城。赏池赴昆明滇池，观海临河北碣石，看泽去山东巨野，望湖上湖南洞庭。

四十一、旷远绵邈，岩岫杳冥。治本于农，务兹稼穑。

【译文】中国的土地辽阔遥远，没有穷极，名山奇谷幽深秀丽，气象万千。把农业作为治国的根本，一定要做好播种与收获。

四十二、俶载南亩，我艺黍稷。税熟贡新，劝赏黜陟。

【译文】 一年的农活该开始干起来了，种植着小米和黄米。收获季节，用刚熟的新谷交纳税粮，庄稼种得好的受到表彰和赏赐，种得不好的就要受到处罚。

四十三、孟轲敦素，史鱼秉直。庶几中庸，劳谦谨敕。

【译文】孟子崇尚朴素，史官子鱼秉性刚直。做人要尽可能合乎中庸的标准，必须勤劳谦逊，谨慎检点，懂得规劝告诫自己。

四十四、聆音察理，鉴貌辨色。贻厥嘉猷，勉其祗植。

【译文】听人说话要审察其中的道理，看人容貌要看出他的心情。要给人家留下正确高明的忠告或建议，勉励别人谨慎小心地处世立身。

四十五、省躬讥诫，宠增抗极。殆辱近耻，林皋①幸即。

【注释】①皋（gāo）：水边的高地。

【译文】听到别人的讥讽告诫，要反省自身；备受恩宠不要得意忘形，对抗权尊。如果知道有危险耻辱的事快要发生就退隐山林，还可以幸免于祸。

四十六、两疏见机，解组谁逼。索居闲处，沉默寂寥。

【译文】汉代疏广、疏受叔侄见机归隐，有谁逼迫他们辞去官职呢？离君独居，悠闲度日，整天不用多费唇舌，清静无为岂不是好事。

四十七、求古寻论，散虑逍遥。欣奏累遣，戚谢欢招。

【译文】探求古人古事，读点至理名言，就可以排除杂念，自在逍遥。轻松的事凑到一起，费力的事丢在一边，消除不尽的烦恼，得来无限的快乐。

四十八、渠荷的历①，园莽抽条。枇杷晚翠，梧桐蚤②凋。

【注释】①的历：光彩烂灼的样子。

②蚤（zǎo）：通“早”，指月初或早晨。

【译文】池塘中的荷花开得多么鲜艳，园林内的青草抽出嫩芽。到了冬天枇杷叶子还是绿的，梧桐一到秋天叶子就凋了。

四十九、陈根委翳，落叶飘摇。游鹍独运，凌摩绛霄。

【译文】老树根蜿蜒曲折，落叶在秋风里四处飘荡。只有远游的鲲鹏独立翱翔，直冲布满彩霞的云霄。

五十、耽读玩市，寓目囊①箱。易輶②攸③畏，属耳垣④墙。

【注释】①囊：口袋。②輶（yóu）：一种轻便的车子。

③攸（yōu）：所。④垣（yuán）：矮墙，也泛指墙。

【译文】汉代王充在街市上沉迷留恋于读书，眼睛注视的全是书袋和书籍。换了轻便的车子要注意危险，说话要防止隔墙有耳。

五十一、具膳餐饭，适口充肠。饱饫烹宰，饥厌糟糠。

【译文】平时的饭菜，要适合口味，让人吃得饱。饱的时候自然满足于大鱼大肉，饿的时候应当满足于粗菜淡饭。

五十二、亲戚故旧，老少异粮。妾御绩纺①，侍巾帷房②。

【注释】①绩纺：泛指纺纱，绩麻诸事。即纺绩。②帷房：内房。

【译文】亲属、朋友会面要盛情款待，老人、小孩的食物应和自己不同。小妾婢女要管理好家务，尽心恭敬地服侍好主人。

五十三、纨①扇圆絜②，银烛炜煌。昼眠夕寐，蓝笋象床。

【注释】①纨（wán）：很细的丝织品。②絜（jié）：“洁”之书面语。

【译文】圆圆的绢扇洁白素雅，白白的蜡烛明亮辉煌。白日小憩，晚上就寝，有青篾编成的竹席和象牙雕屏的床榻。

五十四、弦歌酒宴，接杯举觞①。矫手顿足，悦豫且康。

【注释】①觞（shāng）：酒杯。

【译文】奏着乐，唱着歌，摆酒开宴；接过酒杯，开怀畅饮。情不自禁地手舞足蹈，真是又快乐又安康。

五十五、嫡后嗣续，祭祀烝尝。稽颡再拜，悚惧恐惶。

【译文】子孙一代一代传续，四时祭祀不能懈怠。跪着磕头，拜了又拜；礼仪要周全恭敬，心情要悲痛虔诚。

五十六、笺①牒简要，顾答审详。骸②垢想浴，执热愿凉。

【注释】①笺（jiān）：文书、书信。②骸（hái）：身体。

【译文】给人的书信要简明扼要，回答别人的问题时要审慎周详。身上脏了就想洗个澡，捧着热东西就希望它有风把它吹凉。

五十七、驴骡犊特，骇跃超骧。诛斩贼盗，捕获叛亡。

【译文】家里有了灾祸，连驴子、骡子，大小牲口都会受惊，狂蹦乱跳，东奔西跑。官府诛杀盗贼，捕获叛乱分子和亡命之徒。

五十八、布射僚丸，嵇琴阮啸。恬笔伦纸，钧巧任钓。

【译文】吕布善于射箭，宜僚善玩弹丸，嵇康善于弹琴，阮籍善于撮口长啸。蒙恬制造了毛笔，蔡伦发明了造纸，马钧发明了水车，任公子善于钓鱼。

五十九、释纷利俗，竝①皆佳妙。毛施②淑姿，工③颦④妍⑤笑。

【注释】①竝（bìng）：“并”异体字之一。

②毛：毛嫱（qiáng）。西：西施。《庄子·齐物论》：“毛嫱、西施，人之所美也。”

③工：善。④颦（pín）：皱眉。⑤妍（yán）：美丽。

【译文】他们或者善于为人解决纠纷，或者善于发明创造有利于社会，这些都非常巧妙。毛嫱、西施，姿容姣美，哪怕皱着眉头，也像美美的笑。

六十、年矢①每催，曦晖朗曜②。璿玑③悬斡④，晦魄⑤环照。

【注释】①矢（shǐ）：箭。②曜（yào）：日光、照耀。

③璿玑（xuán jī）：古代称北斗星的第一星至第四星。

④斡（wò）：旋转。⑤晦魄：月亮。

【译文】青春易逝，岁月匆匆催人渐老，只有太阳的光辉永远朗照。高悬的北斗随着四季变换转动，明晦的月光洒遍人间每个角落。

六十一、指薪修祜，永绥吉劭。矩步引领，俯仰廊庙。

【译文】顺应自然，修德积福，永远平安，多么美好。如此心地坦然，方可以昂头迈步，一举一动都像在神圣的庙宇中一样仪表庄重。

六十二、束带矜①庄，徘徊瞻眺。孤陋寡闻，愚蒙等诮②。

【注释】①矜（jīn）：自夸、自恃。《礼记·表礼》“不矜而庄。”

②诮（qiào）：讥讽、嘲讽。

【译文】衣带穿着整齐端庄，举止从容，高瞻远瞩。这些道理孤陋寡闻就不会明白，只能和愚昧无知的人一样空活一世，让人耻笑。

六十三、谓语助者，焉哉乎也。

【译文】说到古书中的语助词，那就是“焉”、“哉”、“乎”、“也”了。 
 */