let demo = {
    title: "吕氏春秋",
    name: "吕氏春秋",
    data: [{
        title: "吕氏春秋卷三 季春纪 论人",
        data: [
            { context: "何谓求诸人？人同类而智殊，贤不肖异，皆巧言辩辞，以自防御，此不肖主之所以乱也。凡论人，通则观其所礼，贵则观其所进，富则观其所养，听则观其所行，止则观其所好，习则观其所言，穷则观其所不受，贱则观其所不为，喜之以验其守，乐之以验其僻，怒之以验其节，惧之以验其特，哀之以验其人，苦之以验其志，八观六验，此贤主之所以论人也。论人者，又必以六戚四隐。何谓六戚？父、母、兄、弟、妻、子。何谓四隐？交友、故旧、邑里、门郭。内则用六戚四隐，外则用八观六验，人之情伪贪鄙美恶无所失矣，譬之若逃雨，汙无之而非是。此圣王之所以知人也。" },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    },]
}
data = [demo]