var demo = {
    title: "周易口诀",
    name: "周易口诀",
    data: [{
        title: "八卦方位的五行口诀",
        data: [
            { context: "乾三连、坤六断;离中虚、坎中满;震仰盂、艮覆碗;兑上缺，巽下断。" },
            { context: "乾三连西北开天;坤六断西南八地。" },
            { context: "兑上缺西方双泽;巽下断东南无风。" },
            { context: "艮覆碗东北齐山;震仰盂东方四雷。" },
            { context: "离中虚南方真火;坎中满北方六水。" },
            { context: "八卦相错重叠生;六十四卦化万象。" },
            { context: "天地造化定乾坤;雷厉风行必相薄。" },
            { context: "山泽相连可通气;水火相克不相射。" },
        ]
    }, {
        title: "六十四卦口诀",
        data: [
            { context: "乾坤屯蒙需讼师，比小畜兮履泰否。" },
            { context: "同人大有谦豫随，蛊临观兮噬嗑贲。" },
            { context: "剥复无妄大畜颐，大过坎离三十备。" },
            { context: "咸恒遁兮及大状，晋及明夷家人睽。" },
            { context: "蹇解损益夬姤萃，升困井革鼎震继。" },
            { context: "艮渐归妹丰旅巽，兑涣节兮中孚至。" },
            { context: "小过既济兼未济，是为下经三十四。" },
            { context: "火（离）：火地晋，火山旅，火水未济，火风鼎，火雷噬嗑，火火离，火泽睽，火天大有。" },
            { context: "水（坎）：水地比，水山蹇，水水坎，水风井，水雷屯，水火既济，水泽节，水天需。" },
            { context: "山（艮）：山地剥，山山艮，山水蒙，山风蛊，山雷颐，山火贲，山泽损，山天大畜。" },
            { context: "泽（兑）：泽地萃，泽山咸，泽水困，泽风大过，泽雷随，泽火革，泽泽兑，泽天夬。" },
            { context: "雷（震）：雷地豫，雷山小过，雷水解，雷风恒，雷雷震，雷火丰，雷泽归妹，雷天大壮。" },
            { context: "风（巽）：风地观，风山渐，风水涣，风风巽，风雷益，风火家人，风泽中孚，风天小畜。" },
            { context: "地（坤）：地地坤，地山谦，地水师，地风升，地雷复，地火明夷，地泽临，地天泰。" },
            { context: "天（乾）：天地否，天山遁，天水讼，天风姤，天雷无妄，天火同人，天泽履，天天乾。" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [
            { context: "象中有数数中理;(万事万物的现象之中，一定存在着定数12345678......，而定数之中又包含道理：五行生克制化。)" },
            { context: "以道观象明数理。(我们观察事物时要以道(自然的真理)来看，从而知道了这些现象中的定数与五行生克制化。)" },
            { context: " 以理言事真无比;(然后以五行生克制化的理来判断事物，把结果表达出来，就是预测的正确结果。)" },
            { context: "不可不信妙无许。(学会了这些道理，是妙不可言的，就像掌握了未来那样，很是自在。)" },
            { context: "心若无欲心则灵;(在预测时，心中如果没有任何的贪婪与自私的话，心就一定灵验，心所想的就是准确的预测结果。)" },
            { context: "心无挂碍言出行。(在判断事物时，不要怀疑自己，放心，没有任何的障碍，说出来一定会应验。)" },
            { context: "法外无法无定法;(预测方法就这么简单，完全是在易经范畴之内的，但方法也不是固定的，要活学活用啊。)" },
            { context: "不拘古法心为法。(不要拘泥于原先人们的那些预测的方法，以自己的心为主才是好方法。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "注意事项：",
        data: [
            { context: "心血来潮读易经;(我读易经是心血来潮读的，这里主要是读《易传》，易传是易经的解释，又称十翼，是给易经装的十支翅膀，毕竟易经是上古人士作的，我们看不懂，也不必看懂，只要理解了易传的含义，把握其中的精华所在，然后和自己的体悟融会贯通，但一定要熟记64卦的挂名就可以了。易经一定有它简易的一面，我们就从简单的入手就好。)" },
            { context: "读懂易经神来到。(其实，读懂易传足够了，根本就不必去再读易经原文了，就像自己就是神仙那样，很舒服自在。)" },
            { context: "顺手拈来八卦象;(预测未来完全是任凭心血来潮、随意找出卦象来。)" },
            { context: "鬼使神差不枉然。(就算是写错了八卦，搞错了卦理，说出来的结果也是准确的，就这么怪。)" },
            { context: "世间本无善与恶;(其实啊，人世间并没有善与恶的分别，只是人们自己分开来的。)" },
            { context: "因果循环天理合。(宇宙间只有因果的天理在循环。)" },
            { context: "吉中有凶凶藏吉;(其实，所有的事物皆是如此，好事情中总是有不完美的地方，坏事情中也有好的地方。)" },
            { context: "居安思危便化无。(如果能做到顺境中考虑到逆境会到来的话，做好预防措施，逆境就永远不会来到，凶也能化为吉了。)" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [{
            title: "乾卦",
            data: [
                { context: "乾物金玉与珠宝，冠镜木果钱钟表。" },
                { context: "高档用品如轿车，圆物刚物全是了。" },
                { context: "动物马狮天鹅象，寺院皇宫都市撞。" },
                { context: "高楼宫殿博物馆，君父长官有名望。" },
                { context: "英雄独裁掌权人，刚毅果断积极行。" },
                { context: "冷酷傲慢是缺点，还有强制任专横。" },
                { context: "身体胸部头骨肺，季节秋天戌亥配。" },
                { context: "颜色大赤玄金黄，一四九数西北位。­" },
                { context: "" },
            ]
        }, {
            title: "坤卦",
            data: [
                { context: "坤人勤劳又恭敬，沉默迟缓性柔顺。" },
                { context: "消极懒躺懦弱穷，依赖吝啬要谨慎。" },
                { context: "人物普通之大众，农夫乡人泥瓦工。" },
                { context: "老母后母妻寡妇，臣民顾问村干部。" },
                { context: "大腹之人地产商，阴气盛者小人狂。" },
                { context: "牛马雌兽脾胃肉，西南八五十色黄。" },
                { context: "辰戌丑未均旺季，五谷布衣包瓦器。" },
                { context: "矮旧农舍会市场，田野仓库平原地。" },
                { context: "" },
            ]
        }, {
            title: "震卦",
            data: [
                { context: "震怒躁动起虚惊，性急无礼强霸民。" },
                { context: "表现进步显勇敢，追求紧迫便粗心。" },
                { context: "人物有名是将帅，警察法官长子在。" },
                { context: "狂士声大善吹牛，运动驾驶跑得快。" },
                { context: "住宅楼阁闹市中，公园车站大道同。" },
                { context: "唯有庭院山林静，歌厅舞厅乱轰轰。" },
                { context: "春来寅卯四八三，龙蛇鹰蜂鹤鹿眠。" },
                { context: "足肝神经声音发，竹木制品采花鲜。" },
                { context: "" },
            ]
        }, {
            title: "巽卦",
            data: [
                { context: "巽为长女为僧道，教师商人手艺妙。" },
                { context: "优柔寡断科技人，额宽面白头发少。" },
                { context: "奔波忙碌飘难定，多欲空虚基不牢。" },
                { context: "进退忧疑生权谋，鼓舞附和直爽好。" },
                { context: "场地山林之寺观，商店码头邮局连。" },
                { context: "窄路管道长直物，木制纤维丝线牵。" },
                { context: "蝇笔蚊香电风扇，兰花草约救生圈。" },
                { context: "鸡鹅鸭蛇五三八，青兰辰巳股肱边。" },
            ]
        }, {
            title: "坎卦",
            data: [
                { context: "坎人算计太聪明，义气漂泊不安宁。" },
                { context: "时时险陷灾难困，狡猾欺诈亦劳心。" },
                { context: "善则思想多创造，恶则暗昧匪与盗。" },
                { context: "劳苦沉默变酒鬼，耳血腰肾防不妙。" },
                { context: "江湖泉井与河沟，酒店澡堂监狱囚。" },
                { context: "车库饭店地下室，油盐酱醋饮料流。" },
                { context: "带核桃李放酒具，磁盘影带计算器。" },
                { context: "一六亥子属北方，色黑猪鱼狐鼠遇。" },
                { context: "" },
            ]
        }, {
            title: "离卦",
            data: [
                { context: "离为火兮为日电，聪明虚心重表现。" },
                { context: "煽动轻浮好虚荣，自满扩张示鲜艳。" },
                { context: "中层美人文艺人，目疾兵戈幻多情。" },
                { context: "报刊印章图书信，影视机器灯照明。" },
                { context: "大腹中空瓶笼类，玻璃门窗烧烤会。" },
                { context: "名胜书馆影剧场，医院学校火山射。" },
                { context: "公安法院检察院，三二七南红紫变。" },
                { context: "雉龟虾蟹凤孔雀，心目上焦小肠患。" },
                { context: "" },
            ]
        }, {
            title: "艮卦",
            data: [
                { context: "艮为少男与儿童，僧道闲人土建工。" },
                { context: "石匠囚犯监狱吏，奴仆官僚可怜虫。" },
                { context: "主观任性太顽固，困阻偏激保守路。" },
                { context: "沉着冷静慢更新，建设改善莫停步。" },
                { context: "丘陵坟墓山高台，银行寺庙休息宅。" },
                { context: "堤坎监狱派出所，仓库门坎桌子鞋。" },
                { context: "磁器石碑床与伞，硬木硬果钱袋满。" },
                { context: "五黄十七在东北，手背胃鼻虎鼠犬。" },
            ]
        }, {
            title: "兑卦 ­",
            data: [
                { context: "兑为少女妾可爱，巫师巫婆娼妓坏。" },
                { context: "动口职业如歌女，饮食金融与破败。" },
                { context: "喜悦温柔逞雄辩，谗毁谤说成淫滥。" },
                { context: "笑骂吵闹空议论，服从脱落装伪善。" },
                { context: "身体口舌肺咽痰，泽中之物羊猴猿。" },
                { context: "饮食用具缺损品，金刀金类乐器玩。" },
                { context: "有口瓶子酒杯罐，山洞池井水泽畔。" },
                { context: "废墟路口破壁屋，四二九白西方看。​​​​" },
                { context: "" },
            ]
        },
        ]
    }, {
        title: "六十四卦爻辞",
        data: [{
            title: "乾为天 -- 乾，元，亨，利，贞。",
            data: [
                { context: "初九：潜龙，勿用。" },
                { context: "九二：见龙在田，利见大人。" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。" },
                { context: "九四：或跃在渊，无咎。" },
                { context: "九五：飞龙在天，利见大人。" },
                { context: "上九：亢龙有悔。" },
                { context: "用九：见群龙，无首吉。" },
            ]
        }, {
            title: "天泽履 -- 履虎尾，不咥人，亨。",
            data: [
                { context: "初九：素履往，无咎。" },
                { context: "九二：履道坦坦，幽人贞吉。" },
                { context: "六三：眇能视，跛能履，履虎尾，咥人凶，武人为于大君。" },
                { context: "九四：履虎尾，愬愬，终吉。" },
                { context: "九五：夬履，贞厉。" },
                { context: "上九：视履考祥，其旋元吉。" },
            ],
        }, {
            title: "天火同人 -- 同人于野，亨。利涉大川，利君子贞。",
            data: [
                { context: "初九：同人于门，无咎。" },
                { context: "六二：同人于宗，吝。" },
                { context: "九三：伏戎于莽。升其高陵，三岁不兴。" },
                { context: "九四：乘其墉，弗克攻，吉。" },
                { context: "九五：同人，先号咷而后笑，大师克相遇。" },
                { context: "上九：同人于郊，无悔。" },
            ],
        }, {
            title: "天雷无妄 -- 无妄，元亨利贞。其匪正有眚，不利有攸往。",
            data: [
                { context: "初九：无妄，往吉。" },
                { context: "六二：不耕获，不菑畬，则利有攸往。" },
                { context: "六三：无妄之灾，或系之牛，行人之得，邑人之灾。" },
                { context: "九四：可贞，无咎。" },
                { context: "九五：无妄之药，勿药有喜。" },
                { context: "上九：无妄行有眚，无攸利。" },
            ],
        }, {
            title: "天风姤 -- 姤，女壮，勿用取女。",
            data: [
                { context: "初六：系于金柅，贞吉。有攸往，见凶，赢豕孚蹢躅。" },
                { context: "九二：包有鱼，无咎，不利宾。" },
                { context: "九三：臀无肤，其行次且，厉，无大咎。" },
                { context: "九四：包无鱼，起凶。" },
                { context: "九五：以杞包瓜，含章，有损自天。" },
                { context: "上九：姤其角，吝；无咎。" },
            ],
        }, {
            title: "天水讼 -- 讼，有孚，窒惕。中吉，终凶。利见大人，不利涉大川。",
            data: [
                { context: "初六：不永所事，小有言，终吉。" },
                { context: "九二：不克讼，归而逋，其邑人三百户无眚。" },
                { context: "六三：食旧德，贞厉，终吉。或从王事，无成。" },
                { context: "九四：不克讼，复即命，渝安贞，吉。" },
                { context: "九五：讼，元吉。" },
                { context: "上九：或锡之鞶带，终朝三褫之。" },
            ],
        }, {
            title: "天山遁 ---  遁，亨，小利贞。",
            data: [
                { context: "初六：遁尾，厉，勿用有攸往。" },
                { context: "六二：执之用黄牛之革，莫之胜说。" },
                { context: "九三：系遁，有疾厉，蓄臣妾，吉。" },
                { context: "九四：好遁，君子吉，小人否。" },
                { context: "九五：嘉遁，贞吉。" },
                { context: "上九：肥遁，无不利。" },
            ],
        }, {
            title: "天地否 -- 否之匪人，不利君子贞，大往小来。",
            data: [
                { context: "初六：拔茅茹以其汇，贞吉，亨。" },
                { context: "六二：包承，小人吉，大人否亨。" },
                { context: "六三：包羞。" },
                { context: "九四：有命，无咎。畴离祉。" },
                { context: "九五：休否，大人吉。其亡其亡，系于苞桑。" },
                { context: "上九：倾否，先否后喜。" },
            ],
        }, {
            title: "泽天夬 -- 夬，杨于王庭，孚号有厉，告自邑，不利即戎，利有攸往。",
            data: [
                { context: "初九：壮于前趾，往不胜，为咎。" },
                { context: "九二：惕号，莫夜有戎，勿恤。" },
                { context: "九三：壮于頄，有凶，君子夬夬，独行遇雨若濡，有愠，无咎。" },
                { context: "九四：臀无肤，其行次且，索羊悔亡，闻言不信。" },
                { context: "九五：苋陆夬夬，中行无咎。" },
                { context: "上六：无号，终有凶。" },
            ],
        }, {
            title: "兑为泽 -- 兑，亨，利贞。",
            data: [
                { context: "初九：和兑，吉。" },
                { context: "九二：孚兑，吉。悔亡。" },
                { context: "六三：来兑，凶。" },
                { context: "九四：商兑未宁，介疾有喜。" },
                { context: "九五：孚于剥，有厉。" },
                { context: "上六：引兑。" },
            ],
        }, {
            title: "泽火革 -- 革，巳日乃孚，元亨利贞，悔亡。",
            data: [
                { context: "初九：巩用黄牛之革。" },
                { context: "六二：巳日乃革之，征吉，无咎。" },
                { context: "九三：征凶，贞厉。革言三就，有孚。" },
                { context: "九四：悔亡，有孚，改命吉。" },
                { context: "九五：大人虎变，未占有孚。" },
                { context: "上六：君子豹变，小人革面，征凶，居贞吉。" },
            ],
        }, {
            title: "泽雷随 --- 随，元亨，利贞，无咎。",
            data: [
                { context: "初九：官有渝，贞吉，出门交有功。" },
                { context: "六二：系小子，失丈夫。" },
                { context: "六三：系丈夫，失小子。随有求得，利居贞。" },
                { context: "九四：随有获，贞凶。有孚在道，以明，何咎？" },
                { context: "九五：孚于嘉，吉。" },
                { context: "上六；拘系之，乃从维之，王用亨于西山。" },
            ],
        }, {
            title: "泽风大过 -- 大过，栋桡，利于攸往，亨。",
            data: [
                { context: "初六：籍用白茅，无咎。" },
                { context: "九二：枯杨生秭，老夫得其女妻，无不利。" },
                { context: "九三：栋桡，凶。" },
                { context: "九四：栋隆，吉，有它吝。" },
                { context: "九五：枯杨生华，老妇得其士夫，无咎，无誉。" },
                { context: "上六：过涉灭顶，凶，无吝。" },
            ],
        }, {
            title: "泽水困 -- 困，亨，贞，大人吉，无咎。有言不信。",
            data: [
                { context: "初六：臀困于株木，入于幽谷，三岁不觌。" },
                { context: "九二：困于酒食，朱绂方来，利用享祀，征凶，无咎。" },
                { context: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。" },
                { context: "九四：来徐徐，困于金车，吝，有终。" },
                { context: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。" },
                { context: "上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。" },
            ],
        }, {
            title: "泽山咸 -- 咸，亨，利贞。娶女，吉。",
            data: [
                { context: "初六：咸其拇。" },
                { context: "六二：咸其腓，凶，居吉。" },
                { context: "九三：咸其股，执其随，往蔺吝。" },
                { context: "九四：贞吉，悔亡。憧憧往来，朋从尔思。" },
                { context: "九五：咸其脢，无悔。" },
                { context: "上六：咸其辅颊舌。" },
            ],
        }, {
            title: "泽地萃 -- 萃，亨。王假有庙。利见大人，亨，利贞，用大牲吉，利有攸往。",
            data: [
                { context: "初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。" },
                { context: "六二：引吉，无咎，孚乃利用禴。" },
                { context: "六三：萃如嗟如，无攸利，往无咎，小吝。" },
                { context: "九四：大吉无咎。" },
                { context: "九五：萃有位，无咎。匪孚，元永贞，悔亡。" },
                { context: "上六：赍咨涕洟，无咎。" },
            ],
        }, {
            title: "火天大有 -- 大有，元亨。",
            data: [
                { context: "初九：无交害，匪咎艰则无咎。" },
                { context: "九二：大车以载，有攸往，无咎。" },
                { context: "九三：公用亨于天子，小人弗克。" },
                { context: "九四：匪其彭，无咎。" },
                { context: "六五：厥孚交如，威如，吉。" },
                { context: "上九：自天祐之，吉，无不利。" },
            ],
        }, {
            title: "火泽睽 -- 睽，小事吉。",
            data: [
                { context: "初九：悔亡。丧马勿逐，自复。见恶人，无咎" },
                { context: "九二：遇主于巷，无咎。" },
                { context: "六三：见舆曳，其牛掣，其人天且劓，无初，有终。" },
                { context: "九四：睽孤遇元夫，交孚，历无咎。" },
                { context: "六五：悔亡，厥宗噬肤，往何咎。" },
                { context: "上九：睽孤见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。" },
            ],
        }, {
            title: "离为火 -- 离，利贞，亨。畜 牛牝吉。",
            data: [
                { context: "初九：履错然敬之，无咎。" },
                { context: "六二：黄离，元吉。" },
                { context: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。" },
                { context: "九四：突如其来如，焚如，死如，弃如。" },
                { context: "六五：出涕沱若，戚嗟若，吉。" },
                { context: "上九：王用出征，有嘉折首，获匪其丑，无咎。" },
            ],
        }, {
            title: "火雷噬嗑 -- 噬嗑，亨，利用狱。",
            data: [
                { context: "初九：屦校灭趾，无咎。" },
                { context: "六二：噬肤灭鼻，无咎。" },
                { context: "六三：噬腊肉，遇毒，小吝，无咎。" },
                { context: "九四：噬干胏，得金矢，利艰贞，吉。" },
                { context: "六五：噬干肉，得黄金，贞厉，无咎。" },
                { context: "上九：何校灭耳，凶。" },
            ],
        }, {
            title: "火风鼎 -- 鼎，元吉，亨。",
            data: [
                { context: "初六：鼎颠趾，利出否，得妾以其子，无咎。" },
                { context: "九二：鼎有实，我仇有疾，不我能即，吉。" },
                { context: "九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。" },
                { context: "九四：鼎折足，覆公餗，其形渥，凶。" },
                { context: "六五：鼎黄耳，金铉，利贞。" },
                { context: "上九：鼎玉铉，大吉无不利。" },
            ],
        }, {
            title: "火水未济 -- 未济，亨。小狐泛济，濡其尾，无攸利。",
            data: [
                { context: "初六：濡其尾，吝。" },
                { context: "九二：曳其轮，贞吉。" },
                { context: "六三：未济，征凶，利涉大川。" },
                { context: "九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。" },
                { context: "六五：贞吉，无悔，君子之光有孚，吉。" },
                { context: "上九：有孚于饮酒，无咎。濡其首，有孚矢是。" },
            ],
        }, {
            title: "火山旅 -- 旅，小亨，旅，贞吉。",
            data: [
                { context: "初六：旅琐琐，斯其所取灾。" },
                { context: "六二：旅即次，怀其资，得童仆贞。" },
                { context: "九三：旅焚其次，丧其童仆贞，厉。" },
                { context: "九四：旅于处，得其资斧，我心不快。" },
                { context: "六五：射雉，一矢亡，终以誉命。" },
                { context: "上九：鸟焚其巢，旅人先笑后号啕，丧牛于易，凶。" },
            ],
        }, {
            title: "火地晋 -- 晋，康侯用锡马蕃蔗，昼日三接。",
            data: [
                { context: "初六：晋如、摧如，贞吉。罔孚，裕无咎。" },
                { context: "六二：晋如愁如，贞吉。受兹介福于其王母。" },
                { context: "六三：众允、悔亡。" },
                { context: "九四：晋如鼫鼠，贞厉。" },
                { context: "六五：悔无，失得勿恤，往吉，无不利。" },
                { context: "上九：晋其角，惟用伐邑，厉吉,，无咎，贞吝。" },
            ],
        }, {
            title: "雷天大壮 -- 大壮，利贞。",
            data: [
                { context: "初九：壮于趾，征凶，有孚。" },
                { context: "九二：贞吉。" },
                { context: "九三：小人用壮，君子用罔。祗羊触藩，赢其角。" },
                { context: "九四：贞吉，悔亡。藩决不赢，壮子大舆之輹。" },
                { context: "六五：丧羊于易，无悔。" },
                { context: "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。" },
            ],
        }, {
            title: "雷泽归妹 -- 归妹，征凶，无攸利。",
            data: [
                { context: "初九：归妹以娣，跛能履，征吉。" },
                { context: "九二：眇能视，利幽人之贞。" },
                { context: "六三：归妹以须，反归以娣。" },
                { context: "九四：归妹愆期，迟归有时。" },
                { context: "六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。" },
                { context: "上六：女承筐无实，士刲羊无血，无攸利。" },
            ],
        }, {
            title: "雷火丰 -- 丰，亨，王假之，勿忧，宜日中。",
            data: [
                { context: "初九：遇其配主，虽旬无咎，往有尚。" },
                { context: "六二：丰其蔀，日中见斗，往得疑疾；有孚发若，吉。 " },
                { context: "九三：丰其沛，日中见沫。折旧右肱，无咎。" },
                { context: "九四：丰其部，日中见斗，遇其夷主，吉。" },
                { context: "九五：来章，有庆誉,吉。" },
                { context: "上六：丰其屋，部其家，闚其户，阒其无人，三岁不觌，凶。" },
            ],
        }, {
            title: "震为雷 -- 震，亨，震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。",
            data: [
                { context: "初九：震来虩虩，后笑言哑哑，吉。" },
                { context: "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。" },
                { context: "六三：震苏苏，震行无眚。" },
                { context: "九四：震遂泥。" },
                { context: "六五：震往来厉，亿无丧有事。" },
                { context: "上六：震索索，视矍矍，征凶，震不于其躬，于其邻，无咎。婚媾有言。" },
            ],
        }, {
            title: "雷风恒 -- 恒，亨，无吝，利贞，利有攸往。",
            data: [
                { context: "初六：浚恒，贞凶，无攸利。" },
                { context: "九二：悔亡。" },
                { context: "九三：不恒其德，或承之羞，贞吝。" },
                { context: "九四：田无禽。" },
                { context: "六五：恒其德，贞妇人吉，夫子凶。" },
                { context: "上六：振恒，凶。" },
            ],
        }, {
            title: "雷水解 -- 解，利西南，无所往，其来复，吉。有攸往，夙吉。",
            data: [
                { context: "初六：无咎。" },
                { context: "九二：田获三狐，得黄矢，贞吉。" },
                { context: "六三：负且乘，致寇至，贞吝。" },
                { context: "九四：解而拇，朋至斯孚。" },
                { context: "六五：君子维有解，吉，有孚于小人。" },
                { context: "上六：公用射隼于高墉之上，获之无不利。" },
            ],
        }, {
            title: "雷山小过 -- 小过，亨，利贞，可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。",
            data: [
                { context: "初六：飞鸟以凶。" },
                { context: "六二：过其祖，遇其妣，不及其君，遇其臣，无咎。" },
                { context: "九三：弗过防之，从或戕之，凶。" },
                { context: "九四：无咎，弗过遇之。往厉必戒，勿用永贞。" },
                { context: "六五：密云不雨，自我西郊，公弋取彼在穴。" },
                { context: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。" },
            ],
        }, {
            title: "雷地豫 -- 豫，利建侯，行师。",
            data: [
                { context: "初六：鸣豫，凶。" },
                { context: "六二：介于石，不终日，贞吉。" },
                { context: "六三：盱豫，悔；迟,有悔。" },
                { context: "九四：由豫，大有得，勿疑，朋盍簪。" },
                { context: "六五：贞疾，恒不死。" },
                { context: "上六：冥豫，成有渝，无咎。" },
            ],
        }, {
            title: "风天小畜 -- 小畜，亨。密云不雨，自我西郊。",
            data: [
                { context: "初九：复自道，何其咎，吉。" },
                { context: "九二：牵复，吉。" },
                { context: "九三：舆说辐，夫妻反目。" },
                { context: "六四：有孚，血去惕出，无咎。" },
                { context: "九五：有孚挛如，富以其邻。" },
                { context: "上九：既雨既处，尚德载，妇贞厉，月几望，君子征凶。" },
            ],
        }, {
            title: "风泽中孚 -- 中孚，豚鱼吉。利涉大川。利贞。",
            data: [
                { context: "初九：虞吉，有它不燕。" },
                { context: "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。" },
                { context: "六三：得敌，或鼓或罢，或泣或歌。" },
                { context: "六四：月几望，马匹亡，无咎。" },
                { context: "九五：有孚挛如，无咎。" },
                { context: "上九：翰音登于天，贞凶。" },
            ],
        }, {
            title: "风火家人 -- 家人，利女贞。",
            data: [
                { context: "初九：闲有家，悔亡。" },
                { context: "六二：无攸遂，在中馈，贞吉。" },
                { context: "九三：家人嗃嗃，悔厉吉；妇人嘻嘻，终吝。" },
                { context: "六四：富家，大吉。" },
                { context: "九五：王假有家，勿恤，吉。" },
                { context: "上九：有孚威如，终吉。" },
            ],
        }, {
            title: "风雷益 -- 益，利有攸往，利涉大川。",
            data: [
                { context: "初九：利用为大作，元吉，无咎。" },
                { context: "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。" },
                { context: "六三：益之用凶事，无咎。有孚中行告公用圭。" },
                { context: "六四：中行告公从，利用为依迁国。" },
                { context: "九五：有孚惠心，勿问元吉。有孚惠我德。" },
                { context: "上九：莫益之，或击之。立心勿恒，凶。" },
            ],
        }, {
            title: "巽为风 -- 巽，小亨，利有攸往，利见大人。",
            data: [
                { context: "初六：进退，利武人之贞。" },
                { context: "九二：巽在床下，用史巫纷若，吉，无咎。" },
                { context: "九三：频巽，吝。" },
                { context: "六四：悔亡，田获三品。" },
                { context: "九五：贞吉，悔亡，无不利，无初有终，先庚三日，后庚三日，吉。" },
                { context: "上九：巽在床下，丧其资斧，贞凶。" },
            ],
        }, {
            title: "风水涣 -- 涣，亨。王假有庙，利涉大川，利贞。",
            data: [
                { context: "初六：用拯马壮，吉。" },
                { context: "九二：涣奔其机，悔亡。" },
                { context: "六三：涣其躬，无悔。" },
                { context: "六四：涣其群，元吉。涣有丘，匪夷所思。" },
                { context: "九五：涣汗其大号，涣王居。无咎。" },
                { context: "上九：涣其血去，狄出，无咎。" },
            ],
        }, {
            title: "风山渐 -- 渐，女归，吉，利贞。",
            data: [
                { context: "初六：鸿渐于干，小子厉，有言，无咎。" },
                { context: "六二：鸿渐于磐，饮食衍衍，吉。" },
                { context: "九三：鸿渐于陆，夫征不复，妇孕不育，凶。利用御寇。" },
                { context: "六四：鸿渐于木，或得其桷，无咎。" },
                { context: "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。" },
                { context: "上九：鸿渐于陆，其羽可用为仪，吉。" },
            ],
        }, {
            title: "风地观 -- 观，盥而不荐，有孚颙若。",
            data: [
                { context: "初六：童观，小人无咎，君子吝。" },
                { context: "六二：闚观，利女贞。" },
                { context: "六三：观我生，进退。" },
                { context: "六四：观国之光，利用宾于王。" },
                { context: "九五：观我生，君子无吝。" },
                { context: "上九：观其生，君子无吝。" },
            ],
        }, {
            title: "水天需 -- 需，有孚，光亨，贞吉。利涉大川。",
            data: [
                { context: "初九：需于郊。利用恒，无咎。" },
                { context: "九二：需于沙。小有言，终吉。" },
                { context: "九三：需于泥，致寇至。" },
                { context: "六四：需于血，出自穴。" },
                { context: "九五：需于酒食，贞吉。" },
                { context: "上六：入于穴，有不速之客三人来，敬之，终吉。" },
            ],
        }, {
            title: "水泽节 -- 节，亨，苦节不可贞。",
            data: [
                { context: "初九：不出户庭，无咎。" },
                { context: "九二：不出门庭，凶。" },
                { context: "六三：不节若、则嗟若，无咎。" },
                { context: "六四：安节，亨。" },
                { context: "九五：甘节，吉，往有尚。" },
                { context: "上六：苦节，贞凶，悔亡。" },
            ],
        }, {
            title: "水火既济 -- 既济，亨小，利贞。初吉，终乱。",
            data: [
                { context: "初九：曳其轮，濡其尾，无咎。" },
                { context: "六二：妇丧其茀茀、勿逐，七日得。" },
                { context: "九三：高宗伐鬼方，三年克之，小人勿用。" },
                { context: "六四：濡有衣袽，终日戒。" },
                { context: "九五：东邻杀牛，不如西郊之瀹祭，实受其福。" },
                { context: "上六：濡其首，厉。" },
            ],
        }, {
            title: "水雷屯 -- 屯，元亨，利贞。勿用有攸往，利建侯。",
            data: [
                { context: "初九：磐桓，利居贞，利建侯。" },
                { context: "六二：屯如邅（走）如，乘马班如。匪寇婚媾，女子贞，不字，十年乃字。" },
                { context: "六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。" },
                { context: "六四：乘马班如，求婚媾，往，吉无不利。" },
                { context: "九五：屯其膏，小，贞吉；大，贞凶。" },
                { context: "上六：乘马班如，泣血涟如。" },
            ],
        }, {
            title: "水风井 -- 井，改邑不改井。无丧无得，往来井井。汔至，亦未繘井，赢其瓶，凶。",
            data: [
                { context: "初六：井泥不食，旧井无禽。" },
                { context: "九二：井谷射鲋，瓮敝漏。" },
                { context: "九三：井渫不食，为我心恻，可用汲。王明，并受其福。" },
                { context: "六四：井渫无咎。" },
                { context: "九五：井冽，寒泉食。" },
                { context: "上六：井收勿幕，有孚元吉。" },
            ],
        }, {
            title: "坎为水 -- 坎，习坎有孚维心，亨，行有尚。",
            data: [
                { context: "初六：习坎，入于坎窞，凶。" },
                { context: "九二：坎有险，求小得。" },
                { context: "六三：来之坎，坎险阻枕。入于坎窞，勿用。" },
                { context: "六四：樽酒，簋贰，用缶。纳约自牖，终无咎。" },
                { context: "九五：坎不盛，祗既平，无咎。" },
                { context: "上六：系用微纆，置于丛棘，三岁不得，凶。" },
            ],
        }, {
            title: "水山蹇 -- 蹇，利西南，不利东北，利见大人，贞吉。",
            data: [
                { context: "初六：往蹇，来誉。" },
                { context: "六二：王臣蹇蹇，匪躬之故。" },
                { context: "九三：往蹇，来反。" },
                { context: "六四：往蹇，来连。" },
                { context: "九五：大蹇，朋来。" },
                { context: "上六：往蹇，来硕，吉。利见大人。" },
            ],
        }, {
            title: "水地比 -- 比，吉。原筮，元永贞，无咎。不宁方来，后夫凶。",
            data: [
                { context: "初六：有孚比之，无咎。有孚盈缶，终来有它，吉。" },
                { context: "六二：比之自内，贞吉。" },
                { context: "六三：比之匪人。" },
                { context: "六四：外比之，贞吉。" },
                { context: "九五：显比，王用三驱，失前禽。邑人不诫，吉。" },
                { context: "上六：比之无首，凶。" },
            ],
        }, {
            title: "山天大畜 -- 大畜，利贞。不家食、吉。利涉大川。",
            data: [
                { context: "初九：有厉，利已。" },
                { context: "九二：舆说輹。" },
                { context: "九三：良马逐，利艰贞。曰闲舆卫，利有攸往。" },
                { context: "六四：童牛之捁，元吉。" },
                { context: "六五： 豮豕之牙，吉。" },
                { context: "上九：何天之衢，亨。" },
            ],
        }, {
            title: "山泽损 -- 损，有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。",
            data: [
                { context: "初九：巳事端往，无咎；酌损之。" },
                { context: "九二：利贞，征凶，弗损，益之。" },
                { context: "六三：三人行则损一人，一人行则得其友。" },
                { context: "六四：换其疾，使遄有喜，无咎。" },
                { context: "六五：或益之十朋之龟，弗克违，元吉。" },
                { context: "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。" },
            ],
        }, {
            title: "山火贲 -- 贲，亨，小利有攸往。",
            data: [
                { context: "初九：贲其趾，舍车而徒。" },
                { context: "六二：贲其须。" },
                { context: "九三：贲如濡如，永贞吉。" },
                { context: "六四：贲如皤如，白马翰如，匪寇婚媾。" },
                { context: "六五：贲于丘园，束帛戈戈，吝，终吉。" },
                { context: "上九：白贲，无吝。" },
            ],
        }, {
            title: "山雷颐 -- 颐，贞吉。观颐，自求口实。",
            data: [
                { context: "初九：舍尔灵龟，观我朵颐，凶。" },
                { context: "六二：颠颐，拂经，于丘颐，征凶。" },
                { context: "六三：拂颐，贞凶，十年勿用，无莜利。" },
                { context: "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。" },
                { context: "六五：拂经，居贞，吉，不可涉大川。" },
                { context: "上九：由颐，厉，吉，利涉大川。" },
            ],
        }, {
            title: "山风蛊 -- 蛊，元亨，利涉大川，先甲三日，后甲三日。",
            data: [
                { context: "初六：干父之蛊，有子，考无咎。厉，终吉。" },
                { context: "九二：干母之蛊，不可贞。" },
                { context: "九三：干父之蛊，小有悔，无大咎。" },
                { context: "六四：裕父之蛊，往见吝。" },
                { context: "六五：干父之蛊，用誉。" },
                { context: "上九：不事王侯，高尚其事。" },
            ],
        }, {
            title: "山水蒙 -- 蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
            data: [
                { context: "初六：发蒙，利用刑人，用说桎梏，以往吝。" },
                { context: "九二：包蒙吉，纳妇吉，子克家。" },
                { context: "六三：勿用取女，见金夫，不有躬，无攸利。" },
                { context: "六四：困蒙，吝。" },
                { context: "六五：童蒙，吉。" },
                { context: "上九：击蒙。不利，为寇；利，御寇。" },
            ],
        }, {
            title: "艮为山 -- 艮其背，不获其身，行其庭，不见其人，无咎。",
            data: [
                { context: "初六：艮其趾，无咎，利永贞。" },
                { context: "六二：艮其腓，不拯其随，其心不快。" },
                { context: "九三：艮其限，列其夤，厉熏心。" },
                { context: "六四：艮其身，无咎。" },
                { context: "六五：艮其辅，言有序，悔亡。" },
                { context: "上六：敦艮，吉。" },
            ],
        }, {
            title: "山地剥 -- 剥，不利有攸往。",
            data: [
                { context: "初六：剥床以足，蔑贞，凶。" },
                { context: "六二：剥床以辨，蔑贞，凶。" },
                { context: "六三：剥之，无吝。" },
                { context: "六四：剥床以肤，凶。" },
                { context: "六五：贯鱼以宫人宠，无不利。" },
                { context: "上九：硕果不食，君子得舆，小人剥庐。" },
            ],
        }, {
            title: "地天泰 -- 泰，小往大来，吉，亨。",
            data: [
                { context: "初九：拔茅茹以其汇，征吉。" },
                { context: "九二：包荒，用冯河。不遐遗，朋亡，得尚于中行。" },
                { context: "九三：无平不陂，无往不复。艰贞无咎，勿恤其孚，于食有福。" },
                { context: "九四：六四：翩翩，不富以其邻，不戒以孚。或跃在渊，无咎。" },
                { context: "六五：帝乙归妹以祉，元吉。" },
                { context: "上六：城复于隍，勿用师，自邑告命。贞吝。" },
            ],
        }, {
            title: "地泽临 -- 临，元亨，利贞。至于八月有凶。",
            data: [
                { context: "初九：咸临，贞吉。" },
                { context: "九二：咸临，吉，无不利。" },
                { context: "六三：甘临，无攸利，既忧之，无咎。" },
                { context: "六四：至临，无咎。" },
                { context: "六五：知临，大君之宜，吉。" },
                { context: "上六：敦临，吉，无咎。" },
            ],
        }, {
            title: "地火明夷 -- 明夷，利艰贞。",
            data: [
                { context: "初九：明夷于飞，垂其翼，君子于行，三日不食，有攸往，主人有言。" },
                { context: "六二：明夷,夷于左股，用拯马壮，吉。" },
                { context: "九三：明夷于南狩，得其大首，不可疾贞。" },
                { context: "六四：入于左腹，获明夷之心，于出门庭。" },
                { context: "六五：箕子之明夷，利贞。" },
                { context: "上六：不明晦，初登于天，后入于地。" },
            ],
        }, {
            title: "地雷复 -- 复，亨，出入无疾，朋来，无吝。反复其道，七日来复，利有攸往。",
            data: [
                { context: "初九：不远复，无祗悔，无吉。" },
                { context: "六二：休复，吉。" },
                { context: "六三：频复，厉，无咎。" },
                { context: "六四：中行独复。" },
                { context: "六五：敦复，无悔。" },
                { context: "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年不克征。" },
            ],
        }, {
            title: "地风升 -- 升，元亨，用见大人，勿恤，南征吉。",
            data: [
                { context: "初六：允升，大吉。" },
                { context: "九二：孚乃利用禴，无咎。" },
                { context: "九三：升虚邑。" },
                { context: "六四：王用享于岐山，吉，无咎。" },
                { context: "六五：贞吉，升阶。" },
                { context: "上六：冥升，利于不息之贞。" },
            ],
        }, {
            title: "地水师 -- 师，贞丈人。吉，无咎。",
            data: [
                { context: "初六：师出以律，否藏凶。" },
                { context: "九二：在师中，吉，无咎。王三锡命。" },
                { context: "六三：师或舆尸，凶。" },
                { context: "六四：师左次，无咎。" },
                { context: "六五：田有禽，利执言，无吝。长子帅师，弟子舆尸，贞凶。" },
                { context: "上六：大君有命，开国承家，小人勿用。" },
            ],
        }, {
            title: "地山谦 -- 谦，亨，君子有终。",
            data: [
                { context: "初六：谦谦君子，用涉大川，吉。" },
                { context: "六二：鸣谦，贞吉。" },
                { context: "九三：劳谦，君子有终，吉。" },
                { context: "六四：无不利，撝谦。" },
                { context: "六五：不富以其邻，利用侵伐，无不利。" },
                { context: "上六：鸣谦，利用行师，征邑国。" },
            ],
        }, {
            title: "坤为地 -- 坤，元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。",
            data: [
                { context: "初六：履霜，坚冰至。" },
                { context: "六二：直方大，不习无不利。" },
                { context: "六三：含章可贞。或从王事，无成有终。" },
                { context: "六四：括囊，无咎、无誉。" },
                { context: "六五：黄裳元吉。" },
                { context: "上六：龙战于野，其血玄黄。" },
                { context: "用六：利永贞。" },
            ],
        },]
    }
    ]
}
data = [demo]

