var demo = {
    title: "周易口诀",
    name: "周易口诀",
    data: [{
        title: "八卦方位的五行口诀",
        data: [
            { context: "乾三连、坤六断;离中虚、坎中满;震仰盂、艮覆碗;兑上缺，巽下断。" },
            { context: "乾三连西北开天;(乾卦是三横相连接的，八卦方位在西北方，代表天的符号，开天辟地嘛，故先天数为1。)" },
            { context: "坤六断西南八地。(坤卦是三横中间断为六个小段，八卦方位在西南方，代表地的符号，万物生长于地，归于地，故先天数为8。)" },
            { context: "兑上缺西方双泽;(兑卦是三横上一横缺个口，八卦方位在正西方，代表泽的符号，先天数为2。)" },
            { context: "巽下断东南无风。(巽卦是三横下一横断开，八卦方位在东南方，代表风的符号，先天数为5。)" },
            { context: "艮覆碗东北齐山;(艮卦是三横上一横是实的，下两横是虚的，象打翻的碗那样，八卦方位在东北，代表山的符号，东北方总是山比较多，齐同七，先天数为7。)" },
            { context: "震仰孟东方四雷。(震卦是三横下一横是实的，上两横是虚的，象钵盂那样，八卦方位在正东方，代表雷的符号，先天数为4。)" },
            { context: "离中虚南方真火;(离卦是三横中间那横是虚的，上下两横是实的，八卦方位在正南方，代表火的符号，三昧真火，故先天数为3。)" },
            { context: "坎中满北方六水。(坎卦是三横中间那横是实的，上下两横是虚的，八卦方位在正北方，代表水的符号，先天数为6。)" },
            { context: "八卦相错重叠生;(八卦其实就是由这八个符号两个相重叠而来，八八六十四卦。)" },
            { context: "六十四卦化万象。(虽然只有64卦，就象人体遗传基因的64个密码一样，能代表宇宙万物。)" },
            { context: "天地造化定乾坤;(天在上，地在下，天地运转使万物得以生长繁衍，这是总纲。)" },
            { context: "雷厉风行必相薄。(雷和风往往会同时出现，薄是接近的意思，代表顺畅，快速的含义。)" },
            { context: "山泽相连可通气;(山和泽在一起必是好风水，因为山之势、水之气，相辅相成。)" },
            { context: "水火相克不相射。(水和火相克，看起来不相融，但从另外一个角度看，白天太阳在天空，而晚上月亮在天空，相互轮转，不相互照射，都各自运行不息，是再自然不过的现象了。)" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "八卦方位的五行口诀",
        data: [
            { context: "人不为己天地灭;(人只要不自私，不只是为了自己谋福利，他可以放心的去做任何事情，天地都没了，天地都管不了你。)" },
            { context: "信口开河可通神。(只要你的心能相信的话，随便你怎么说，所预测的结果都是准确的，是和神灵所相通的。)" },
            { context: "言词表达需注意;(在说话的时候语言表达很重要，要把不好听的说好听，把好听的说的动听。比如你想说这个人很胖，你要说他身体好、有福相、讨人喜欢;比如你想说这个人很瘦，你要说他很精干，精神好;比如你想说一个人和老婆身高不般配，一个很高，一个很矮，你要说阴阳平衡。等......)" },
            { context: "恰如其分通天理。(在那样的环境或磁场内，不加一分也不减一分，加一分，过了，减一分，不够，说的恰到好处，说的对方不断的点头就好。这和天的道理是一样的。)" },
            { context: "两两相克叫制约;(当你说到五行相克的时候，要以制约、控制约束、平衡制约来表达。)" },
            { context: "生生不息为有利。(当你说五行相生的时候，要以源源不断的帮助、有利、有好处等来表达。)" },
            { context: "阴阳重叠必相吸;(当五行有阴阳性质的时候，要说相互之间的联系很深，是相吸引的。)" },
            { context: "同类比和阴阳理。(当五行阴阳性质相同时，要以物以类聚、人以群分来打比喻。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [
            { context: "象中有数数中理;(万事万物的现象之中，一定存在着定数12345678......，而定数之中又包含道理：五行生克制化。)" },
            { context: "以道观象明数理。(我们观察事物时要以道(自然的真理)来看，从而知道了这些现象中的定数与五行生克制化。)" },
            { context: " 以理言事真无比;(然后以五行生克制化的理来判断事物，把结果表达出来，就是预测的正确结果。)" },
            { context: "不可不信妙无许。(学会了这些道理，是妙不可言的，就像掌握了未来那样，很是自在。)" },
            { context: "心若无欲心则灵;(在预测时，心中如果没有任何的贪婪与自私的话，心就一定灵验，心所想的就是准确的预测结果。)" },
            { context: "心无挂碍言出行。(在判断事物时，不要怀疑自己，放心，没有任何的障碍，说出来一定会应验。)" },
            { context: "法外无法无定法;(预测方法就这么简单，完全是在易经范畴之内的，但方法也不是固定的，要活学活用啊。)" },
            { context: "不拘古法心为法。(不要拘泥于原先人们的那些预测的方法，以自己的心为主才是好方法。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "注意事项：",
        data: [
            { context: "心血来潮读易经;(我读易经是心血来潮读的，这里主要是读《易传》，易传是易经的解释，又称十翼，是给易经装的十支翅膀，毕竟易经是上古人士作的，我们看不懂，也不必看懂，只要理解了易传的含义，把握其中的精华所在，然后和自己的体悟融会贯通，但一定要熟记64卦的挂名就可以了。易经一定有它简易的一面，我们就从简单的入手就好。)" },
            { context: "读懂易经神来到。(其实，读懂易传足够了，根本就不必去再读易经原文了，就像自己就是神仙那样，很舒服自在。)" },
            { context: "顺手拈来八卦象;(预测未来完全是任凭心血来潮、随意找出卦象来。)" },
            { context: "鬼使神差不枉然。(就算是写错了八卦，搞错了卦理，说出来的结果也是准确的，就这么怪。)" },
            { context: "世间本无善与恶;(其实啊，人世间并没有善与恶的分别，只是人们自己分开来的。)" },
            { context: "因果循环天理合。(宇宙间只有因果的天理在循环。)" },
            { context: "吉中有凶凶藏吉;(其实，所有的事物皆是如此，好事情中总是有不完美的地方，坏事情中也有好的地方。)" },
            { context: "居安思危便化无。(如果能做到顺境中考虑到逆境会到来的话，做好预防措施，逆境就永远不会来到，凶也能化为吉了。)" },
        ]
    },
    ]
}
data = [demo]

/**
 * 
 * 
上谥法
神　圣　贤　文　武　成　康　献　懿　元　章　僖（釐）景　宣　明　昭　正　敬　恭　庄　肃　穆　戴　翼　襄　烈　桓　威　勇　毅　克　庄　圉（御）魏　安　定　简　贞　节　白　匡　质　靖　真　顺　思　考　皓　显　和　元　高　光　大　英　睿　博　宪　坚　孝　忠　惠　德　仁　智　慎　礼　义　周　敏　信　达　宽　理　凯　清　直　钦　益　良　度　类　基　慈　齐　深　温　让　密　厚　纯　勤　谦　友　祁　广　淑　俭　灵　荣　厉　比　絜　舒　贲　逸　退　讷　偲　逑　懋　宜　哲　察　通　仪　经　庇　协　端　休　悦　绰　容　确　恒　熙　洽　绍　世　果　太 崇
上百三十一谥，用之君亲焉，用之君子焉。
中谥法
怀、悼、愍（亦作闵、湣）、哀、隐、幽、冲、夷、惧、息、携、恤、愿、儆。
上十四谥，用之闵伤焉，用之无后者焉。
下谥法
野、夸、躁、伐、荒、炀、戾、刺、虚、荡、墨、亢、千、褊、专、轻、苛、介、暴、虐、愎、悖、凶、慢、忍、毒、恶、残　奰、攘、顽、昏、骄、酗、湎、侥、狃、侈、惑、靡、溺、伪、妄、讟、谄、诬、诈、谲、诡、奷、邪、慝、蛊、危、圮、懦、挠、覆、败、斁、疵、饕、费。


哀：早孤短折曰哀；恭仁短折曰哀；德之不建曰哀；遭难已甚曰哀；处死非义曰哀
安：好和不争曰安；兆民宁赖曰安；宽容平和曰安；宽裕和平曰安；所保惟贤曰安；中心宅仁曰安；修己宁民曰安；务德不争曰安；庄敬尽礼曰安；敬而有礼曰安；貌肃辞定曰安；止于义理曰安；恭德不劳曰安；静正不迁曰安；懿恭中礼曰安；凝重合礼曰安
比：择善而从曰比；事君有党曰比
成：安民立政曰成；刑民克服曰成；佐相克终曰成；制义克服曰成；礼乐明具曰成；持盈守满曰成；遂物之美曰成；通达强立曰成；经德秉德曰成；民和神福曰成；道兼圣智曰成；夙夜警戒曰成；曲直赴礼曰成；仁化纯被曰成；不忘久要曰成；德备礼乐曰成；德见于行曰成；久道化隆曰成；内德纯备曰成；坤宁化洽曰成
诚：纯德合天曰诚；从容中道曰诚；推心御物曰诚；秉德纯一曰诚；明信率下曰诚；肫笃无欺曰诚；实心施惠曰诚
冲：幼少在位曰冲；幼少短折曰冲
崇：能修其官曰崇
纯：中正精粹曰纯；见素抱朴曰纯；安危一心曰纯；志虑忠实曰纯；至诚无息曰纯；内心和一曰纯；治理精粹曰纯
慈：视民如子曰慈；爱育必周曰慈；抚柔平恕曰慈
聪：声入心通曰聪；迩言必察曰聪
达：质直好义曰达；疏通中理曰达
大：则天法尧曰大
戴：爱民好治曰戴；典礼不愆曰戴
荡：好内远礼曰荡；狂而无据曰荡
悼：肆行劳祀曰悼；中年早夭曰悼；恐惧从处曰悼；未中早夭曰悼
道：以德化民曰道
德：绥柔士民曰德；谏争不威曰德；谋虑不威曰德；贵而好礼曰德；忠和纯备曰德；绥怀来人曰德；强直温柔曰德；勤恤民隐曰德；忠诚上实曰德；辅世长民曰德；宽众忧役曰德；刚塞简廉曰德；惠和纯淑曰德；富贵好礼曰德；功成民用曰德；修文来远曰德；睿智日新曰德；善政养民曰德；尊贤亲亲曰德；仁而有化曰德；忧在进贤曰德；宽栗扰毅曰德；直温强义曰德；谏诤不违曰德；周旋中礼曰德；泽及遐外曰德；懿修罔懈曰德
丁：述善不克曰丁；述义不悌曰丁；迷而不悌曰丁
鼎：追改前过曰鼎
定：大虑静民曰定；安民大虑曰定；纯行不爽曰定；安民法古曰定；纯行不二曰定；追补前过曰定；仁能一众曰定；嗣成武功曰定；践行不爽曰定；审于事情曰定；德操纯固曰定；以劳定国曰定；克绥邦家曰定；静正无为曰定；大应慈仁曰定；义安中外曰定；镇静守度曰定
度：心能制义曰度；进退可轨曰度；守法纬民曰度；从容有常曰度；礼仪咨善曰度；宽裕有容曰度；创制垂法曰度；懿徽足式曰度
端：守礼执义曰端；圣修式化曰端；严恭莅下曰端；恭己有容曰端；秉心贞静曰端；守礼自重曰端
敦：善行不怠曰敦；温仁忠厚曰敦；能记国善曰敦；温仁厚下曰敦；笃亲睦族曰敦；树德纯固曰敦
干：犯国之纪曰干
刚：追补前过曰刚；强毅果敢曰刚；致果杀敌曰刚；强而能断曰刚；自强不息曰刚；政刑明断曰刚；威强不屈曰刚；强义果敢曰刚
高：德覆万物曰高；功德盛大曰高；覆帱同天曰高
革：献敏成行曰革
公：立志及众曰公
恭：尊贤贵义曰恭；敬事供上曰恭；尊贤敬让曰恭；既过能改曰恭；执事坚固曰恭；爱民长弟曰恭；执礼御宾曰恭；芘亲之阙曰恭；尊长让善曰恭；渊源流通曰恭；夙夜敬事曰恭；知过能改曰恭；贤而不伐曰恭；率事以信曰恭；不懈于位曰恭；卑以自牧曰恭；不懈于德曰恭；治典不易曰恭；责难于君曰恭；正德美容曰恭；不懈为德曰恭；正己接物曰恭；昭事不忒曰恭；勤恤民隐曰恭；庄以莅下曰恭；谦和不懈曰恭；逊顺事上曰恭
光：功格上下曰光；能绍前业曰光；居上能谦曰光；功烈耿着曰光
广：美化及远曰广；所闻能行曰广
果：好力致勇曰果；好学近智曰果；临事善断曰果
暠：综善典法曰暠
和：不刚不柔曰和；推贤让能曰和；柔远能迩曰和；号令悦民曰和；敦睦九族曰和；怀柔胥洽曰和；温厚无苛曰和
厚：思虑不爽曰厚；强毅敦朴曰厚；敦仁爱众曰厚
胡：弥年寿考曰胡；保民耆艾曰胡；保民畏惧曰胡；
怀：执义扬善曰怀；慈仁短折曰怀；慈仁知节曰怀；失位而死曰怀；慈仁哲行曰怀；民思其惠曰怀
桓：辟土服远曰桓；克敬勤民曰桓；辟土兼国曰桓；武定四方曰桓；克亟成功曰桓；克敌服远曰桓；能成武志曰桓；壮以有力曰桓；
荒：凶年无谷曰荒；外内从乱曰荒；好乐怠政曰荒；昏乱纪度曰荒；从乐不反曰荒；狎侮五常曰荒
徽：元德充美曰徽
惠：柔质慈民曰惠；爱民好与曰惠；柔质爱课曰惠；柔质受谏曰惠；施勤无私曰惠；慈仁好与曰惠；爱民好学曰惠；宽裕慈仁曰惠；和而不流曰惠；慈哲远识曰惠；能绥四方曰惠；子爱困穷曰惠；俭以厚下曰惠；淑质受谏曰惠；恩能及下曰惠；宽裕不苛曰惠；遗爱在民曰惠；分人以财曰惠；利而不费曰惠；抚字心殷曰惠；兴利裕民曰惠；德威可怀曰惠；泽及万世曰惠；仁恕中存曰惠；慈恩广被曰惠
惑：满志多穷曰惑；以欲忘道曰惑；淫溺丧志曰惑；妇言是用曰惑；夸志多穷曰惑
基：德性温恭曰基
坚：彰义掩过曰坚；磨而不磷曰坚
俭：菲薄废礼曰俭；节以制度曰俭；举事有经曰俭
简：一德不懈曰简；平易不訾曰简；治典不杀曰简；正直无邪曰简；易从有功曰简；平易无疵曰简；至德临下曰简；仕不躁进曰简；能行直道曰简；执要能固曰简
节：好廉自克曰节；不侈情欲曰节；巧而好度曰节；能固所守曰节；谨行节度曰节；躬俭中礼曰节；直道不挠曰节；临义不夺曰节；艰危莫夺曰节
介：执一不迁曰介
景：由义而济曰景；耆意大虑曰景；布义行刚曰景；致志大图曰景；繇义而成曰景；德行可仰曰景；法义而齐曰景；明照旁周曰景
敬：夙夜警戒曰敬；令善典法曰敬；夙夜恭事曰敬；象方益平曰敬；象方益年曰敬；夙兴夜寐曰敬；众方克就曰敬；齐庄中正曰敬；广直勤正曰敬；廉直劲正曰敬；难不忘君曰敬；受命不迁曰敬；畏天爱民曰敬；陈善闭邪曰敬；威仪悉备曰敬；戒尊师傅曰敬；戒惧无违曰敬；小心恭事曰敬；戒慎几微曰敬；肃恭无怠曰敬；齐庄自持曰敬；应事无慢曰敬
靖：柔德安众曰靖；恭己鲜言曰靖；宽乐令终曰靖；柔德教众曰靖；柔直考终曰靖；虚己鲜言曰靖；缉熙宥密曰靖；式典安民曰靖；仁敬鲜言曰靖；慎以处位曰靖；政刑不扰曰靖；纲纪肃布曰靖；厚德安贞曰靖；律身恭简曰靖；以德安众曰靖
开：信道轻仕曰开
凯：中心乐易曰凯
康：渊源流通曰康；温柔好乐曰康；安乐抚民曰康；合民安乐曰康；丰年好乐曰康；安乐治民曰康；好乐怠政曰康；能安兆民曰康；俊民用章曰康；久膺多福曰康；寿考且宁曰康；保民迪吉曰康；务德不争曰康；宽裕和平曰康；敬而有礼曰康；保卫社稷曰康；造道自行曰康；动而无妄曰康；温柔好善曰康；思善无逸曰康；温良好学曰康；视履安和曰康
考：大虑行节曰考；秉德不回曰考
克：爱民在刑曰克；秉义行刚曰克；胜敌得俊曰克；胜己之私曰克；
宽：含光得众曰宽；大德包蒙曰宽；御众不近曰宽
匡：贞心大度曰匡；以法正国曰匡；辅弼王室曰匡；弥缝灾害曰匡；正君之过曰匡
旷：审音知化曰旷
类：施勤无私曰类；勤政无私曰类；不忝前哲曰类
礼：奉义顺则曰礼；恭俭庄敬曰礼；善自防间曰礼；躬俭中节曰礼；审节而和曰礼；着诚去伪曰礼；纳民轨物曰礼；恭俭合度曰礼；内则克修曰礼
理：才理审谛曰理；政平刑肃曰理；措正施行曰理；表章道术曰理；才敏详审曰理；治繁不扰曰理
厉（刺）：杀戮无辜曰厉；暴虐无亲曰厉；愎狠无礼曰厉；扶邪违正曰厉；长舌阶祸曰厉；不思忘爱曰刺；复狠遂过曰刺；暴戾无亲曰刺；暴慢九卿曰刺；不思安乐曰刺
戾：不悔前过曰戾；不思顺受曰戾；知过不改曰戾
良：温良好乐曰良；理顺习善曰良；小心敬事曰良；温敬寡言曰良；孝悌成性曰良；小心敬畏曰良；谋猷归美曰良；竭忠无隐曰良；宅衷易直曰良
烈：有功安民曰烈；秉德遵业曰烈；圣功广大曰烈；海外有截曰烈；业成无兢曰烈；光有大功曰烈；戎业有光曰烈；刚正曰烈；宏济生民曰烈；庄以临下曰烈
灵：不勤成名曰灵；死而志成曰灵；死见神能曰灵；乱而不损曰灵；好祭鬼神曰灵；极知鬼神曰灵；不遵上命曰灵；德之精明曰灵
懋：以德受官曰懋；以功受赏曰懋
密：追补前过曰密；思虑详审曰密
闵：慈仁不寿曰闵；在国遭忧曰愍；在国逢艰曰愍；祸乱方作曰愍；使民悲伤曰愍；使民折伤曰愍；在国连忧曰愍；佐国逢难曰愍；危身奉上曰愍（一般和愍混用）
敏：应事有功曰敏；明作有功曰敏；英断如神曰敏；明达不滞曰敏；闻义必徙曰敏；才猷不滞曰敏；好古不怠曰敏
明：照临四方曰明；谮诉不行曰明；思虑果远曰明；保民耆艾曰明；任贤致远曰明；总集殊异曰明；独见先识曰明；能扬仄陋曰明；察色见情曰明；容义参美曰明；无幽不察曰明；圣能作则曰明；令闻不已曰明；奉若天道曰明；遏恶扬善曰明；视能致远曰明；内治和理曰明；诚身自知曰明；守静知常曰明；至诚先觉曰明；远虑防微曰明；懿行宣着曰明；智能晰理曰明；昭晰群性曰明
缪：名与实爽曰缪；伤人蔽贤曰缪；蔽仁伤善曰缪
穆：布德执义曰穆；中情见貌曰穆；贤德信修曰穆；德政应和曰穆；敬和在位曰穆；德化肃和曰穆；圣敬有仪曰穆；粹德深远曰穆；肃容持敬曰穆；容仪肃敬曰穆
宁：裕以安民曰宁；渊衷湛一曰宁；端重自毖曰宁
彭：述而不作曰彭；信而好古曰彭
平：治而无眚曰平；执事有制曰平；惠内无德曰平；治而清省曰平；布纲治纪曰平；克定祸乱曰平；理而无责曰平；布德均政曰平；无常无偏曰平；治道如砥曰平；分不求多曰平；政以行辟曰平；推心行恕曰平
齐：执心克庄曰齐；资辅共就曰齐；轻輶恭就曰齐；执正克庄曰齐
祁：治典不杀曰祁；经典不易曰祁；治定不陂曰祁
迁：博物多爱曰迁；良史实录曰迁
强：和而不流曰强；中立不倚曰强；守道不变曰强；死不迁情曰强；自胜其心曰强。梁光禄大夫江革谥“强”。
钦：威仪悉备曰钦；敬事节用曰钦；克慎成宪曰钦；肃敬而承上曰钦；夙夜祗畏曰钦；敬慎万几曰钦；神明俨翼曰钦；小心励翼曰钦；寅恭供职曰钦
勤：温年好乐曰勤；能修其官曰勤；服劳无怨曰勤；广业不怠曰勤；勤行世业曰勤；好学力行曰勤；能修内职曰勤；夙夜匪懈曰勤；宣劳中外曰勤
清：避远不义曰清；洁己自爱曰清；洁己奉法曰清
顷：甄心动惧曰顷；敏以敬慎曰顷；祗勤追惧曰顷；慈仁和敏曰顷；堕覆社稷曰顷；震动过惧曰顷；阴靖多谋曰顷
悫：行见中外曰悫；执德不惑曰悫；诚以致志曰悫；表里如一曰悫；诚心中孚曰悫；率真御下曰悫
确：执德不惑曰确；执德不回曰确
让：推功尚善曰让；德性宽柔曰让
仁：蓄义丰功曰仁；慈民爱物曰仁；克己复礼曰仁；贵贤亲亲曰仁；杀身成仁曰仁；能以国让曰仁；利泽万世曰仁；率性安行曰仁；功施于民曰仁；屈己逮下曰仁；度功而行曰仁；宽信敏惠曰仁；爱仁立物曰仁；体元立极曰仁；如天好生曰仁；教化溥浃曰仁；慈心为质曰仁；惠爱溥洽曰仁
荣：宠禄光大曰荣；先义后利曰荣
容：宽裕温柔曰容
柔：顺德丽贞曰柔；至顺法坤曰柔
睿：克念作圣曰睿；深思远虑曰睿；圣知通微曰睿；虑周事表曰睿
伤：未家短折曰伤；短折不成曰伤；短折不成曰殇；未家短折曰殇；童蒙短折曰殇（谥号中一般写作殇）
商：昭功宁民曰商；文学博识曰商
绍：疏远继位曰绍
深：秉心塞渊曰深
神：民无能名曰神；壹民无为曰神；安仁立政曰神；物妙无方曰神；圣不可知曰神；阴阳不测曰神；治民无为曰神；应变远方、不疾而速曰神；能妙万物曰神；道化宜民曰神；显仁藏用曰神；则天广运曰神
慎：敏以敬曰慎；沉静寡言曰慎；思虑深远曰慎；谨饬自持曰慎；夙夜敬畏曰慎；小心克勤曰慎
声：不生其国曰声；不主其国曰声
圣：扬善赋简曰圣；敬宾厚礼曰圣；虚己从谏曰圣；敬祀亨礼曰圣；行道化民曰圣；穷理尽性曰圣；穷神知化曰圣；通达先知曰圣；大而化之曰圣；博施济众曰圣；极深研几曰圣；能听善谋曰圣；裁成天地曰圣；睿智天纵曰圣；百姓与能曰圣；备物成器曰圣；备道全美曰圣；神化难名曰圣
胜：容仪恭美曰胜
世：承命不迁曰世；景物四方曰世；贻庥奕叶曰世
淑：言行不回曰淑；虑善从宜曰淑；温仁咸仰曰淑；善行着闻曰淑
舒：举事而迟曰舒；言行轨物曰舒
庶：心能制义曰庶
顺：慈和遍服曰顺；慈仁和民曰顺；柔质慈惠曰顺；和比于理曰顺；德合帝则曰顺；受天百禄曰顺；柔德承天曰顺；德性宽柔曰顺；淑慎其身曰顺；德容如玉曰顺；克将君美曰顺；好恶公正曰顺；德协自然曰顺
舜：仁圣盛明曰舜
思：道德纯一曰思；大省兆民曰思；外内思索曰思；追悔前过曰思；不眚兆民曰思；谋虑不衍曰思；柔能自勉曰思；通明爽愿曰思；深虑道远曰思；念终如始曰思；辟土兼国曰思；追悔前愆曰思
肃：刚德克就曰肃；执心决断曰肃；威德克就曰肃；正己摄下曰肃；能执妇道曰肃；好德不怠曰肃；貌敬行祗曰肃；刚德克服曰肃；身正人服曰肃；法度修明曰肃；严畏自饬曰肃；摄下有礼曰肃；貌恭心敬曰肃：达礼蔽乐曰素
太：克启行禩曰太
泰：循礼安舒曰泰；临政无慢曰泰
通：物至能应曰通；事起而辨曰通
威：猛以刚果曰威；强毅信正曰威；服叛怀远曰威；强毅执政曰威；赏劝刑怒曰威；以刑服远曰威；蛮夷率服曰威；信赏必罚曰威；德威可畏曰威；声灵震叠曰威；庄以临下曰威；
温：德性宽柔曰温；和顺可即曰温；仁良好礼曰温；乐育群生曰温；宽仁惠下曰温
文：经纬天地曰文；道德博闻曰文；慈惠爱民曰文；愍民惠礼曰文；赐民爵位曰文；勤学好问曰文；博闻多见曰文；忠信接礼曰文；能定典礼曰文；经邦定誉曰文；敏而好学曰文；施而中礼曰文；修德来远曰文；刚柔相济曰文；修治班制曰文；德美才秀曰文；万邦为宪曰文；帝德运广曰文；坚强不暴曰文；徽柔懿恭曰文；圣谟丕显曰文；化成天下曰文；纯穆不已曰文；克嗣徽音曰文；敬直慈惠曰文；与贤同升曰文；绍修圣绪曰文；声教四讫曰文
武：刚强直理曰武；威强敌德曰武；克定祸乱曰武；刑民克服曰武；夸志多穷曰武；威强睿德曰武；除伪宁真曰武；威强恢远曰武；帅众以顺曰武；保大定功曰武；刚强以顺曰武；辟土斥境曰武；折冲御侮曰武；除奸靖难曰武；拓地开封曰武；肃将天威曰武；安民和众曰武；克有天下曰武；睿智不杀曰武；恤民除害曰武；赴敌无避曰武；德威遐畅曰武；
息：谋虑不成曰息
熙：允僖庶绩曰熙；敬德光明曰熙；隆称赫奕曰熙
僖（釐）：小心畏忌曰僖；质渊受谏曰僖；有罚而还曰僖；刚克曰僖；有过曰僖；慈惠爱亲曰僖；小心恭慎曰僖；乐闻善言曰僖；恭慎无过曰僖
熹：有功安人曰熹
贤：仁义合道曰贤；宠至益戒曰贤；行义合道曰贤；明德有成曰贤；内治隆备曰贤；内德有成曰贤
显：行见中外曰显；受禄于天曰显；圣德昭临曰显；百辟惟刑曰显；有光前烈曰显；中外仰德曰显；德美宣昭曰显
宪：博闻多能曰宪；赏善罚恶曰宪；行善可记曰宪；在约纯思曰宪；圣能法天曰宪；圣善周达曰宪；创制垂法曰宪；刑政四方曰宪；文武可法曰宪；聪明法天曰宪；表正万邦曰宪；懿行可纪曰宪；仪范永昭曰宪
献：博闻多能曰献；惠而内德曰献；智哲有圣曰献；聪明睿智曰献；文资有成曰献；敏惠德元曰献；圣哲有谋曰献；贤德有成曰献；智能翼君曰献；学该古训曰献；智质有理曰献；智质有操曰献；智质有礼曰献
襄：辟地有德曰襄；甲胄有劳曰襄；因事有功曰襄；执心克刚曰襄；协赞有成曰襄；威德服远曰襄
向：简易多闻曰向
孝：五宗安之曰孝；慈惠爱亲曰孝；秉德不回曰孝；协时肇享曰孝；大虑行节曰孝；慈惠爱民曰孝；慈爱忘劳曰孝；从命不违曰孝；善事父母曰孝；遵义安仁曰孝；几谏不倦曰孝；姻睦其党曰孝；博于备养曰孝；敬慎所安曰孝；尊仁爱义曰孝；能养能恭曰孝；干蛊用誉曰孝；继志成事曰孝；践修世德曰孝；丕承先志曰孝；博施被物曰孝；教刑四海曰孝；德通神明曰孝；先意承志曰孝；能奉祭祀曰孝；志不忘亲曰孝；富贵不骄曰孝；德加百姓曰孝；徽音克嗣曰孝
信：守命共时曰信；出言可复曰信；周仁承命曰信；守礼不违曰信；宽仁孚众曰信；政令划一曰信
修：勤其世业曰修；好学近习曰修；克勤世业曰修
虚：凉德薄礼曰虚；华言无实曰虚
宣：圣善周闻曰宣；施而不成曰宣；善问周达曰宣；施而不秘曰宣；诚意见外曰宣；重光丽日曰宣；义问周达曰宣；能布令德曰宣；浚达有德曰宣；力施四方曰宣；哲惠昭布曰宣；善闻式布曰宣
玄：含和无欲曰玄；应真主神曰玄
逊：谦和善让曰逊
炀：好内远礼曰炀；去礼远众曰炀；好内怠政曰炀；肆行劳神曰炀；去礼远正曰炀；逆天虐民曰炀
尧：翼善传圣曰尧；大而难名曰尧
野：质胜其文曰野；敬而不中礼曰野
仪：善行足法曰仪
夷：克杀秉政曰夷；安心好静曰夷；隐居求志曰夷；失礼基乱曰夷
义：制事合宜曰义；见利能终曰义；先君后己曰义；除天地害曰义；取而不贪曰义；理财正辞曰义；仁能制命曰义；能成其志曰义；道无不理曰义；推功尚善曰义；以礼节行曰义；行礼不疚曰义；见利能让曰义；以公灭私曰义；正身肃下曰义；
逸：隐居放言曰逸
毅：致果杀敌曰毅；强而能断曰毅；勇而近仁曰毅；善行不怠曰毅；温仁忠厚曰毅；能纪国善曰毅；英明有执曰毅；经德不回曰毅；致果克敌曰毅
翼：刚克为伐曰翼；思虑深远曰翼；爱民好治曰翼；小心事天曰翼；小心昭事曰翼；赞宣德化曰翼
懿：温柔贤善曰懿；温和圣善曰懿；体和居中曰懿；爱人质善曰懿；柔克有光曰懿；浸以光大曰懿；行见中外曰懿；爱民质渊曰懿；德浸广大曰懿；文德充实曰懿；秉彝好德曰懿；尚能不争曰懿；主极精纯曰懿；柔德流光曰懿；贤善着美曰懿
隐：陷拂不成曰隐；不显尸国曰隐；见美坚长曰隐；隐括不成曰隐；不尸其位曰隐；违拂不成曰隐；怀情不尽曰隐；不明误国曰隐；威德刚武曰隐；
英：出类拔萃曰英；道德应物曰英；德华茂着曰英；明识大略曰英
婴：恭俭好礼曰婴
雍：居敬行简曰雍
勇：胜敌壮志曰勇；率义死国曰勇；致命为仁曰勇；奋身为义曰勇；持义不挠曰勇；知死不避曰勇；率义共用曰勇；以义死用曰勇；临事屡断曰勇；临难不惧曰勇；见义必为曰勇
幽：壅遏不通曰幽；动静乱常曰幽；早孤有位曰幽；早孤陨位曰幽；早孤销位曰幽；违礼乱常曰幽；暴民残义曰幽；淫德灭国曰幽
友：睦于兄弟曰友
俞：愚智适时曰俞
禹：渊源通流曰禹；受禅成功曰禹
圉：威德刚武曰圉
裕：强学好问曰裕；建中垂统曰裕；宽仁得众曰裕；性量宽平曰裕；仁惠克广曰裕；宽和不迫曰裕；宽和自得曰裕
誉：状古述今曰誉
渊：不幸短命曰渊；沉潜用晦曰渊；德信静深曰渊；沉几烛隐曰渊
元：能思辩众曰元；行义说民曰元；始建国都曰元；主义行德曰元；道德纯一曰元；遵仁贵德曰元；善行仁德曰元；宣慈惠和曰元；至善行德曰元；忠肃恭懿曰元；体仁长民曰元；茂德丕绩曰元；体乾启祚曰元；万邦以贞曰元；体仁内恕曰元；仁明道合曰元；
原：思虑不爽曰原；植德开基曰原；庆流奕叶曰原
远：疏远继位曰远
愿：思厚不爽曰愿；弱无立志曰愿；败乱无度曰愿；忘德败礼曰愿；柔无立志曰愿
章：温克令仪曰章；法度明大曰章；出言有文曰章；敬慎高亢曰章；文教远耀曰章
昭：容仪恭美曰昭；昭德有劳曰昭；圣闻周达曰昭；声闻宣远曰昭；威仪恭明曰昭；明德有功曰昭；圣问达道曰昭；圣德嗣服曰昭；德业升闻曰昭；智能察微曰昭；德礼不愆曰昭；高朗令终曰昭；遐隐不遗曰昭；德辉内蕴曰昭；柔德有光曰昭
哲：知人曰哲；明知渊深曰哲；官人应实曰哲；明知周通曰哲；识微虑终曰哲；知能辨物曰哲
贞：清白守节曰贞；大虑克就曰贞；大宪克就曰贞；不隐无屈曰贞；内外用情曰贞；忧国忘死曰贞；内外无怀曰贞；忠道不扰曰贞；保节扬名曰贞；履正中馈曰贞；守教难犯曰贞；幽间专一曰贞；恒德从一曰贞；直道不挠曰贞；名实不爽曰贞；事君无猜曰贞；德性正固曰贞；率义好修曰贞；德信正周曰贞
真：肇敏行成曰真；不隐无藏曰真
正：内外宾服曰正；大虑克就曰正；内外用情曰正；清白守洁曰正；图国忘死曰正；内外无怀曰正；直道不挠曰正；靖恭其位曰正；其仪不忒曰正；精爽齐肃曰正；诚心格非曰正；庄以率下曰正；息邪讵诐曰正；主极克端曰正；万几就理曰正；淑慎持躬曰正；端型式化曰正；心无偏曲曰正；守道不移曰正
直：肇敏行成曰直；治乱守正曰直；不隐其亲曰直；守道如矢曰直；言行不邪曰直；质而中正曰直；正人之曲曰直；折狱在中曰直；孝弟成性曰直；小心敬事曰直；敏行不挠曰直；率行无邪曰直；秉道正物曰直；
质：名实不爽曰质；忠正无邪曰质；章义掩过曰质；言行相应曰质；恬淡无为曰质；直心靡他曰质；真纯一德曰质；至治还淳曰质；宅心笃实曰质；淳茂无华曰质；静正无华曰质；朴直无华曰质；强立守义曰质
智：官人应实曰智；尊明胜患曰智；默行言当曰智；推芒折廉曰智；临事不惑曰智；察言知人曰智；择任而往曰智
中：王心克一曰中；刚柔不偏曰中；因时致治曰中
忠：危身奉上曰忠；虑国忘家曰忠；让贤尽诚曰忠；危身利国曰忠；安居不念曰忠；临患不反曰忠；盛衰纯固曰忠；廉方公正曰忠；事君尽节曰忠；推贤尽诚曰忠；中能应外曰忠；杀身报国曰忠；世笃勤劳曰忠；善则推君曰忠；死卫社稷曰忠；以德复君曰忠；以孝事君曰忠；安不择事曰忠；教人以善曰忠；中能虑外曰忠；广方公正曰忠；肫诚翊赞曰忠
终：有始有卒曰终；克成令名曰终
纣：残义损善曰纣
专：好功自是曰专；违命自用曰专
庄：兵甲亟作曰庄；睿圉克服曰庄；胜敌志强曰庄；死于原野曰庄；屡征杀伐曰庄；武而不遂曰庄；真心大度曰庄；好勇致力曰庄；威而不猛曰庄；严敬临民曰庄；履正志和曰庄；维德端严曰庄；恭敬端肃曰庄；端恪临民曰庄；端一克诚曰庄；齐敬中礼曰庄；执德不矜曰庄；德盛礼恭曰庄；严恭自律曰庄；严恪有仪曰庄；威德刚武曰壮；赫围克服曰壮；胜敌克乱曰壮；好力致勇曰壮；屡行征伐曰壮；武德刚毅曰壮；非礼弗履曰壮（庄和壮一般混用）
纵：弱而立志曰纵；败乱百度曰纵；忘德败礼曰纵
 * 
 */

