var demo = {
    title: "周易口诀",
    name: "周易口诀",
    data: [{
        title: "八卦方位的五行口诀",
        data: [
            { context: "乾三连、坤六断;离中虚、坎中满;震仰盂、艮覆碗;兑上缺，巽下断。" },
            { context: "乾三连西北开天;坤六断西南八地。" },
            { context: "兑上缺西方双泽;巽下断东南无风。" },
            { context: "艮覆碗东北齐山;震仰盂东方四雷。" },
            { context: "离中虚南方真火;坎中满北方六水。" },
            { context: "八卦相错重叠生;六十四卦化万象。" },
            { context: "天地造化定乾坤;雷厉风行必相薄。" },
            { context: "山泽相连可通气;水火相克不相射。" },
        ]
    }, {
        title: "六十四卦口诀",
        data: [
            { context: "乾坤屯蒙需讼师，比小畜兮履泰否。" },
            { context: "同人大有谦豫随，蛊临观兮噬嗑贲。" },
            { context: "剥复无妄大畜颐，大过坎离三十备。" },
            { context: "咸恒遁兮及大状，晋及明夷家人睽。" },
            { context: "蹇解损益夬姤萃，升困井革鼎震继。" },
            { context: "艮渐归妹丰旅巽，兑涣节兮中孚至。" },
            { context: "小过既济兼未济，是为下经三十四。" },
            { context: "火（离）：火地晋，火山旅，火水未济，火风鼎，火雷噬嗑，火火离，火泽睽，火天大有。" },
            { context: "水（坎）：水地比，水山蹇，水水坎，水风井，水雷屯，水火既济，水泽节，水天需。" },
            { context: "山（艮）：山地剥，山山艮，山水蒙，山风蛊，山雷颐，山火贲，山泽损，山天大畜。" },
            { context: "泽（兑）：泽地萃，泽山咸，泽水困，泽风大过，泽雷随，泽火革，泽泽兑，泽天夬。" },
            { context: "雷（震）：雷地豫，雷山小过，雷水解，雷风恒，雷雷震，雷火丰，雷泽归妹，雷天大壮。" },
            { context: "风（巽）：风地观，风山渐，风水涣，风风巽，风雷益，风火家人，风泽中孚，风天小畜。" },
            { context: "地（坤）：地地坤，地山谦，地水师，地风升，地雷复，地火明夷，地泽临，地天泰。" },
            { context: "天（乾）：天地否，天山遁，天水讼，天风姤，天雷无妄，天火同人，天泽履，天天乾。" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [
            { context: "象中有数数中理;(万事万物的现象之中，一定存在着定数12345678......，而定数之中又包含道理：五行生克制化。)" },
            { context: "以道观象明数理。(我们观察事物时要以道(自然的真理)来看，从而知道了这些现象中的定数与五行生克制化。)" },
            { context: " 以理言事真无比;(然后以五行生克制化的理来判断事物，把结果表达出来，就是预测的正确结果。)" },
            { context: "不可不信妙无许。(学会了这些道理，是妙不可言的，就像掌握了未来那样，很是自在。)" },
            { context: "心若无欲心则灵;(在预测时，心中如果没有任何的贪婪与自私的话，心就一定灵验，心所想的就是准确的预测结果。)" },
            { context: "心无挂碍言出行。(在判断事物时，不要怀疑自己，放心，没有任何的障碍，说出来一定会应验。)" },
            { context: "法外无法无定法;(预测方法就这么简单，完全是在易经范畴之内的，但方法也不是固定的，要活学活用啊。)" },
            { context: "不拘古法心为法。(不要拘泥于原先人们的那些预测的方法，以自己的心为主才是好方法。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "注意事项：",
        data: [
            { context: "心血来潮读易经;(我读易经是心血来潮读的，这里主要是读《易传》，易传是易经的解释，又称十翼，是给易经装的十支翅膀，毕竟易经是上古人士作的，我们看不懂，也不必看懂，只要理解了易传的含义，把握其中的精华所在，然后和自己的体悟融会贯通，但一定要熟记64卦的挂名就可以了。易经一定有它简易的一面，我们就从简单的入手就好。)" },
            { context: "读懂易经神来到。(其实，读懂易传足够了，根本就不必去再读易经原文了，就像自己就是神仙那样，很舒服自在。)" },
            { context: "顺手拈来八卦象;(预测未来完全是任凭心血来潮、随意找出卦象来。)" },
            { context: "鬼使神差不枉然。(就算是写错了八卦，搞错了卦理，说出来的结果也是准确的，就这么怪。)" },
            { context: "世间本无善与恶;(其实啊，人世间并没有善与恶的分别，只是人们自己分开来的。)" },
            { context: "因果循环天理合。(宇宙间只有因果的天理在循环。)" },
            { context: "吉中有凶凶藏吉;(其实，所有的事物皆是如此，好事情中总是有不完美的地方，坏事情中也有好的地方。)" },
            { context: "居安思危便化无。(如果能做到顺境中考虑到逆境会到来的话，做好预防措施，逆境就永远不会来到，凶也能化为吉了。)" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [{
            title: "乾卦",
            data: [
                { context: "乾物金玉与珠宝，冠镜木果钱钟表。" },
                { context: "高档用品如轿车，圆物刚物全是了。" },
                { context: "动物马狮天鹅象，寺院皇宫都市撞。" },
                { context: "高楼宫殿博物馆，君父长官有名望。" },
                { context: "英雄独裁掌权人，刚毅果断积极行。" },
                { context: "冷酷傲慢是缺点，还有强制任专横。" },
                { context: "身体胸部头骨肺，季节秋天戌亥配。" },
                { context: "颜色大赤玄金黄，一四九数西北位。­" },
                { context: "" },
            ]
        }, {
            title: "坤卦",
            data: [
                { context: "坤人勤劳又恭敬，沉默迟缓性柔顺。" },
                { context: "消极懒躺懦弱穷，依赖吝啬要谨慎。" },
                { context: "人物普通之大众，农夫乡人泥瓦工。" },
                { context: "老母后母妻寡妇，臣民顾问村干部。" },
                { context: "大腹之人地产商，阴气盛者小人狂。" },
                { context: "牛马雌兽脾胃肉，西南八五十色黄。" },
                { context: "辰戌丑未均旺季，五谷布衣包瓦器。" },
                { context: "矮旧农舍会市场，田野仓库平原地。" },
                { context: "" },
            ]
        }, {
            title: "震卦",
            data: [
                { context: "震怒躁动起虚惊，性急无礼强霸民。" },
                { context: "表现进步显勇敢，追求紧迫便粗心。" },
                { context: "人物有名是将帅，警察法官长子在。" },
                { context: "狂士声大善吹牛，运动驾驶跑得快。" },
                { context: "住宅楼阁闹市中，公园车站大道同。" },
                { context: "唯有庭院山林静，歌厅舞厅乱轰轰。" },
                { context: "春来寅卯四八三，龙蛇鹰蜂鹤鹿眠。" },
                { context: "足肝神经声音发，竹木制品采花鲜。" },
                { context: "" },
            ]
        }, {
            title: "巽卦",
            data: [
                { context: "巽为长女为僧道，教师商人手艺妙。" },
                { context: "优柔寡断科技人，额宽面白头发少。" },
                { context: "奔波忙碌飘难定，多欲空虚基不牢。" },
                { context: "进退忧疑生权谋，鼓舞附和直爽好。" },
                { context: "场地山林之寺观，商店码头邮局连。" },
                { context: "窄路管道长直物，木制纤维丝线牵。" },
                { context: "蝇笔蚊香电风扇，兰花草约救生圈。" },
                { context: "鸡鹅鸭蛇五三八，青兰辰巳股肱边。" },
            ]
        }, {
            title: "坎卦",
            data: [
                { context: "坎人算计太聪明，义气漂泊不安宁。" },
                { context: "时时险陷灾难困，狡猾欺诈亦劳心。" },
                { context: "善则思想多创造，恶则暗昧匪与盗。" },
                { context: "劳苦沉默变酒鬼，耳血腰肾防不妙。" },
                { context: "江湖泉井与河沟，酒店澡堂监狱囚。" },
                { context: "车库饭店地下室，油盐酱醋饮料流。" },
                { context: "带核桃李放酒具，磁盘影带计算器。" },
                { context: "一六亥子属北方，色黑猪鱼狐鼠遇。" },
                { context: "" },
            ]
        }, {
            title: "离卦",
            data: [
                { context: "离为火兮为日电，聪明虚心重表现。" },
                { context: "煽动轻浮好虚荣，自满扩张示鲜艳。" },
                { context: "中层美人文艺人，目疾兵戈幻多情。" },
                { context: "报刊印章图书信，影视机器灯照明。" },
                { context: "大腹中空瓶笼类，玻璃门窗烧烤会。" },
                { context: "名胜书馆影剧场，医院学校火山射。" },
                { context: "公安法院检察院，三二七南红紫变。" },
                { context: "雉龟虾蟹凤孔雀，心目上焦小肠患。" },
                { context: "" },
            ]
        }, {
            title: "艮卦",
            data: [
                { context: "艮为少男与儿童，僧道闲人土建工。" },
                { context: "石匠囚犯监狱吏，奴仆官僚可怜虫。" },
                { context: "主观任性太顽固，困阻偏激保守路。" },
                { context: "沉着冷静慢更新，建设改善莫停步。" },
                { context: "丘陵坟墓山高台，银行寺庙休息宅。" },
                { context: "堤坎监狱派出所，仓库门坎桌子鞋。" },
                { context: "磁器石碑床与伞，硬木硬果钱袋满。" },
                { context: "五黄十七在东北，手背胃鼻虎鼠犬。" },
            ]
        }, {
            title: "兑卦 ­",
            data: [
                { context: "兑为少女妾可爱，巫师巫婆娼妓坏。" },
                { context: "动口职业如歌女，饮食金融与破败。" },
                { context: "喜悦温柔逞雄辩，谗毁谤说成淫滥。" },
                { context: "笑骂吵闹空议论，服从脱落装伪善。" },
                { context: "身体口舌肺咽痰，泽中之物羊猴猿。" },
                { context: "饮食用具缺损品，金刀金类乐器玩。" },
                { context: "有口瓶子酒杯罐，山洞池井水泽畔。" },
                { context: "废墟路口破壁屋，四二九白西方看。​​​​" },
                { context: "" },
            ]
        },
        ]
    }, {
        title: "六十四卦爻辞",
        data: [{
            title: "乾为天01 -- 乾，元，亨，利，贞。【大吉大利，吉利的贞卜。】",
            data: [
                { context: "初九：潜龙，勿用。【初九：潜藏的龙，无法施展。】" },
                { context: "九二：见龙在田，利见大人。【九二：龙出现在大地上，有利于会见贵族王公。】" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。【九三：有才德的君子始终是白天勤奋努力，夜晚戒惧反省，虽然处境艰难，但终究没有灾难。】" },
                { context: "九四：或跃在渊，无咎。【九四：龙也许跳进深潭，没有灾难。】" },
                { context: "九五：飞龙在天，利见大人。【九五：龙飞腾在空中，有利于会见贵族王公。】" },
                { context: "上九：亢龙有悔。【上九：升腾到极限的龙会有灾祸之困。】" },
                { context: "用九：见群龙，无首吉。【群龙出现在天空，看不出首领，吉利。】" },
            ]
        }, {
            title: "天泽履10 -- 履虎尾，不咥人，亨。【踩着虎尾巴，老虎不咬人，吉利。】",
            data: [
                { context: "初九：素履往，无咎。【初九：以朴素坦白的态度处世，没有灾害。】" },
                { context: "九二：履道坦坦，幽人贞吉。【九二：行道之人，胸怀坦荡；隐居之人，长逢吉兆。】" },
                { context: "六三：眇能视，跛能履，履虎尾，咥人凶，武人为于大君。【六三：瞎了眼睛却要看物，跛了脚却要行走，这是勉为其难，犹如踩着虎尾巴，终将为虎所伤。这是凶险之事。武人纂夺国政，同样是凶险之事。】" },
                { context: "九四：履虎尾，愬愬，终吉。【九四：踩着虎尾巴，但能遇险知惧，最后仍吉利】" },
                { context: "九五：夬履，贞厉。【九五：行为急躁莽撞；卜其行事有危险之象】" },
                { context: "上九：视履考祥，其旋元吉。【上九：行为审慎，遇事周密面反复地考虑，大吉。】" },
            ],
        }, {
            title: "天火同人13 -- 同人于野，亨。利涉大川，利君子贞。【聚众于郊外，将行大事，吉利。有利于涉水渡河，有利于君子的卜问。】",
            data: [
                { context: "初九：同人于门，无咎。【初九：聚集大众于王门，将行大事，没有灾祸。】" },
                { context: "六二：同人于宗，吝。【六二：聚同族于宗庙，卜祷凶吉，因为面临艰难。】" },
                { context: "九三：伏戎于莽。升其高陵，三岁不兴。【九三：将军队隐蔽在深山密林，并且占领了制高点，但长时期不能取胜。】" },
                { context: "九四：乘其墉，弗克，攻吉。【九四：爬上了敌人的城墙，城还没有攻下来，继续攻打才能获胜。】" },
                { context: "九五：同人，先号咷而后笑，大师克相遇。【九五：聚集起来的大众先哭号后欢笑，因为大军及时增援，大获胜仗。】" },
                { context: "上九：同人于郊，无悔。【上九：聚众于郊外，致祭于神灵祝贺胜利，自然没有悔咎。】" },
            ],
        }, {
            title: "天雷无妄25 -- 无妄，元亨利贞。其匪正有眚，不利有攸往。【嘉美通泰，卜问得吉兆。行为不正当，则有灾殃，有所往则不利。】",
            data: [
                { context: "初九：无妄，往吉。【初九：不要妄行非正，吉利。】" },
                { context: "六二：不耕获，不菑畬，则利有攸往。【六二：不耕种就想收获，不开荒地就想种熟地。这些妄谬的行径怎能有利?】" },
                { context: "六三：无妄之灾，或系之牛，行人之得，邑人之灾。【六三：意外的灾难。比喻说有人将牛系在不该系的地方，行人顺手牵牛获意外之得，邑人失牛受到意外之灾。】" },
                { context: "九四：可贞，无咎。【九四：称心的占问，没有灾难】" },
                { context: "九五：无妄之药，勿药有喜。【九五：患意外之病，不要忙乱服药，自可痊愈。】" },
                { context: "上九：无妄行有眚，无攸利。【上九：不要胡作妄行！将有灾殃，没有好处。】" },
            ],
        }, {
            title: "天风姤44 -- 姤，女壮，勿用取女。【梦见女子受伤。筮遇此卦，不利于娶女。】",
            data: [
                { context: "初六：系于金柅，贞吉。有攸往，见凶，赢豕孚蹢躅。【初六：细柔之线牵附于黄铜柅子之上。这是吉利的贞兆。若占问有所往，则必逢凶险，就象瘦弱的猪被不情愿地拖回来。】" },
                { context: "九二：包有鱼，无咎，不利宾。【九二：厨中有鱼。占得此爻，没有灾祸，但不利宴请宾客。】" },
                { context: "九三：臀无肤，其行次且，厉，无大咎。【九三：臀部负伤，行走困难。占得此爻，有危险，但尚无大的灾难。】" },
                { context: "九四：包无鱼，起凶。【九四：厨中无鱼。筮遇此爻，有所动作必遭凶险。】" },
                { context: "九五：以杞包瓜，含章，有损自天。【九五：匏瓜缠着杞树生长，隐印的瓜纹很好看。忽然从头顶上方掉下一个瓜来。】" },
                { context: "上九：姤其角，吝；无咎。【上九：遭遇野兽，处于它的角锋之下，不是好兆头，但没有大的灾难。 】" },
            ],
        }, {
            title: "天水讼06 -- 讼，有孚，窒惕。中吉，终凶。利见大人，不利涉大川。【虽有利可图(获得俘虏)，但要警惕戒惧。其事中间吉利，后来凶险。占筮得此爻，有利于会见贵族王公，不利于涉水渡河。】",
            data: [
                { context: "初六：不永所事，小有言，终吉。【初六：做事不能持之以恒，稍有过错，最后还是吉利的。】" },
                { context: "九二：不克讼，归而逋，其邑人三百户无眚。【九二：讼事失败，归到采邑，三百户奴隶逃亡。没有大的灾祸。】" },
                { context: "六三：食旧德，贞厉，终吉。或从王事，无成。【六三：依赖先人遗业过活。卜问得险兆，但最后是吉利的。但是，如果服务于王事，谋取利禄，却不会成功。】" },
                { context: "九四：讼事失败，败讼回家，服从判决。卜问平安，得吉利之兆。" },
                { context: "九五：讼，元吉。【九五：争讼，筮遇此爻，大吉大利。】" },
                { context: "上九：或锡之鞶带，终朝三褫之。【上九：王侯赐予人以绅带，但不满一天，三次赐予三次革夺】" },
            ],
        }, {
            title: "天山遁33 ---  遁，亨，小利贞。【通达。小有利之占问。】",
            data: [
                { context: "初六：遁尾，厉，勿用有攸往。【初六：君子全部隐退，国家就危险了。不能有所作为了。】" },
                { context: "六二：执之用黄牛之革，莫之胜说。【六二：抓来用黄牛革绳紧紧捆绑，这样就不能解脱了。】" },
                { context: "九三：系遁，有疾厉，蓄臣妾，吉。【九三：被拖累而不能决然隐退，就像身染重病，情形危险。在这种情况下，蓄养奴婢或可有利。】" },
                { context: "九四：好遁，君子吉，小人否。【九四：喜爱隐居，这对君子是吉利的，对小人则未必。】" },
                { context: "九五：嘉遁，贞吉。【九五：退隐以时，值得赞美，卜问前程，通泰吉利。】" },
                { context: "上九：肥遁，无不利。【上九：远走高飞，退隐山林，无不利。】" },
            ],
        }, {
            title: "天地否12 -- 否之匪人，不利君子贞，大往小来。【为小人所隔阂，这是不利于君子的卜占，事业也将由盛转衰。】",
            data: [
                { context: "初六：拔茅茹以其汇，贞吉，亨。【初六：连根拔掉茅草，及其同类，占得此爻则吉利，亨通。】" },
                { context: "六二：包承，小人吉，大人否亨。【六二：厨中有肉，这对老百姓来说是吉利，对贵族来说并不是通泰的表现。】" },
                { context: "六三：包羞。【六三：厨中有美味。】" },
                { context: "九四：有命，无咎。畴离祉。【九四：君王有赏赐之命，没有灾害，谁能得到赏赐呢?】" },
                { context: "九五：休否，大人吉。其亡其亡，系于苞桑。【九五：警戒覆亡，贵族王公如此存心则吉利。危险呵，危险，国家命运好像系在柔弱的苞草、桑枝上一样。】" },
                { context: "上九：倾否，先否后喜。【上九：短暂的恶运，先遇恶运后交好运。】" },
            ],
        }, {
            title: "泽天夬43 -- 夬，杨于王庭，孚号有厉，告自邑，不利即戎，利有攸往。【夬卦：王庭里正跳舞作乐。有人呼告：“有敌人来犯。”邑中传来命令：“出击不利，要严阵以待。”筮遇此爻，出外旅行则吉利。】",
            data: [
                { context: "初九：壮于前趾，往不胜，为咎。【初九：脚趾受伤，仍然继续前进，将因为脚力不胜而遭致灾难。】" },
                { context: "九二：惕号，莫夜有戎，勿恤。【九二：恐惧地惊叫，夜间有敌来犯，但不足为患。】" },
                { context: "九三：壮于頄，有凶，君子夬夬，独行遇雨若濡，有愠，无咎。【九三：颧骨受伤，这是凶象。君子匆匆忙忙地独个儿行路，碰上了雨，全身淋湿了，令人很不快，但没有灾难。】" },
                { context: "九四：臀无肤，其行次且，索羊悔亡，闻言不信。【九四：臀部受伤，走起路来踉踉跄跄。牵羊上路，悔恨丢失了羊儿，这是由于对别人的告诫不相信。】" },
                { context: "九五：苋陆夬夬，中行无咎。【九五：细角山羊在道路中间蹦蹦跳跳，筮遇此爻无灾难】" },
                { context: "上六：无号，终有凶。【上六：狗在哭叫，预兆着终将有凶险之事。】" },
            ],
        }, {
            title: "兑为泽58 -- 兑，亨，利贞。【亨通。吉利的贞卜。】",
            data: [
                { context: "初九：和兑，吉。【初九：和睦欢喜，吉利。】" },
                { context: "九二：孚兑，吉。悔亡。【九二：优待俘虏，吉利，没有悔恨。】" },
                { context: "六三：来兑，凶。【六三：以使人归服为乐，蕴藏着凶险。】" },
                { context: "九四：商兑未宁，介疾有喜。【九四：商谈恢复邦交之事，尚未达成协议，但两国的矛盾分歧有了愈合的趋势。】" },
                { context: "九五：孚于剥，有厉。【九五：被剥国俘虏。剥国无理挑衅，必遭惩罚(对我方而言，坏事将变为好事)。】" },
                { context: "上六：引兑。陪【上六：引导大家和睦相处。】" },
            ],
        }, {
            title: "泽火革49 -- 革，巳日乃孚，元亨利贞，悔亡。【祭祀之日用俘虏作人牲，亨通，吉利的卜问。没有悔恨。】",
            data: [
                { context: "初九：巩用黄牛之革。【初九：用黄牛的皮革束紧加固(战车)。】" },
                { context: "六二：巳日乃革之，征吉，无咎。【六二：祭祀的日期要改变。随之要重新卜问征战的日期，结果卜得吉兆，没有灾难。】" },
                { context: "九三：征凶，贞厉。革言三就，有孚。【九三：出征，吃了败仗，卜问得凶兆。但是，只要振奋精神，整顿装备，重新开战，则能转败为胜，生擒强敌。】" },
                { context: "九四：悔亡，有孚，改命吉。【九四：没有悔恨。至于占问战争，则小有战果，如果改帅易将，则将大吉。】" },
                { context: "九五：大人虎变，未占有孚。【九五：大人虎变，未占有孚。】" },
                { context: "上六：君子豹变，小人革面，征凶，居贞吉。【上六：君子精神振奋，但基层官兵一反常态。筮遇此爻，占问征伐，则凶险。卜问居处则吉利。】" },
            ],
        }, {
            title: "泽雷随17 --- 随，元亨，利贞，无咎。【大吉大利，卜得吉兆，没有灾害。】",
            data: [
                { context: "初九：官有渝，贞吉，出门交有功。【初九：馆舍时里发生事故，筮遇此爻则吉，出门同行都得好处。】" },
                { context: "六二：系小子，失丈夫。【六二：抓住了未成年的奴隶，跑了成年的奴隶。】" },
                { context: "六三：系丈夫，失小子。随有求得，利居贞。【六三：抓住了成年奴隶，跑了未成年奴隶。希望无失不如现得。筮遇此爻，卜问居处则吉利。】" },
                { context: "九四：随有获，贞凶。有孚在道，以明，何咎？【九四：追名逐利，贪多务获，卜问得凶兆。押送俘虏上路，明于约束，没有灾难。】" },
                { context: "九五：孚于嘉，吉。【九五：俘虏了不少嘉人，吉利。】" },
                { context: "上六；拘系之，乃从维之，王用亨于西山。【上六：将俘虏拘禁起来，紧紧捆绑，周文王将他们作为人牲在西山祭祀神灵。】" },
            ],
        }, {
            title: "泽风大过28 -- 大过，栋桡，利于攸往，亨。【屋粱压得弯曲了。有所往则有利，通泰。】",
            data: [
                { context: "初六：籍用白茅，无咎。【初六：恭敬地用白茅垫着祭品，可以无灾祸。】" },
                { context: "九二：枯杨生秭，老夫得其女妻，无不利。【九二：枯杨发芽，老头子娶少女为妻，并无不吉利。】" },
                { context: "九三：栋桡，凶。【九三：屋梁弯曲，这是凶险之象】" },
                { context: "九四：栋隆，吉，有它吝。【九四：屋梁挺直，吉利。但有意外之患则不好应付。】" },
                { context: "九五：枯杨生华，老妇得其士夫，无咎，无誉。【九五：枯杨开花，老妇人嫁给一个年轻人，这件事不好也不坏。】" },
                { context: "上六：过涉灭顶，凶，无吝。【上六：盲目涉水，水深过顶，虽遇凶险，但终归没有灾难。】" },
            ],
        }, {
            title: "泽水困47 -- 困，亨，贞，大人吉，无咎。有言不信。【通泰。卜问王公贵族之事吉利，没有灾难。筮遇此爻，有罪之人无法申辩清楚。】",
            data: [
                { context: "初六：臀困于株木，入于幽谷，三岁不觌。【初六：臀部被狱吏的刑杖打伤，被投入黑暗的牢房中，三年不见其人。】" },
                { context: "九二：困于酒食，朱绂方来，利用享祀，征凶，无咎。【九二：酒醉未醒，穿着红色服装的蛮夷前来进犯，忧患猝临，宜急祭神求佑。至于占问出征，则有危险。其他事无大的灾祸。】" },
                { context: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。【六三：被石头绊倒，被蒺藜刺伤，历难归家，妻子又不见了，这是凶险之兆。】" },
                { context: "九四：来徐徐，困于金车，吝，有终。【九四：其人被关押在囚车里，慢慢地走来。真不幸，但最后还是被释放。】" },
                { context: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。【九五：割了鼻子，断了腿，被身着红色服装的蛮夷虏去。后来慢慢找到脱身的机会，终于逃脱回家。宜急祭神酬谢。】" },
                { context: "上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。【上六：被葛藟绊倒，被小木桩刺伤，处境如此艰难，不宜有所行动，否则悔上加悔。至于占问出征则吉利。】" },
            ],
        }, {
            title: "泽山咸31 -- 咸，亨，利贞。娶女，吉。【通达，吉利的贞卜。娶女，吉利。】",
            data: [
                { context: "初六：咸其拇。【初六。伤其大脚趾。】" },
                { context: "六二：咸其腓，凶，居吉。【六二：伤其腿肚子，这是凶兆。小腿负伤，不宜出门，安居不动，自然平安。】" },
                { context: "九三：咸其股，执其随，往蔺吝。【九三：伤其股，并伤及股下之肉。带伤出行，定遭灾难。 】" },
                { context: "九四：贞吉，悔亡。憧憧往来，朋从尔思。【九四：贞卜吉利，无所悔恨。纷沓往来，朋友们都顺从你的意旨。】" },
                { context: "九五：咸其脢，无悔。【九五：伤其背肉，但没有灾祸。】" },
                { context: "上六：咸其辅颊舌。【上六：伤其腮帮、脸颊、舌头。】" },
            ],
        }, {
            title: "泽地萃45 -- 萃，亨。王假有庙。利见大人，亨，利贞，用大牲吉，利有攸往。【通泰。王到宗庙举行祭祀。占得此卦，利于会见贵族王公，亨通，这是吉利的贞兆。用牛牲祭祀，也很吉利，并且出行吉利。】",
            data: [
                { context: "初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。【初六：捕获了俘虏，却又逃跑了，引起纷乱和忧虑，大家呼喊着四处追捕。终于追回了，又高兴得嘻嘻哈哈，用不着担忧了。占得此爻，大胆前往，没有灾难。 】" },
                { context: "六二：引吉，无咎，孚乃利用禴。【六二：占得此爻，长时间吉利，没有灾难。占问祭祀，贞兆显示：春祭要用俘虏作人牲才好。】" },
                { context: "六三：萃如嗟如，无攸利，往无咎，小吝。【六三：忧愁嗟叹。占得此爻，无所利。出行则无灾难，但有小小的麻烦。】" },
                { context: "九四：大吉无咎。【九四：大吉大利，没有灾难。】" },
                { context: "九五：萃有位，无咎。匪孚，元永贞，悔亡。【九五：瘁心力于其职守，没有灾祸。不轻易责罚别人，卜问长期的吉凶，贞兆显示：没有大的悔恨。】" },
                { context: "上六：赍咨涕洟，无咎。【上六：叹息流涕，忧心忡忡，但没有灾难。】" },
            ],
        }, {
            title: "火天大有14 -- 大有，元亨。【昌隆通泰。】",
            data: [
                { context: "初九：无交害，匪咎艰则无咎。【初九：不要彼此侵害，即没有灾祸，既使处于艰难之中，也没有灾祸。 】" },
                { context: "九二：大车以载，有攸往，无咎。【九二：用大车装物载人，有明确的目的地，没有灾祸。】" },
                { context: "九三：公用亨于天子，小人弗克。【九三：天子宴请公侯。小人则不能参与。】" },
                { context: "九四：匪其彭，无咎。【九四：用曝晒男巫来求雨，旱情严重，但没有灾祸。】" },
                { context: "六五：厥孚交如，威如，吉。【六五：来犯之敌被紧紧捆绑，严厉惩罚，吉利。】" },
                { context: "上九：自天祐之，吉，无不利。【上九：上天保祐，吉利，无所不顺利。】" },
            ],
        }, {
            title: "火泽睽38 -- 睽，小事吉。【筮遇此卦，小事吉利。】",
            data: [
                { context: "初九：悔亡。丧马勿逐，自复。见恶人，无咎【初九：不必悔恨，丢失了马匹，不必寻找，它自会回来，途中碰见坏人，也不会有灾祸。】" },
                { context: "九二：遇主于巷，无咎。【九二：遇着了热情好客的主人，没有灾难。】" },
                { context: "六三：见舆曳，其牛掣，其人天且劓，无初，有终。【六三：看见一辆拉货的车，拉车的牛一俯一仰拉得很费劲，赶车的人是—个烙了额，割了鼻的奴隶。起初车子陷着不动，后来终于拉动了。】" },
                { context: "九四：睽孤遇元夫，交孚，历无咎。【九四：旅人孤单地行路，遇上一个踱子，一同被抓住，情形危险，但终无灾祸。】" },
                { context: "六五：悔亡，厥宗噬肤，往何咎。【六五：没有悔恨。瞧见同族宗人在吃肉，孤单的旅人欣然结伴同行，一路平安无事。】" },
                { context: "上九：睽孤见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。【上九：旅人孤单地行路，见一头大猪伏在路上，又遇上一辆大车，上面满载着打扮得奇形怪状的人。旅人搭弓欲射，后来又放下弓箭。因为这伙人不是强盗，而是去订婚的。旅人照常行进，遇上大雨，但一切平安。】" },
            ],
        }, {
            title: "离为火30 -- 离，利贞，亨。畜 牛牝吉。【吉利的占问，通泰。饲养母牛，吉利。】",
            data: [
                { context: "初九：履错然敬之，无咎。【初九：听到纷来沓至的脚步声，立时警惕戒备，可以无灾难。】" },
                { context: "六二：黄离，元吉。【六二：天空出黄霓，大吉大利。】" },
                { context: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。【九三：黄昏时分有霓虹出现在天空，这是凶兆，人们居然不击鼓唱歌禳除它，老人感到悲哀，灾殃快要来了。】" },
                { context: "九四：突如其来如，焚如，死如，弃如。【九四：灾难突然降临，敌人见房屋就烧，见人就杀，此处变成一片废墟。】" },
                { context: "六五：出涕沱若，戚嗟若，吉。【六五：灾难过后，人们痛哭，人们悲叹，然而吉利。】" },
                { context: "上九：王用出征，有嘉折首，获匪其丑，无咎。【上九：国王出征，反击敌人，将有嘉国的国君斩首，抓到了许多俘虏，无灾无难。】" },
            ],
        }, {
            title: "火雷噬嗑21 -- 噬嗑，亨，利用狱。【通泰。利于讼狱。 】",
            data: [
                { context: "初九：屦校灭趾，无咎。【初九：拖着刑具，磨破了脚趾，但没有大的灾难。】" },
                { context: "六二：噬肤灭鼻，无咎。【六二：大吃鲜鱼嫩肉，遭受割鼻之刑，但没有大难。 】" },
                { context: "六三：噬腊肉，遇毒，小吝，无咎。【六三：吃腊肉，中毒。碰上了麻烦，但不十分严重。】" },
                { context: "九四：噬干胏，得金矢，利艰贞，吉。【九四：啃吃骨头，发现骨头中有金属箭头。卜问艰难之事，结果是吉利的。】" },
                { context: "六五：噬干肉，得黄金，贞厉，无咎。【六五：吃干肉，发现金属箭头。卜问得危险之兆，但最终可以无灾祸。】" },
                { context: "上九：何校灭耳，凶。【上九：肩上扛着大枷，磨破了耳朵，凶险。】" },
            ],
        }, {
            title: "火风鼎50 -- 鼎，元吉，亨。【大吉大利，亨通。】",
            data: [
                { context: "初六：鼎颠趾，利出否，得妾以其子，无咎。【初六：将鼎倾覆，鼎足向上，筮遇此爻，利于清除恶人。以无子而纳妾。因纳妾而得子，没有灾祸】" },
                { context: "九二：鼎有实，我仇有疾，不我能即，吉。【九二：鼎中有食物。筮遇此爻，家里有饭吃，仇家有疾病，再没有什么东西困扰我，吉利。】" },
                { context: "九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。【九三：鼎耳脱落了。筮遇此爻，打猎无所获。野味莫吃光，老天要下雨，不知何日能出猎，坐吃山空，食物将匮乏，节约渡难关，终于得吉利。】" },
                { context: "九四：鼎折足，覆公餗，其形渥，凶。【九四：鼎足太轻，不堪重负，以致折断，倾覆王公的珍馐美味，弄得汁液满地，形容狼藉。这是凶险之兆。】" },
                { context: "六五：鼎黄耳，金铉，利贞。【六五：豪华之鼎，上面装配有铜耳、铜铉。筮遇此爻吉利。】" },
                { context: "上九：鼎玉铉，大吉无不利。【上九：金属之鼎配以玉石之铉。占得此爻，大吉，无所不利。】" },
            ],
        }, {
            title: "火水未济64 -- 未济，亨。小狐泛济，濡其尾，无攸利。【亨通。小狐狸快要渡过河，却打湿了尾巴。看来此行无所利。】",
            data: [
                { context: "初六：濡其尾，吝。【初六：涉水渡河，沾湿了衣尾，前进有困难。】" },
                { context: "九二：曳其轮，贞吉。【九二：提着腰带涉水过河。卜问得吉兆。】" },
                { context: "六三：未济，征凶，利涉大川。【六三：渡不了河，出行有凶险。不利于涉水渡河。】" },
                { context: "九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。【九四：吉利的贞卜。没有悔恨。大动干戈，助殷讨伐鬼方，费时三年，打败了它，获得殷国的奖赏。】" },
                { context: "六五：贞吉，无悔，君子之光有孚，吉。【六五：吉利的贞卜，没有悔恨。打了胜仗，捕获了俘虏，这是君子的光荣，吉利。】" },
                { context: "上九：有孚于饮酒，无咎。濡其首，有孚矢是。【上九：捕获了俘虏，饮酒庆贺。没有灾难。但酗酒闹事，头发都淋湿了。俘虏乘机作乱，将他们杀了。 】" },
            ],
        }, {
            title: "火山旅56 -- 旅，小亨，旅，贞吉。【稍见亨通。贞卜旅行，吉利。】",
            data: [
                { context: "初六：旅琐琐，斯其所取灾。【初六：旅人三心二意，进退犹豫，最后还是离开住所，结果自遭灾祸。】" },
                { context: "六二：旅即次，怀其资，得童仆贞。【六二：旅人来到市场，带着钱财，买来一男仆，卜问得吉兆。】" },
                { context: "九三：旅焚其次，丧其童仆贞，厉。【九三：旅人来到着火的市场上，新买的男仆乘乱跑掉。卜问得险兆。】" },
                { context: "九四：旅于处，得其资斧，我心不快。【九四：旅人回到客居之处，因为赚了不少钱，心中不踏实。】" },
                { context: "六五：射雉，一矢亡，终以誉命。【六五：射野鸡，一发命中，其人因而博得善时的美名。】" },
                { context: "上九：鸟焚其巢，旅人先笑后号啕，丧牛于易，凶。【上九：鸟儿的巢窠被焚烧，周人的邑落被抢劫，四处流落的周人呵，美好的生活已成往事，悲惨的现实即在眼前，狄人牵着牛羊去，往后的日子怎么过。】" },
            ],
        }, {
            title: "火地晋35 -- 晋，康侯用锡马蕃蔗，昼日三接。【康侯用成王赐予的良马来繁殖马匹，一天多次配种。】",
            data: [
                { context: "初六：晋如、摧如，贞吉。罔孚，裕无咎。【初六：攻击敌人，打垮敌人，卜问得吉兆。胜利之师没有捕捉俘虏，没有抢掠财物，不会有灾难。】" },
                { context: "六二：晋如愁如，贞吉。受兹介福于其王母。【六二：攻击敌人，压倒敌人，卜问得吉兆。因为得到了先祖母的庇佑获得大福。】" },
                { context: "六三：众允、悔亡。【六三：万众一心，全力进攻，无所悔恨。】" },
                { context: "九四：晋如鼫鼠，贞厉。【九四：攻击敌人而胆小如鼠，卜问得凶兆。】" },
                { context: "六五：悔无，失得勿恤，往吉，无不利。【六五：无所悔恨，吃了败仗，不要气馁。只要再接再厉，终必转败为胜。无所不利】" },
                { context: "上九：晋其角，惟用伐邑，厉吉,，无咎，贞吝。【上九：攻击敌人，必须较量敌我双方的力量，可以考虑攻击敌人的城邑。但其结局难料：或许危险，或许吉利，或许没有灾难，或许正践凶兆。】" },
            ],
        }, {
            title: "雷天大壮34 -- 大壮，利贞。【吉利的卜问。】",
            data: [
                { context: "初九：壮于趾，征凶，有孚。【初九：伤于脚趾。筮遇此爻，出征则凶，但尚有收获。】" },
                { context: "九二：贞吉。【九二：卜问得吉兆。】" },
                { context: "九三：小人用壮，君子用罔。祗羊触藩，赢其角。【九三：小人捕兽凭气力，君子捕兽靠网围。卜问得险兆。公羊以角撞藩，结果被篱笆卡住。】" },
                { context: "九四：贞吉，悔亡。藩决不赢，壮子大舆之輹。【九四：卜问得吉兆，没有悔恨。因为公羊冲决篱笆，摆脱了拘系，但又被车轮撞伤，不能乱冲乱撞了。】" },
                { context: "六五：丧羊于易，无悔。【六五：丧羊于狄。筮遇此爻，没有大的灾祸。】" },
                { context: "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。【上六：羊角插进了篱笆，退不了，进不了，处境不利。但是，目前虽处于艰难之中，最终可以化解逢吉。】" },
            ],
        }, {
            title: "雷泽归妹54 -- 归妹，征凶，无攸利。【筮遇此爻，出征凶险。无所利。】",
            data: [
                { context: "初九：归妹以娣，跛能履，征吉。【初九：嫁女而将其妹妹一同陪嫁。跛脚而能行走。筮遇此爻，出行吉利。】" },
                { context: "九二：眇能视，利幽人之贞。【九二：眼睛瞎了而能看得见。这是利于囚徒的贞卜。】" },
                { context: "六三：归妹以须，反归以娣。【六三：嫁女而用其姊陪嫁，随后又与其妹妹返归父母家。】" },
                { context: "九四：归妹愆期，迟归有时。【九四：出嫁时超过了婚龄，迟迟不嫁是因为有所等待。】" },
                { context: "六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。【六五：帝乙嫁女于周文王，以其次女陪嫁。论嫁妆姊的不如妹的好。良辰择在某月十四日，吉利。】" },
                { context: "上六：女承筐无实，士刲羊无血，无攸利。【上六：献祭之时，新娘捧着盛祭品的筐具，但筐中无物；新郎以刀刺羊，但羊不流血。此不祥之兆，无所利。】" },
            ],
        }, {
            title: "雷火丰55 -- 丰，亨，王假之，勿忧，宜日中。【举行祭祀，君王将亲临宗庙。不要担心，最佳时刻当在正午时分。】",
            data: [
                { context: "初九：遇其配主，虽旬无咎，往有尚。【初九：旅途之中受到一位女主人的接待，与这位寡居的女人结成夫妻。占卜结果显示：不会遭人议论，而且能得到人们的赞同。】" },
                { context: "六二：丰其蔀，日中见斗，往得疑疾；有孚发若，吉。【六二：将小席拼缀起来，躺下休息。正午时分，有人说看见北斗星。看来旅伴之中有人精神错乱。对他加以刺激，或许可以使他清醒。】 " },
                { context: "九三：丰其沛，日中见沫。折旧右肱，无咎。【九三：将铺草加厚，躺下休息。正午时分，此人又说看见鬼魅。将他的右臂折断。经此一吓，或许他能清静。】" },
                { context: "九四：丰其部，日中见斗，遇其夷主，吉。【九四：将小席拼缀起来，躺下休息。正午时分，此人还在说看见北斗星，看来还未恢复正常。幸好遇着了他的老店主，把他托付给老店主，这一下可清静平安了。】" },
                { context: "九五：来章，有庆誉,吉。【六五：赚得美玉，大家都庆贺夸奖他。这是吉利之兆。】" },
                { context: "上六：丰其屋，部其家，闚其户，阒其无人，三岁不觌，凶。【上六：房子空荡荡的，屋顶上散乱盖着草席，从门缝里探视，寂无一人。看样子这里多年未住人了。这是不祥之兆。】" },
            ],
        }, {
            title: "震为雷51 -- 震，亨，震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。【临祭之时，雷声传来，有的人吓得浑身发抖，片刻之后，才能谈笑如常。巨雷猝响，震惊百里，有的人却神态自若，手里拿着酒勺子，连一滴酒都没有洒出来。】",
            data: [
                { context: "初九：震来虩虩，后笑言哑哑，吉。【初九：雷声传来，吓得浑身发抖，后来听到雷声，仍谈笑如常，吉利。】" },
                { context: "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。【六二：雷电交加，十分危险，惊慌之中丢失了钱币，翻山越蛉，走了很远的路程去寻找也没有找到。筮者告诉他：“不必追寻了，七八日内，这损失可得补偿。”】" },
                { context: "六三：震苏苏，震行无眚。【六三：出门时遇到电闪雷鸣，感到疑惧不安。继续前进，不会有灾祸。】" },
                { context: "九四：震遂泥。【九四：雷电下击，接触到地面。】" },
                { context: "六五：震往来厉，亿无丧有事。【六五：巨雷轰鸣，危险在前。只要小心谨慎，不至于酿成灾祸，亦无损于事。】" },
                { context: "上六：震索索，视矍矍，征凶，震不于其躬，于其邻，无咎。婚媾有言。【上六：雷电交加，其人行动谨慎，警戒四顾，因为行路艰难，危险四伏。但是雷电不会击在他身上，而是落在邻人的头上。因为他本人没有什么过错，而其他邻人却犯有罪责。】" },
            ],
        }, {
            title: "雷风恒 -- 恒，亨，无吝，利贞，利有攸往。【通达，没有过失，吉利的卜问。有所往则有利。】",
            data: [
                { context: "初六：浚恒，贞凶，无攸利。【初六：掘进不止，卜问凶险，没有什么好处。】" },
                { context: "九二：悔亡。【九二：没有悔恨。】" },
                { context: "九三：不恒其德，或承之羞，贞吝。【九三：不能保持其德行，必然蒙受耻辱。卜问得艰难之兆。】" },
                { context: "九四：田无禽。【九四：畋猎无所获。】" },
                { context: "六五：恒其德，贞妇人吉，夫子凶。【六五：操行一贯。卜得妇人吉利，丈夫财凶险。】" },
                { context: "上六：振恒，凶。【上六：久动不息，凶险。】" },
            ],
        }, {
            title: "雷水解 -- 解，利西南，无所往，其来复，吉。有攸往，夙吉。【利于西南行，但是，若没有确定的目标，则不如返回，返回吉利。如果有确定的目标，则宜早行，早行吉利。】",
            data: [
                { context: "初六：无咎。【初六：筮遇此爻，没有灾难。】" },
                { context: "九二：田获三狐，得黄矢，贞吉。【九二：畋猎获得三只狐狸，猎物身上带着铜箭头。卜问得吉兆。】" },
                { context: "六三：负且乘，致寇至，贞吝。【六三：带着许多财物，又是背负，又是车拉，招摇惹盗，自然招致盗寇抢劫，卜问有灾祸之象。】" },
                { context: "九四：解而拇，朋至斯孚。【九四：赚了钱，而懒怠不想走，结果被人虏去。】" },
                { context: "六五：君子维有解，吉，有孚于小人。【六五：君子被拘囚后又获释，吉利；小人贝!j将受罚。】" },
                { context: "上六：公用射隼于高墉之上，获之无不利。【上六：在高高的城墙上，王公射中一只鹰，并且抓到了，这没有什么不吉利的。】" },
            ],
        }, {
            title: "雷山小过 -- 小过，亨，利贞，可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。【亨通，这是吉利的贞卜。但是只适宜于小事，不适宜大事。飞鸟空中过，叫声耳边留，警惕人们：登高必遇险，下行则吉利。】",
            data: [
                { context: "初六：飞鸟以凶。【初六：飞鸟经过空中，预兆着凶险。】" },
                { context: "六二：过其祖，遇其妣，不及其君，遇其臣，无咎。【六二：错过了他的祖父，但遇着了他的祖母；没有赶上国君，还是遇着了臣僚。虽有差迟，但非徒劳，因而无灾难。】" },
                { context: "九三：弗过防之，从或戕之，凶。【九三：不要过分指责，但要制止他的错误发展，如果听任放纵，反而害了他，必遭凶险。】" },
                { context: "九四：无咎，弗过遇之。往厉必戒，勿用永贞。【九四：没有过错，不要指责他，但要防止发生错误。前去冒险，则必须立即加以警告，无须乎卜问往后的吉凶。】" },
                { context: "六五：密云不雨，自我西郊，公弋取彼在穴。【九五：在我西郊的上空，云气密布，降雨在即。王公本是去射鸟，可是在洞穴捉到野兽。】" },
                { context: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。【上六：不加制之，因而犯下过失，好比飞鸟钻入罗网，凶险呵，这叫做灾难。】" },
            ],
        }, {
            title: "雷地豫 -- 豫，利建侯，行师。【有利于封侯建国，出兵打仗。】",
            data: [
                { context: "初六：鸣豫，凶。【初六：津津乐道于荒淫享乐，凶险。 】" },
                { context: "六二：介于石，不终日，贞吉。【六二：夹在石缝中，幸而不到一天就被人救出。卜问得吉兆。 】" },
                { context: "六三：盱豫，悔；迟,有悔。【六三：懒散游乐，将招致后悔；再加上懈怠大意，那就后悔莫及。】" },
                { context: "九四：由豫，大有得，勿疑，朋盍簪。【九四：田猎取乐，大获鸟兽。筮遇此爻，勿疑友人多嘴而谗己。 】" },
                { context: "六五：贞疾，恒不死。【六五：卜问疾病，长时间内不会死去。】" },
                { context: "上六：冥豫，成有渝，无咎。【 上六：末日将至尚且享乐，已成之事也将毁败。】" },
            ],
        }, {
            title: "风天小畜09 -- 小畜，亨。密云不雨，自我西郊。【吉利。在西郊一带浓云密布，但雨没有下来。】",
            data: [
                { context: "初九：复自道，何其咎，吉。【初九：由原路返回，有什么灾祸？吉利。 】" },
                { context: "九二：牵复，吉。【九二：牵引着返回，吉利。】" },
                { context: "九三：舆说辐，夫妻反目。【九三：车子坏了一个轮子。夫妻互相口角。】" },
                { context: "六四：有孚，血去惕出，无咎。【六四：捕获了俘虏，战争危险暂时消除了，但仍须保持警惕，才能没有灾难。】" },
                { context: "九五：有孚挛如，富以其邻。【九五：捕获俘虏，串连搁缚，这些对物与邻邑同享。】" },
                { context: "上九：既雨既处，尚德载，妇贞厉，月几望，君子征凶。【上九：久雨新停，还赶得上栽种作物。妇女占得此爻则凶险。夏历某月十四日君子离家出行也有危险。】" },
            ],
        }, {
            title: "风泽中孚61 -- 中孚，豚鱼吉。利涉大川。利贞。【豚鱼献祭，虽物薄但心诚，吉利。并利于涉水过河。这是吉利的贞卜。】",
            data: [
                { context: "初九：虞吉，有它不燕。【初九：行安神之礼，吉利。有这样的变故，自然不行讌礼。】" },
                { context: "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。【九二：老鹤在树荫下鸣叫，小鹤在旁边附和。我有美酒，与你共享用。 】" },
                { context: "六三：得敌，或鼓或罢，或泣或歌。【六三：击败了敌人，有的击鼓追击，有的凯旋报捷；消息传来，有的高兴得热泪盈眶，有的放声高歌。】" },
                { context: "六四：月几望，马匹亡，无咎。【六四：月中的时候，马匹丢失了，但无大的灾祸。】" },
                { context: "九五：有孚挛如，无咎。【九五：俘虏成群，串连捆绑。没有灾难。】" },
                { context: "上九：翰音登于天，贞凶。【上九：鸡飞到天空。卜问得凶兆。】" },
            ],
        }, {
            title: "风火家人37 -- 家人，利女贞。【卜问妇女之事吉利。】",
            data: [
                { context: "初九：闲有家，悔亡。【初九：防范家庭出现意外事故，没有悔恨。】" },
                { context: "六二：无攸遂，在中馈，贞吉。【六二：妇女在家中料理家务，安排饍食，没有失误，这是吉利之象。】" },
                { context: "九三：家人嗃嗃，悔厉吉；妇人嘻嘻，终吝。【九三：贫困之家，众口嗷嗷待哺，这是愁苦之事，但能辛勤劳作，可以脱贫致富。而富贵之家，骄奢淫逸，妻室儿女只知嬉笑作乐，终将败落。】" },
                { context: "六四：富家，大吉。【六四：幸福家庭，大吉大利。】" },
                { context: "九五：王假有家，勿恤，吉。【九五：君王到家庙祭祀祖先，不要忧虑，祖先福佑家人，凡事吉利。】" },
                { context: "上九：有孚威如，终吉。【上九：君上掌握杀罚之权，威风凛凛，权柄不移，终归吉利。】" },
            ],
        }, {
            title: "风雷益42 -- 益，利有攸往，利涉大川。【筮遇此爻，利于有所往，利于涉水渡河。】",
            data: [
                { context: "初九：利用为大作，元吉，无咎。【初九：筮遇此爻，利于大兴土木，大吉大利，并无灾祸。】" },
                { context: "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。【六二：有人赐予价值十朋的大龟，不可拒违其命。卜问得长久的吉兆。君王祭祀天帝，吉利。】" },
                { context: "六三：益之用凶事，无咎。有孚中行告公用圭。【六三：因为武王逝世，增加祭祀鬼神的祭物，没有灾祸。武庚乘国丧作乱，周公发兵征讨，大获胜仗，抓获俘虏。中衍向周公报告，从而举行祭祀。】" },
                { context: "六四：中行告公从，利用为依迁国。【六四：中衍向周公报告了处理殷室遗民之事，周公听从了，顺利地将殷商遗民分封给各封国。】" },
                { context: "九五：有孚惠心，勿问元吉。有孚惠我德。【九五：捕获了很多俘虏，安抚他们，不必追究，大吉大利。这些俘虏，将感戴我的恩德。】" },
                { context: "上九：莫益之，或击之。立心勿恒，凶。【上九：没有人帮助他，还有人攻击他。在这种情况下，立志不坚定，就要坏事。】" },
            ],
        }, {
            title: "巽为风57 -- 巽，小亨，利有攸往，利见大人。【稍见亨通。利于出行，利于会见王公贵族。 】",
            data: [
                { context: "初六：进退，利武人之贞。【初六：进退听命，这是利于武人的占卜。】" },
                { context: "九二：巽在床下，用史巫纷若，吉，无咎。【九二：病人卧床不起，祝史巫士降神祭祀，禳灾驱鬼，忙碌不停。病情有好转，灾难消除了。】" },
                { context: "九三：频巽，吝。【九三：勉强顺从，其心必不顺畅。】" },
                { context: "六四：悔亡，田获三品。【六四：没有悔恨，狩猎获得各种猎物。】" },
                { context: "九五：贞吉，悔亡，无不利，无初有终，先庚三日，后庚三日，吉。【九五：贞卜得吉兆，没有悔恨，无所不利。虽没有良好的开端，但有良好的结局。时日定在丁日或癸日，其事一定成功。】" },
                { context: "上九：巽在床下，丧其资斧，贞凶。【上九：人隐伏在床底下，钱财则被洗劫一空。卜问得凶兆。】" },
            ],
        }, {
            title: "风水涣59 -- 涣，亨。王假有庙，利涉大川，利贞。【亨通，因为君王亲临宗庙，禳灾祈福。并利于涉水过江河。这是吉利的贞卜。】",
            data: [
                { context: "初六：用拯马壮，吉。【初六：洪水突来，因而乘马逃避，匆促跌伤，幸免淹亡之祸，吉利。】" },
                { context: "九二：涣奔其机，悔亡。【九二：洪水奔涌，冲毁房基。性命无虞。不章中之万幸。】" },
                { context: "六三：涣其躬，无悔。【六三：洪水冲到身上，幸免于难，尚可庆幸。】" },
                { context: "六四：涣其群，元吉。涣有丘，匪夷所思。【六四：洪水冲向人群，然而十分幸运，因为人群聚集在山丘上，洪水只能淹到山脚，否则其后果是平常难以想像的。】" },
                { context: "九五：涣汗其大号，涣王居。无咎。【九五：洪水横溢，淹没国都，淹及王宫，牵好人员早巳撤走，没有大的灾难。】" },
                { context: "上九：涣其血去，狄出，无咎。【上九：洪水退去，忧患消除，但仍须警惕，加强防范，这样就没有灾难。】" },
            ],
        }, {
            title: "风山渐53 -- 渐，女归，吉，利贞。【女大当嫁，这是好事。这是吉利的贞卜。】",
            data: [
                { context: "初六：鸿渐于干，小子厉，有言，无咎。【初六：鸿雁走进了山涧。筮遇此爻，警惕小孩顽皮，遭遇危险，应该加以谴责，则没有灾难。】" },
                { context: "六二：鸿渐于磐，饮食衍衍，吉。【六二：鸿雁走上水边高地，饱饮饱食，自得喜乐。筮遇此爻，吉利。】" },
                { context: "九三：鸿渐于陆，夫征不复，妇孕不育，凶。利用御寇。【九三：鸿雁走到旱地上。筮遇此爻，丈夫出征可能不再回返，妇女怀孕可能流产，这是凶险之兆。但有利于抵御敌寇。】" },
                { context: "六四：鸿渐于木，或得其桷，无咎。【六四：鸿雁飞到树木上，有的停息在河边堆放的桷木上。筮遇此爻，没有灾难。】" },
                { context: "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。【九五：鸿雁走到山陵上。筮遇此爻，妻子多年不能怀孕，但始终不会被人取代，吉利。】" },
                { context: "上九：鸿渐于陆，其羽可用为仪，吉。【上九：鸿雁走到山头上，它的羽毛可用来编织舞具。这是吉利之兆。】" },
            ],
        }, {
            title: "风地观20 -- 观，盥而不荐，有孚颙若。【祭祀时灌酒降神而不献人牲，因为用作祭祀的俘虏的头部肿了，不能用作祭品。】",
            data: [
                { context: "初六：童观，小人无咎，君子吝。【初六：愚蠢近视，对一般百姓来讲尚无大碍，但对于担负政治责任的君子来说，将会铸成大错。】" },
                { context: "六二：闚观，利女贞。【六二：囿于一孔之见，这是有利于女人的贞兆。】" },
                { context: "六三：观我生，进退。【六三：观察亲族的思想动向，从而决定为政的措施。】" },
                { context: "六四：观国之光，利用宾于王。【六四：观察国家政绩风俗的辉煌表现。筮遇此爻，有利于朝觐君王。】" },
                { context: "九五：观我生，君子无吝。【九五：善于观察亲族之意向，君子可以无过错。】" },
                { context: "上九：观其生，君子无吝。【上九：观察其他部族的意向，君子可以无过错。】" },
            ],
        }, {
            title: "水天需05 -- 需，有孚，光亨，贞吉。利涉大川。【抓到俘虏。大吉大利，吉利的卜问。有利于涉水渡河。】",
            data: [
                { context: "初九：需于郊。利用恒，无咎。【初九：在郊外等侯，应该照旧等待下去，没有危险。】" },
                { context: "九二：需于沙。小有言，终吉。【九二：在沙地上等待，稍微有过错，最后还是吉利的。】" },
                { context: "九三：需于泥，致寇至。【九三：在泥淖中等待，把强盗招引过来。】" },
                { context: "六四：需于血，出自穴。【六四：起初在血泊中滞留，后来从凶险的陷阱中逃脱出来。】" },
                { context: "九五：需于酒食，贞吉。【九五：在酒宴上等待，这是吉利的占兆。】" },
                { context: "上六：入于穴，有不速之客三人来，敬之，终吉。【上六：进入地穴式的房屋，有三位不速之客来到，恭敬地接待他们，结果是吉利的。】" },
            ],
        }, {
            title: "水泽节60 -- 节，亨，苦节不可贞。【亨通。如果以节制为苦，其凶吉则不可卜问。】",
            data: [
                { context: "初九：不出户庭，无咎。【初九：筮遇此爻，杜门不出，没有灾祸。】" },
                { context: "九二：不出门庭，凶。【九二：筮遇此爻，杜门不出，也有凶险。】" },
                { context: "六三：不节若、则嗟若，无咎。【六三：不节俭则困穷，处困穷则知悔过，知悔过则可以无灾难。】" },
                { context: "六四：安节，亨。【六四：安于节俭遵礼的生活，通泰。】" },
                { context: "九五：甘节，吉，往有尚。【九五：以节俭遵礼为乐，吉利。秉此而行，所往必得别人资助。】" },
                { context: "上六：苦节，贞凶，悔亡。【上六：以节俭遵礼为苦，卜问得凶兆，其人将为家道败落而悔恨。 】" },
            ],
        }, {
            title: "水火既济63 -- 既济，亨小，利贞。初吉，终乱。【亨通。这是小见吉利的贞卜。起初吉利，最后将发生变故。】",
            data: [
                { context: "初九：曳其轮，濡其尾，无咎。【初九：提着腰带过河，打湿了衣尾。没有大问题。】" },
                { context: "六二：妇丧其茀茀、勿逐，七日得。【六二：妇人丢失了头巾，不用寻找，七日内可以不寻而得。】" },
                { context: "九三：高宗伐鬼方，三年克之，小人勿用。【九三：高宗讨伐鬼方，费时三年才打败它。筮遇此爻，不可重用小人。】" },
                { context: "六四：濡有衣袽，终日戒。【六四：撑着用败絮塞罅漏的船，整日里提心吊胆。 】" },
                { context: "九五：东邻杀牛，不如西郊之瀹祭，实受其福。【九五：东邻杀牛，不如西邻之礿祭①，实受其福。】" },
                { context: "上六：濡其首，厉。【上六：涉水过河，水拍湿其头部，危险。】" },
            ],
        }, {
            title: "水雷屯03 -- 屯，元亨，利贞。勿用有攸往，利建侯。【大吉大利，吉利的占卜。不利于出门。有利于建国封侯。】",
            data: [
                { context: "初九：磐桓，利居贞，利建侯。【初九：徘徊难进。这是有利于居住的卜问。巫遇此爻，有利于建国封侯。】" },
                { context: "六二：屯如邅（走）如，乘马班如。匪寇婚媾，女子贞，不字，十年乃字。【六二：逡巡不前。行路踌躇，驾着马车原地回旋，不是前来抢劫，而是迎娶新娘。占得这个女子不能孕育，十年才能怀孕。】" },
                { context: "六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。【六三：追捕野鹿，没有充当向导的官员。思忖着鹿逃入山林。君子机灵，认为不如放弃。深入山林，认为会有危险。】" },
                { context: "六四：乘马班如，求婚媾，往，吉无不利。【六四：驾着马车原地回旋，这是寻求婿姻。放胆前进，必定吉利。】" },
                { context: "九五：屯其膏，小，贞吉；大，贞凶。【九五：屯积肥肉。筮遇此爻，问小事则吉，问大事则凶。】" },
                { context: "上六：乘马班如，泣血涟如。【上六：驾着马车原地回旋，哭泣无声，滴泪涟涟。】" },
            ],
        }, {
            title: "水风井48 -- 井，改邑不改井。无丧无得，往来井井。汔至，亦未繘井，赢其瓶，凶。【改建邑落而不改建水井，等于什么也没有干。人们往来井边汲水，水井干涸淤塞，不去加以淘洗，反而将吊水罐打破，这是凶险之象。】",
            data: [
                { context: "初六：井泥不食，旧井无禽。【初六：井水混浊不可食用。墤塌的陷阱已关不住野兽。】" },
                { context: "九二：井谷射鲋，瓮敝漏。【九二：在井口张弓射井中小鱼。瓮瓶又破又漏。】" },
                { context: "九三：井渫不食，为我心恻，可用汲。王明，并受其福。【九三：君上看见井水污浊不能食用，为我们感刭伤心。淘洗干净，就可汲饮。君上英明呵，众人都获得他们的好处。】" },
                { context: "六四：井渫无咎。【六四：用砖石垒筑井壁，进行顺利。】" },
                { context: "九五：井冽，寒泉食。【九五：水洁泉寒，清凉可口，可以食用。】" },
                { context: "上六：井收勿幕，有孚元吉。【上六：陷阱下宽上窄，十分隐蔽，甚至可以不加伪装。果然捕获了野兽，大吉大利。】" },
            ],
        }, {
            title: "坎为水29 -- 坎，习坎有孚维心，亨，行有尚。【习坎卦。抓获俘虏，劝慰安抚他们，通泰。途中将得到帮助。】",
            data: [
                { context: "初六：习坎，入于坎窞，凶。【初六：坎坑之中又有坎坑，陷入重坑之中，凶险。】" },
                { context: "九二：坎有险，求小得。【九二：坑坑坎坎，道有险阻。敢于行险道，或小有收获。】" },
                { context: "六三：来之坎，坎险阻枕。入于坎窞，勿用。【六三：向坑坎走来，这坑坎既险又深，陷入重坎之中，非常不利。】" },
                { context: "六四：樽酒，簋贰，用缶。纳约自牖，终无咎。【六四：用铜樽盛酒，用圆簋盛饭。然而对于关押在坎窖里的犯人，只须用瓦盆子就行了，牢饭从天窗里送进取出，其人遭此噩运，但最后还是没有危险。】" },
                { context: "九五：坎不盛，祗既平，无咎。【九五：坎坑虽没有填满，小山头却被锄平。没有灾难。】" },
                { context: "上六：系用微纆，置于丛棘，三岁不得，凶。【上六：把犯人用绳索捆紧，投入周围有丛棘的监狱中，三年不得释放，这是凶脸之事。】" },
            ],
        }, {
            title: "水山蹇 -- 蹇，利西南，不利东北，利见大人，贞吉。",
            data: [
                { context: "初六：往蹇，来誉。" },
                { context: "六二：王臣蹇蹇，匪躬之故。" },
                { context: "九三：往蹇，来反。" },
                { context: "六四：往蹇，来连。" },
                { context: "九五：大蹇，朋来。" },
                { context: "上六：往蹇，来硕，吉。利见大人。" },
            ],
        }, {
            title: "水地比 -- 比，吉。原筮，元永贞，无咎。不宁方来，后夫凶。",
            data: [
                { context: "初六：有孚比之，无咎。有孚盈缶，终来有它，吉。" },
                { context: "六二：比之自内，贞吉。" },
                { context: "六三：比之匪人。" },
                { context: "六四：外比之，贞吉。" },
                { context: "九五：显比，王用三驱，失前禽。邑人不诫，吉。" },
                { context: "上六：比之无首，凶。" },
            ],
        }, {
            title: "山天大畜 -- 大畜，利贞。不家食、吉。利涉大川。",
            data: [
                { context: "初九：有厉，利已。" },
                { context: "九二：舆说輹。" },
                { context: "九三：良马逐，利艰贞。曰闲舆卫，利有攸往。" },
                { context: "六四：童牛之捁，元吉。" },
                { context: "六五： 豮豕之牙，吉。" },
                { context: "上九：何天之衢，亨。" },
            ],
        }, {
            title: "山泽损 -- 损，有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。",
            data: [
                { context: "初九：巳事端往，无咎；酌损之。" },
                { context: "九二：利贞，征凶，弗损，益之。" },
                { context: "六三：三人行则损一人，一人行则得其友。" },
                { context: "六四：换其疾，使遄有喜，无咎。" },
                { context: "六五：或益之十朋之龟，弗克违，元吉。" },
                { context: "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。" },
            ],
        }, {
            title: "山火贲 -- 贲，亨，小利有攸往。",
            data: [
                { context: "初九：贲其趾，舍车而徒。" },
                { context: "六二：贲其须。" },
                { context: "九三：贲如濡如，永贞吉。" },
                { context: "六四：贲如皤如，白马翰如，匪寇婚媾。" },
                { context: "六五：贲于丘园，束帛戈戈，吝，终吉。" },
                { context: "上九：白贲，无吝。" },
            ],
        }, {
            title: "山雷颐 -- 颐，贞吉。观颐，自求口实。",
            data: [
                { context: "初九：舍尔灵龟，观我朵颐，凶。" },
                { context: "六二：颠颐，拂经，于丘颐，征凶。" },
                { context: "六三：拂颐，贞凶，十年勿用，无莜利。" },
                { context: "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。" },
                { context: "六五：拂经，居贞，吉，不可涉大川。" },
                { context: "上九：由颐，厉，吉，利涉大川。" },
            ],
        }, {
            title: "山风蛊 -- 蛊，元亨，利涉大川，先甲三日，后甲三日。",
            data: [
                { context: "初六：干父之蛊，有子，考无咎。厉，终吉。" },
                { context: "九二：干母之蛊，不可贞。" },
                { context: "九三：干父之蛊，小有悔，无大咎。" },
                { context: "六四：裕父之蛊，往见吝。" },
                { context: "六五：干父之蛊，用誉。" },
                { context: "上九：不事王侯，高尚其事。" },
            ],
        }, {
            title: "山水蒙 -- 蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
            data: [
                { context: "初六：发蒙，利用刑人，用说桎梏，以往吝。" },
                { context: "九二：包蒙吉，纳妇吉，子克家。" },
                { context: "六三：勿用取女，见金夫，不有躬，无攸利。" },
                { context: "六四：困蒙，吝。" },
                { context: "六五：童蒙，吉。" },
                { context: "上九：击蒙。不利，为寇；利，御寇。" },
            ],
        }, {
            title: "艮为山 -- 艮其背，不获其身，行其庭，不见其人，无咎。",
            data: [
                { context: "初六：艮其趾，无咎，利永贞。" },
                { context: "六二：艮其腓，不拯其随，其心不快。" },
                { context: "九三：艮其限，列其夤，厉熏心。" },
                { context: "六四：艮其身，无咎。" },
                { context: "六五：艮其辅，言有序，悔亡。" },
                { context: "上六：敦艮，吉。" },
            ],
        }, {
            title: "山地剥 -- 剥，不利有攸往。",
            data: [
                { context: "初六：剥床以足，蔑贞，凶。" },
                { context: "六二：剥床以辨，蔑贞，凶。" },
                { context: "六三：剥之，无吝。" },
                { context: "六四：剥床以肤，凶。" },
                { context: "六五：贯鱼以宫人宠，无不利。" },
                { context: "上九：硕果不食，君子得舆，小人剥庐。" },
            ],
        }, {
            title: "地天泰 -- 泰，小往大来，吉，亨。",
            data: [
                { context: "初九：拔茅茹以其汇，征吉。" },
                { context: "九二：包荒，用冯河。不遐遗，朋亡，得尚于中行。" },
                { context: "九三：无平不陂，无往不复。艰贞无咎，勿恤其孚，于食有福。" },
                { context: "九四：六四：翩翩，不富以其邻，不戒以孚。或跃在渊，无咎。" },
                { context: "六五：帝乙归妹以祉，元吉。" },
                { context: "上六：城复于隍，勿用师，自邑告命。贞吝。" },
            ],
        }, {
            title: "地泽临 -- 临，元亨，利贞。至于八月有凶。",
            data: [
                { context: "初九：咸临，贞吉。" },
                { context: "九二：咸临，吉，无不利。" },
                { context: "六三：甘临，无攸利，既忧之，无咎。" },
                { context: "六四：至临，无咎。" },
                { context: "六五：知临，大君之宜，吉。" },
                { context: "上六：敦临，吉，无咎。" },
            ],
        }, {
            title: "地火明夷 -- 明夷，利艰贞。",
            data: [
                { context: "初九：明夷于飞，垂其翼，君子于行，三日不食，有攸往，主人有言。" },
                { context: "六二：明夷,夷于左股，用拯马壮，吉。" },
                { context: "九三：明夷于南狩，得其大首，不可疾贞。" },
                { context: "六四：入于左腹，获明夷之心，于出门庭。" },
                { context: "六五：箕子之明夷，利贞。" },
                { context: "上六：不明晦，初登于天，后入于地。" },
            ],
        }, {
            title: "地雷复 -- 复，亨，出入无疾，朋来，无吝。反复其道，七日来复，利有攸往。",
            data: [
                { context: "初九：不远复，无祗悔，无吉。" },
                { context: "六二：休复，吉。" },
                { context: "六三：频复，厉，无咎。" },
                { context: "六四：中行独复。" },
                { context: "六五：敦复，无悔。" },
                { context: "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年不克征。" },
            ],
        }, {
            title: "地风升 -- 升，元亨，用见大人，勿恤，南征吉。",
            data: [
                { context: "初六：允升，大吉。" },
                { context: "九二：孚乃利用禴，无咎。" },
                { context: "九三：升虚邑。" },
                { context: "六四：王用享于岐山，吉，无咎。" },
                { context: "六五：贞吉，升阶。" },
                { context: "上六：冥升，利于不息之贞。" },
            ],
        }, {
            title: "地水师 -- 师，贞丈人。吉，无咎。",
            data: [
                { context: "初六：师出以律，否藏凶。" },
                { context: "九二：在师中，吉，无咎。王三锡命。" },
                { context: "六三：师或舆尸，凶。" },
                { context: "六四：师左次，无咎。" },
                { context: "六五：田有禽，利执言，无吝。长子帅师，弟子舆尸，贞凶。" },
                { context: "上六：大君有命，开国承家，小人勿用。" },
            ],
        }, {
            title: "地山谦 -- 谦，亨，君子有终。",
            data: [
                { context: "初六：谦谦君子，用涉大川，吉。" },
                { context: "六二：鸣谦，贞吉。" },
                { context: "九三：劳谦，君子有终，吉。" },
                { context: "六四：无不利，撝谦。" },
                { context: "六五：不富以其邻，利用侵伐，无不利。" },
                { context: "上六：鸣谦，利用行师，征邑国。" },
            ],
        }, {
            title: "坤为地 -- 坤，元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。",
            data: [
                { context: "初六：履霜，坚冰至。" },
                { context: "六二：直方大，不习无不利。" },
                { context: "六三：含章可贞。或从王事，无成有终。" },
                { context: "六四：括囊，无咎、无誉。" },
                { context: "六五：黄裳元吉。" },
                { context: "上六：龙战于野，其血玄黄。" },
                { context: "用六：利永贞。" },
            ],
        },]
    }
    ]
}
data = [demo]

