var demo = {
    title: "周易口诀",
    name: "周易口诀",
    data: [{
        title: "八卦方位的五行口诀",
        data: [
            { context: "乾三连、坤六断;离中虚、坎中满;震仰盂、艮覆碗;兑上缺，巽下断。" },
            { context: "乾三连西北开天;坤六断西南八地。" },
            { context: "兑上缺西方双泽;巽下断东南无风。" },
            { context: "艮覆碗东北齐山;震仰盂东方四雷。" },
            { context: "离中虚南方真火;坎中满北方六水。" },
            { context: "八卦相错重叠生;六十四卦化万象。" },
            { context: "天地造化定乾坤;雷厉风行必相薄。" },
            { context: "山泽相连可通气;水火相克不相射。" },
        ]
    }, {
        title: "六十四卦口诀",
        data: [
            { context: "乾坤屯蒙需讼师，比小畜兮履泰否。" },
            { context: "同人大有谦豫随，蛊临观兮噬嗑贲。" },
            { context: "剥复无妄大畜颐，大过坎离三十备。" },
            { context: "咸恒遁兮及大状，晋及明夷家人睽。" },
            { context: "蹇解损益夬姤萃，升困井革鼎震继。" },
            { context: "艮渐归妹丰旅巽，兑涣节兮中孚至。" },
            { context: "小过既济兼未济，是为下经三十四。" },
            { context: "火（离）：火地晋，火山旅，火水未济，火风鼎，火雷噬嗑，火火离，火泽睽，火天大有。" },
            { context: "水（坎）：水地比，水山蹇，水水坎，水风井，水雷屯，水火既济，水泽节，水天需。" },
            { context: "山（艮）：山地剥，山山艮，山水蒙，山风蛊，山雷颐，山火贲，山泽损，山天大畜。" },
            { context: "泽（兑）：泽地萃，泽山咸，泽水困，泽风大过，泽雷随，泽火革，泽泽兑，泽天夬。" },
            { context: "雷（震）：雷地豫，雷山小过，雷水解，雷风恒，雷雷震，雷火丰，雷泽归妹，雷天大壮。" },
            { context: "风（巽）：风地观，风山渐，风水涣，风风巽，风雷益，风火家人，风泽中孚，风天小畜。" },
            { context: "地（坤）：地地坤，地山谦，地水师，地风升，地雷复，地火明夷，地泽临，地天泰。" },
            { context: "天（乾）：天地否，天山遁，天水讼，天风姤，天雷无妄，天火同人，天泽履，天天乾。" },
        ]
    }, {
        title: "八卦方位的五行口诀",
        data: [
            { context: "人不为己天地灭;(人只要不自私，不只是为了自己谋福利，他可以放心的去做任何事情，天地都没了，天地都管不了你。)" },
            { context: "信口开河可通神。(只要你的心能相信的话，随便你怎么说，所预测的结果都是准确的，是和神灵所相通的。)" },
            { context: "言词表达需注意;(在说话的时候语言表达很重要，要把不好听的说好听，把好听的说的动听。比如你想说这个人很胖，你要说他身体好、有福相、讨人喜欢;比如你想说这个人很瘦，你要说他很精干，精神好;比如你想说一个人和老婆身高不般配，一个很高，一个很矮，你要说阴阳平衡。等......)" },
            { context: "恰如其分通天理。(在那样的环境或磁场内，不加一分也不减一分，加一分，过了，减一分，不够，说的恰到好处，说的对方不断的点头就好。这和天的道理是一样的。)" },
            { context: "两两相克叫制约;(当你说到五行相克的时候，要以制约、控制约束、平衡制约来表达。)" },
            { context: "生生不息为有利。(当你说五行相生的时候，要以源源不断的帮助、有利、有好处等来表达。)" },
            { context: "阴阳重叠必相吸;(当五行有阴阳性质的时候，要说相互之间的联系很深，是相吸引的。)" },
            { context: "同类比和阴阳理。(当五行阴阳性质相同时，要以物以类聚、人以群分来打比喻。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [
            { context: "象中有数数中理;(万事万物的现象之中，一定存在着定数12345678......，而定数之中又包含道理：五行生克制化。)" },
            { context: "以道观象明数理。(我们观察事物时要以道(自然的真理)来看，从而知道了这些现象中的定数与五行生克制化。)" },
            { context: " 以理言事真无比;(然后以五行生克制化的理来判断事物，把结果表达出来，就是预测的正确结果。)" },
            { context: "不可不信妙无许。(学会了这些道理，是妙不可言的，就像掌握了未来那样，很是自在。)" },
            { context: "心若无欲心则灵;(在预测时，心中如果没有任何的贪婪与自私的话，心就一定灵验，心所想的就是准确的预测结果。)" },
            { context: "心无挂碍言出行。(在判断事物时，不要怀疑自己，放心，没有任何的障碍，说出来一定会应验。)" },
            { context: "法外无法无定法;(预测方法就这么简单，完全是在易经范畴之内的，但方法也不是固定的，要活学活用啊。)" },
            { context: "不拘古法心为法。(不要拘泥于原先人们的那些预测的方法，以自己的心为主才是好方法。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "注意事项：",
        data: [
            { context: "心血来潮读易经;(我读易经是心血来潮读的，这里主要是读《易传》，易传是易经的解释，又称十翼，是给易经装的十支翅膀，毕竟易经是上古人士作的，我们看不懂，也不必看懂，只要理解了易传的含义，把握其中的精华所在，然后和自己的体悟融会贯通，但一定要熟记64卦的挂名就可以了。易经一定有它简易的一面，我们就从简单的入手就好。)" },
            { context: "读懂易经神来到。(其实，读懂易传足够了，根本就不必去再读易经原文了，就像自己就是神仙那样，很舒服自在。)" },
            { context: "顺手拈来八卦象;(预测未来完全是任凭心血来潮、随意找出卦象来。)" },
            { context: "鬼使神差不枉然。(就算是写错了八卦，搞错了卦理，说出来的结果也是准确的，就这么怪。)" },
            { context: "世间本无善与恶;(其实啊，人世间并没有善与恶的分别，只是人们自己分开来的。)" },
            { context: "因果循环天理合。(宇宙间只有因果的天理在循环。)" },
            { context: "吉中有凶凶藏吉;(其实，所有的事物皆是如此，好事情中总是有不完美的地方，坏事情中也有好的地方。)" },
            { context: "居安思危便化无。(如果能做到顺境中考虑到逆境会到来的话，做好预防措施，逆境就永远不会来到，凶也能化为吉了。)" },
        ]
    },
    ]
}
var demo01 = {
    title: "周易爻辞",
    name: "周易爻辞",
    data: [{
        title: "乾卦(☰)",
        data: [{
            title: "乾为天 -- 卦辞：乾，元，亨，利，贞。",
            data: [
                { context: "初九：潜龙，勿用。" },
                { context: "九二：见龙在田，利见大人。" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。" },
                { context: "九四：或跃在渊，无咎。" },
                { context: "九五：飞龙在天，利见大人。" },
                { context: "上九：亢龙有悔。" },
                { context: "用九：见群龙，无首吉。" },
            ],
        }, {
            title: "天泽履 -- 卦辞：履虎尾，不咥人，亨。",
            data: [
                { context: "初九：素履往，无咎。" },
                { context: "九二：履道坦坦，幽人贞吉。" },
                { context: "六三：眇能视，跛能履，履虎尾，咥人凶，武人为于大君。" },
                { context: "九四：履虎尾，愬愬，终吉。" },
                { context: "九五：夬履，贞厉。" },
                { context: "上九：视履考祥，其旋元吉。" },
            ],
        }, {
            title: "天火同人 -- 同人于野，亨。利涉大川，利君子贞。",
            data: [
                { context: "初九：同人于门，无咎。" },
                { context: "六二：同人于宗，吝。" },
                { context: "九三：伏戎于莽。升其高陵，三岁不兴。" },
                { context: "九四：乘其墉，弗克攻，吉。" },
                { context: "九五：同人，先号咷而后笑，大师克相遇。" },
                { context: "上九：同人于郊，无悔。" },
            ],
        }, {
            title: "天雷无妄 -- 无妄，元亨利贞。其匪正有眚，不利有攸往。",
            data: [
                { context: "初九：无妄，往吉。" },
                { context: "六二：不耕获，不菑畬，则利有攸往。" },
                { context: "六三：无妄之灾，或系之牛，行人之得，邑人之灾。" },
                { context: "九四：可贞，无咎。" },
                { context: "九五：无妄之药，勿药有喜。" },
                { context: "上九：无妄行有眚，无攸利。" },
            ],
        }, {
            title: "天风姤 -- 姤，女壮，勿用取女。",
            data: [
                { context: "初六：系于金柅，贞吉。有攸往，见凶，赢豕孚蹢躅。" },
                { context: "九二：包有鱼，无咎，不利宾。" },
                { context: "九三：臀无肤，其行次且，厉，无大咎。" },
                { context: "九四：包无鱼，起凶。" },
                { context: "九五：以杞包瓜，含章，有损自天。" },
                { context: "上九：姤其角，吝；无咎。" },
            ],
        }, {
            title: "天水讼 -- 讼，有孚，窒惕。中吉，终凶。利见大人，不利涉大川。",
            data: [
                { context: "初六：不永所事，小有言，终吉。" },
                { context: "九二：不克讼，归而逋，其邑人三百户无眚。" },
                { context: "六三：食旧德，贞厉，终吉。或从王事，无成。" },
                { context: "九四：不克讼，复即命，渝安贞，吉。" },
                { context: "九五：讼，元吉。" },
                { context: "上九：或锡之鞶带，终朝三褫之。" },
            ],
        }, {
            title: "天山遁 ---  遁，亨，小利贞。",
            data: [
                { context: "初六：遁尾，厉，勿用有攸往。" },
                { context: "六二：执之用黄牛之革，莫之胜说。" },
                { context: "九三：系遁，有疾厉，蓄臣妾，吉。" },
                { context: "九四：好遁，君子吉，小人否。" },
                { context: "九五：嘉遁，贞吉。" },
                { context: "上九：肥遁，无不利。" },
            ],
        }, {
            title: "天地否 -- 否之匪人，不利君子贞，大往小来。",
            data: [
                { context: "初六：拔茅茹以其汇，贞吉，亨。" },
                { context: "六二：包承，小人吉，大人否亨。" },
                { context: "六三：包羞。" },
                { context: "九四：有命，无咎。畴离祉。" },
                { context: "九五：休否，大人吉。其亡其亡，系于苞桑。" },
                { context: "上九：倾否，先否后喜。" },
            ],
        },]
    }, {
        title: "兑卦(☱)",
        data: [{
            title: "泽天夬 -- 夬，杨于王庭，孚号有厉，告自邑，不利即戎，利有攸往。",
            data: [
                { context: "初九：壮于前趾，往不胜，为咎。" },
                { context: "九二：惕号，莫夜有戎，勿恤。" },
                { context: "九三：壮于頄，有凶，君子夬夬，独行遇雨若濡，有愠，无咎。" },
                { context: "九四：臀无肤，其行次且，索羊悔亡，闻言不信。" },
                { context: "九五：苋陆夬夬，中行无咎。" },
                { context: "上六：无号，终有凶。" },
            ],
        }, {
            title: "兑为泽 -- 兑，亨，利贞。",
            data: [
                { context: "初九：和兑，吉。" },
                { context: "九二：孚兑，吉。悔亡。" },
                { context: "六三：来兑，凶。" },
                { context: "九四：商兑未宁，介疾有喜。" },
                { context: "九五：孚于剥，有厉。" },
                { context: "上六：引兑。" },
            ],
        }, {
            title: "泽火革 -- 革，巳日乃孚，元亨利贞，悔亡。",
            data: [
                { context: "初九：巩用黄牛之革。" },
                { context: "六二：巳日乃革之，征吉，无咎。" },
                { context: "九三：征凶，贞厉。革言三就，有孚。" },
                { context: "九四：悔亡，有孚，改命吉。" },
                { context: "九五：大人虎变，未占有孚。" },
                { context: "上六：君子豹变，小人革面，征凶，居贞吉。" },
            ],
        }, {
            title: "泽雷随 --- 随，元亨，利贞，无咎。",
            data: [
                { context: "初九：官有渝，贞吉，出门交有功。" },
                { context: "六二：系小子，失丈夫。" },
                { context: "六三：系丈夫，失小子。随有求得，利居贞。" },
                { context: "九四：随有获，贞凶。有孚在道，以明，何咎？" },
                { context: "九五：孚于嘉，吉。" },
                { context: "上六；拘系之，乃从维之，王用亨于西山。" },
            ],
        }, {
            title: "泽风大过 -- 大过，栋桡，利于攸往，亨。",
            data: [
                { context: "初六：籍用白茅，无咎。" },
                { context: "九二：枯杨生秭，老夫得其女妻，无不利。" },
                { context: "九三：栋桡，凶。" },
                { context: "九四：栋隆，吉，有它吝。" },
                { context: "九五：枯杨生华，老妇得其士夫，无咎，无誉。" },
                { context: "上六：过涉灭顶，凶，无吝。" },
            ],
        }, {
            title: "泽水困 -- 困，亨，贞，大人吉，无咎。有言不信。",
            data: [
                { context: "初六：臀困于株木，入于幽谷，三岁不觌。" },
                { context: "九二：困于酒食，朱绂方来，利用享祀，征凶，无咎。" },
                { context: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。" },
                { context: "九四：来徐徐，困于金车，吝，有终。" },
                { context: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。" },
                { context: "上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。" },
            ],
        }, {
            title: "泽山咸 -- 咸，亨，利贞。娶女，吉。",
            data: [
                { context: "初六：咸其拇。" },
                { context: "六二：咸其腓，凶，居吉。" },
                { context: "九三：咸其股，执其随，往蔺吝。" },
                { context: "九四：贞吉，悔亡。憧憧往来，朋从尔思。" },
                { context: "九五：咸其脢，无悔。" },
                { context: "上六：咸其辅颊舌。" },
            ],
        }, {
            title: "泽地萃 -- 萃，亨。王假有庙。利见大人，亨，利贞，用大牲吉，利有攸往。",
            data: [
                { context: "初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。" },
                { context: "六二：引吉，无咎，孚乃利用禴。" },
                { context: "六三：萃如嗟如，无攸利，往无咎，小吝。" },
                { context: "九四：大吉无咎。" },
                { context: "九五：萃有位，无咎。匪孚，元永贞，悔亡。" },
                { context: "上六：赍咨涕洟，无咎。" },
            ],
        },]
    }, {
        title: "离卦(☲)",
        data: [{
            title: "火天大有 -- 大有，元亨。",
            data: [
                { context: "初九：无交害，匪咎艰则无咎。" },
                { context: "九二：大车以载，有攸往，无咎。" },
                { context: "九三：公用亨于天子，小人弗克。" },
                { context: "九四：匪其彭，无咎。" },
                { context: "六五：厥孚交如，威如，吉。" },
                { context: "上九：自天祐之，吉，无不利。" },
            ],
        }, {
            title: "火泽睽 -- 睽，小事吉。",
            data: [
                { context: "初九：悔亡。丧马勿逐，自复。见恶人，无咎" },
                { context: "九二：遇主于巷，无咎。" },
                { context: "六三：见舆曳，其牛掣，其人天且劓，无初，有终。" },
                { context: "九四：睽孤遇元夫，交孚，历无咎。" },
                { context: "六五：悔亡，厥宗噬肤，往何咎。" },
                { context: "上九：睽孤见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。" },
            ],
        }, {
            title: "离为火 -- 离，利贞，亨。畜 牛牝吉。",
            data: [
                { context: "初九：履错然敬之，无咎。" },
                { context: "六二：黄离，元吉。" },
                { context: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。" },
                { context: "九四：突如其来如，焚如，死如，弃如。" },
                { context: "六五：出涕沱若，戚嗟若，吉。" },
                { context: "上九：王用出征，有嘉折首，获匪其丑，无咎。" },
            ],
        }, {
            title: "火雷噬嗑 -- 噬嗑，亨，利用狱。",
            data: [
                { context: "初九：屦校灭趾，无咎。" },
                { context: "六二：噬肤灭鼻，无咎。" },
                { context: "六三：噬腊肉，遇毒，小吝，无咎。" },
                { context: "九四：噬干胏，得金矢，利艰贞，吉。" },
                { context: "六五：噬干肉，得黄金，贞厉，无咎。" },
                { context: "上九：何校灭耳，凶。" },
            ],
        }, {
            title: "火风鼎 -- 鼎，元吉，亨。",
            data: [
                { context: "初六：鼎颠趾，利出否，得妾以其子，无咎。" },
                { context: "九二：鼎有实，我仇有疾，不我能即，吉。" },
                { context: "九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。" },
                { context: "九四：鼎折足，覆公餗，其形渥，凶。" },
                { context: "六五：鼎黄耳，金铉，利贞。" },
                { context: "上九：鼎玉铉，大吉无不利。" },
            ],
        }, {
            title: "火水未济 -- 未济，亨。小狐泛济，濡其尾，无攸利。",
            data: [
                { context: "初六：濡其尾，吝。" },
                { context: "九二：曳其轮，贞吉。" },
                { context: "六三：未济，征凶，利涉大川。" },
                { context: "九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。" },
                { context: "六五：贞吉，无悔，君子之光有孚，吉。" },
                { context: "上九：有孚于饮酒，无咎。濡其首，有孚矢是。" },
            ],
        }, {
            title: "火山旅 -- 旅，小亨，旅，贞吉。",
            data: [
                { context: "初六：旅琐琐，斯其所取灾。" },
                { context: "六二：旅即次，怀其资，得童仆贞。" },
                { context: "九三：旅焚其次，丧其童仆贞，厉。" },
                { context: "九四：旅于处，得其资斧，我心不快。" },
                { context: "六五：射雉，一矢亡，终以誉命。" },
                { context: "上九：鸟焚其巢，旅人先笑后号啕，丧牛于易，凶。" },
            ],
        }, {
            title: "火地晋 -- 晋，康侯用锡马蕃蔗，昼日三接。",
            data: [
                { context: "初六：晋如、摧如，贞吉。罔孚，裕无咎。" },
                { context: "六二：晋如愁如，贞吉。受兹介福于其王母。" },
                { context: "六三：众允、悔亡。" },
                { context: "九四：晋如鼫鼠，贞厉。" },
                { context: "六五：悔无，失得勿恤，往吉，无不利。" },
                { context: "上九：晋其角，惟用伐邑，厉吉,，无咎，贞吝。" },
            ],
        },]
    }, {
        title: "震卦(☳)",
        data: [{
            title: "雷天大壮 -- 大壮，利贞。",
            data: [
                { context: "初九：壮于趾，征凶，有孚。" },
                { context: "九二：贞吉。" },
                { context: "九三：小人用壮，君子用罔。祗羊触藩，赢其角。" },
                { context: "九四：贞吉，悔亡。藩决不赢，壮子大舆之輹。" },
                { context: "六五：丧羊于易，无悔。" },
                { context: "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。" },
            ],
        }, {
            title: "雷泽归妹 -- 归妹，征凶，无攸利。",
            data: [
                { context: "初九：归妹以娣，跛能履，征吉。" },
                { context: "九二：眇能视，利幽人之贞。" },
                { context: "六三：归妹以须，反归以娣。" },
                { context: "九四：归妹愆期，迟归有时。" },
                { context: "六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。" },
                { context: "上六：女承筐无实，士刲羊无血，无攸利。" },
            ],
        }, {
            title: "雷火丰 -- 丰，亨，王假之，勿忧，宜日中。",
            data: [
                { context: "初九：遇其配主，虽旬无咎，往有尚。" },
                { context: "六二：丰其蔀，日中见斗，往得疑疾；有孚发若，吉。 " },
                { context: "九三：丰其沛，日中见沫。折旧右肱，无咎。" },
                { context: "九四：丰其部，日中见斗，遇其夷主，吉。" },
                { context: "九五：来章，有庆誉,吉。" },
                { context: "上六：丰其屋，部其家，闚其户，阒其无人，三岁不觌，凶。" },
            ],
        }, {
            title: "震为雷 -- 震，亨，震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。",
            data: [
                { context: "初九：震来虩虩，后笑言哑哑，吉。" },
                { context: "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。" },
                { context: "六三：震苏苏，震行无眚。" },
                { context: "九四：震遂泥。" },
                { context: "六五：震往来厉，亿无丧有事。" },
                { context: "上六：震索索，视矍矍，征凶，震不于其躬，于其邻，无咎。婚媾有言。" },
            ],
        }, {
            title: "雷风恒 -- 恒，亨，无吝，利贞，利有攸往。",
            data: [
                { context: "初六：浚恒，贞凶，无攸利。" },
                { context: "九二：悔亡。" },
                { context: "九三：不恒其德，或承之羞，贞吝。" },
                { context: "九四：田无禽。" },
                { context: "六五：恒其德，贞妇人吉，夫子凶。" },
                { context: "上六：振恒，凶。" },
            ],
        }, {
            title: "雷水解 -- 解，利西南，无所往，其来复，吉。有攸往，夙吉。",
            data: [
                { context: "初六：无咎。" },
                { context: "九二：田获三狐，得黄矢，贞吉。" },
                { context: "六三：负且乘，致寇至，贞吝。" },
                { context: "九四：解而拇，朋至斯孚。" },
                { context: "六五：君子维有解，吉，有孚于小人。" },
                { context: "上六：公用射隼于高墉之上，获之无不利。" },
            ],
        }, {
            title: "雷山小过 -- 小过，亨，利贞，可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。",
            data: [
                { context: "初六：飞鸟以凶。" },
                { context: "六二：过其祖，遇其妣，不及其君，遇其臣，无咎。" },
                { context: "九三：弗过防之，从或戕之，凶。" },
                { context: "九四：无咎，弗过遇之。往厉必戒，勿用永贞。" },
                { context: "六五：密云不雨，自我西郊，公弋取彼在穴。" },
                { context: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。" },
            ],
        }, {
            title: "雷地豫 -- 豫，利建侯，行师。",
            data: [
                { context: "初六：鸣豫，凶。" },
                { context: "六二：介于石，不终日，贞吉。" },
                { context: "六三：盱豫，悔；迟,有悔。" },
                { context: "九四：由豫，大有得，勿疑，朋盍簪。" },
                { context: "六五：贞疾，恒不死。" },
                { context: "上六：冥豫，成有渝，无咎。" },
            ],
        },]
    }, {
        title: "巽卦(☴)",
        data: [{
            title: "风天小畜 -- 小畜，亨。密云不雨，自我西郊。",
            data: [
                { context: "初九：复自道，何其咎，吉。" },
                { context: "九二：牵复，吉。" },
                { context: "九三：舆说辐，夫妻反目。" },
                { context: "六四：有孚，血去惕出，无咎。" },
                { context: "九五：有孚挛如，富以其邻。" },
                { context: "上九：既雨既处，尚德载，妇贞厉，月几望，君子征凶。" },
            ],
        }, {
            title: "风泽中孚 -- 中孚，豚鱼吉。利涉大川。利贞。",
            data: [
                { context: "初九：虞吉，有它不燕。" },
                { context: "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。" },
                { context: "六三：得敌，或鼓或罢，或泣或歌。" },
                { context: "六四：月几望，马匹亡，无咎。" },
                { context: "九五：有孚挛如，无咎。" },
                { context: "上九：翰音登于天，贞凶。" },
            ],
        }, {
            title: "风火家人 -- 家人，利女贞。",
            data: [
                { context: "初九：闲有家，悔亡。" },
                { context: "六二：无攸遂，在中馈，贞吉。" },
                { context: "九三：家人嗃嗃，悔厉吉；妇人嘻嘻，终吝。" },
                { context: "六四：富家，大吉。" },
                { context: "九五：王假有家，勿恤，吉。" },
                { context: "上九：有孚威如，终吉。" },
            ],
        }, {
            title: "风雷益 -- 益，利有攸往，利涉大川。",
            data: [
                { context: "初九：利用为大作，元吉，无咎。" },
                { context: "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。" },
                { context: "六三：益之用凶事，无咎。有孚中行告公用圭。" },
                { context: "六四：中行告公从，利用为依迁国。" },
                { context: "九五：有孚惠心，勿问元吉。有孚惠我德。" },
                { context: "上九：莫益之，或击之。立心勿恒，凶。" },
            ],
        }, {
            title: "巽为风 -- 巽，小亨，利有攸往，利见大人。",
            data: [
                { context: "初六：进退，利武人之贞。" },
                { context: "九二：巽在床下，用史巫纷若，吉，无咎。" },
                { context: "九三：频巽，吝。" },
                { context: "六四：悔亡，田获三品。" },
                { context: "九五：贞吉，悔亡，无不利，无初有终，先庚三日，后庚三日，吉。" },
                { context: "上九：巽在床下，丧其资斧，贞凶。" },
            ],
        }, {
            title: "风水涣 -- 涣，亨。王假有庙，利涉大川，利贞。",
            data: [
                { context: "初六：用拯马壮，吉。" },
                { context: "九二：涣奔其机，悔亡。" },
                { context: "六三：涣其躬，无悔。" },
                { context: "六四：涣其群，元吉。涣有丘，匪夷所思。" },
                { context: "九五：涣汗其大号，涣王居。无咎。" },
                { context: "上九：涣其血去，狄出，无咎。" },
            ],
        }, {
            title: "风山渐 -- 渐，女归，吉，利贞。",
            data: [
                { context: "初六：鸿渐于干，小子厉，有言，无咎。" },
                { context: "六二：鸿渐于磐，饮食衍衍，吉。" },
                { context: "九三：鸿渐于陆，夫征不复，妇孕不育，凶。利用御寇。" },
                { context: "六四：鸿渐于木，或得其桷，无咎。" },
                { context: "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。" },
                { context: "上九：鸿渐于陆，其羽可用为仪，吉。" },
            ],
        }, {
            title: "风地观 -- 观，盥而不荐，有孚颙若。",
            data: [
                { context: "初六：童观，小人无咎，君子吝。" },
                { context: "六二：闚观，利女贞。" },
                { context: "六三：观我生，进退。" },
                { context: "六四：观国之光，利用宾于王。" },
                { context: "九五：观我生，君子无吝。" },
                { context: "上九：观其生，君子无吝。" },
            ],
        },]
    }, {
        title: "坎卦(☵)",
        data: [{
            title: "乾卦 -- 卦辞：乾，元，亨，利，贞。",
            data: [
                { context: "初九：潜龙，勿用。" },
                { context: "九二：见龙在田，利见大人。" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。" },
                { context: "九四：或跃在渊，无咎。" },
                { context: "九五：飞龙在天，利见大人。" },
                { context: "上九：亢龙有悔。" },
                { context: "用九：见群龙，无首吉。" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        },]
    }, {
        title: "艮卦(☶)",
        data: [{
            title: "乾卦 -- 卦辞：乾，元，亨，利，贞。",
            data: [
                { context: "初九：潜龙，勿用。" },
                { context: "九二：见龙在田，利见大人。" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。" },
                { context: "九四：或跃在渊，无咎。" },
                { context: "九五：飞龙在天，利见大人。" },
                { context: "上九：亢龙有悔。" },
                { context: "用九：见群龙，无首吉。" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        },]
    }, {
        title: "坤卦(☷)",
        data: [{
            title: "乾卦 -- 卦辞：乾，元，亨，利，贞。",
            data: [
                { context: "初九：潜龙，勿用。" },
                { context: "九二：见龙在田，利见大人。" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。" },
                { context: "九四：或跃在渊，无咎。" },
                { context: "九五：飞龙在天，利见大人。" },
                { context: "上九：亢龙有悔。" },
                { context: "用九：见群龙，无首吉。" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        }, {
            title: " ",
            data: [
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
                { context: "" },
            ],
        },]
    },]
}
data = [demo, demo01]


/**
 * 爻辞
 乾

卦辞：乾，元，亨，利，贞。

爻辞：初九：潜龙，勿用。

九二：见龙在田，利见大人。

九三：君子终日乾乾，夕惕若历，无咎。

九四：或跃在渊，无咎。

九五：飞龙在天，利见大人。

上九：亢龙有悔。

用九：见群龙，无首吉。

 

坤

卦辞：坤，元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。

爻辞：初六：履霜，坚冰至。

六二：直方大，不习无不利。

六三：含章可贞。或从王事，无成有终。

六四：括囊，无咎、无誉。

六五：黄裳元吉。

上六：龙战于野，其血玄黄。

用六：利永贞。

 

屯

卦辞：屯，元亨，利贞。勿用有攸往，利建侯。

爻辞：初九：磐桓，利居贞，利建侯。

六二：屯如邅（走）如，乘马班如。匪寇婚媾，女子贞，不字，十年乃字。

六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。

六四：乘马班如，求婚媾，往，吉无不利。

九五：屯其膏，小，贞吉；大，贞凶。

上六：乘马班如，泣血涟如。

 

蒙

卦辞：蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。

爻辞：初六：发蒙，利用刑人，用说桎梏，以往吝。

九二：包蒙吉，纳妇吉，子克家。

六三：勿用取女，见金夫，不有躬，无攸利。
六四：困蒙，吝。

六五：童蒙，吉。

上九：击蒙。不利，为寇；利，御寇。

 

需

卦辞：需，有孚，光亨，贞吉。利涉大川。

爻辞：初九：需于郊。利用恒，无咎。

九二：需于沙。小有言，终吉。

九三：需于泥，致寇至。

六四：需于血，出自穴。

九五：需于酒食，贞吉。

上六：入于穴，有不速之客三人来，敬之，终吉。

 

讼

卦辞：讼，有孚，窒惕。中吉，终凶。利见大人，不利涉大川。

爻辞：初六：不永所事，小有言，终吉。

九二：不克讼，归而逋，其邑人三百户无眚。

六三：食旧德，贞厉，终吉。或从王事，无成。

九四：不克讼，复即命，渝安贞，吉。

九五：讼，元吉。

上九：或锡之鞶带，终朝三褫之。

 

师

卦辞：师，贞丈人。吉，无咎。

爻辞：初六：师出以律，否藏凶。

九二：在师中，吉，无咎。王三锡命。

六三：师或舆尸，凶。

六四：师左次，无咎。

六五：田有禽，利执言，无吝。长子帅师，弟子舆尸，贞凶。

上六：大君有命，开国承家，小人勿用。

 

比

卦辞：比，吉。原筮，元永贞，无咎。不宁方来，后夫凶。

爻辞：初六：有孚比之，无咎。有孚盈缶，终来有它，吉。

六二：比之自内，贞吉。

六三：比之匪人。

六四：外比之，贞吉。

九五：显比，王用三驱，失前禽。邑人不诫，吉。

上六：比之无首，凶。

 

小畜

卦辞：小畜，亨。密云不雨，自我西郊。

爻辞：初九：复自道，何其咎，吉。

九二：牵复，吉。

九三：舆说辐，夫妻反目。

六四：有孚，血去惕出，无咎。

九五：有孚挛如，富以其邻。

上九：既雨既处，尚德载，妇贞厉，月几望，君子征凶。

 

履

卦辞：履虎尾，不咥人，亨。

爻辞：初九：素履往，无咎。

九二：履道坦坦，幽人贞吉。

六三：眇能视，跛能履，履虎尾，咥人凶，武人为于大君。

九四：履虎尾，愬愬，终吉。

九五：夬履，贞厉。

上九：视履考祥，其旋元吉。

 

泰

卦辞：泰，小往大来，吉，亨。

爻辞：初九：拔茅茹以其汇，征吉。

九二：包荒，用冯河。不遐遗，朋亡，得尚于中行。

九三：无平不陂，无往不复。艰贞无咎，勿恤其孚，于食有福。

六四：翩翩，不富以其邻，不戒以孚。

六五：帝乙归妹以祉，元吉。

上六：城复于隍，勿用师，自邑告命。贞吝。

 

否

卦辞：否之匪人，不利君子贞，大往小来。

爻辞：初六：拔茅茹以其汇，贞吉，亨。

六二：包承，小人吉，大人否亨。

六三：包羞。

九四：有命，无咎。畴离祉。

九五：休否，大人吉。其亡其亡，系于苞桑。

上九：倾否，先否后喜。

 

同人

卦辞：同人于野，亨。利涉大川，利君子贞。

爻辞：初九：同人于门，无咎。

六二：同人于宗，吝。

九三：伏戎于莽。升其高陵，三岁不兴。

九四：乘其墉，弗克攻，吉。

九五：同人，先号咷而后笑，大师克相遇。

上九：同人于郊，无悔。

 

大有

卦辞：大有，元亨。

爻辞：初九：无交害，匪咎艰则无咎。

九二：大车以载，有攸往，无咎。

九三：公用亨于天子，小人弗克。

九四：匪其彭，无咎。

六五：厥孚交如，威如，吉。

上九：自天祐之，吉，无不利。

 

谦

卦辞：谦，亨，君子有终。

爻辞：初六：谦谦君子，用涉大川，吉。

六二：鸣谦，贞吉。

九三：劳谦，君子有终，吉。

六四：无不利，撝谦。

六五：不富以其邻，利用侵伐，无不利。

上六：鸣谦，利用行师，征邑国。

 

豫

卦辞：豫，利建侯，行师。

爻辞：初六：鸣豫，凶。

六二：介于石，不终日，贞吉。

六三：盱豫，悔；迟,有悔。

九四：由豫，大有得，勿疑，朋盍簪。

六五：贞疾，恒不死。

上六：冥豫，成有渝，无咎。

 

随

卦辞：随，元亨，利贞，无咎。

爻辞：初九：官有渝，贞吉，出门交有功。

六二：系小子，失丈夫。

六三：系丈夫，失小子。随有求得，利居贞。

九四：随有获，贞凶。有孚在道，以明，何咎？

九五：孚于嘉，吉。

上六；拘系之，乃从维之，王用亨于西山。

 

蛊

卦辞：蛊，元亨，利涉大川，先甲三日，后甲三日。

爻辞：初六：干父之蛊，有子，考无咎。厉，终吉。

九二：干母之蛊，不可贞。

九三：干父之蛊，小有悔，无大咎。

六四：裕父之蛊，往见吝。

六五：干父之蛊，用誉。

上九：不事王侯，高尚其事。

 

临

卦辞：临，元亨，利贞。至于八月有凶。

爻辞：初九：咸临，贞吉。

九二：咸临，吉，无不利。

六三：甘临，无攸利，既忧之，无咎。

六四：至临，无咎。

六五：知临，大君之宜，吉。

上六：敦临，吉，无咎。

 

观

卦辞：观，盥而不荐，有孚颙若。

爻辞：初六：童观，小人无咎，君子吝。

六二：闚观，利女贞。

六三：观我生，进退。

六四：观国之光，利用宾于王。

九五：观我生，君子无吝。

上九：观其生，君子无吝。

 

噬嗑

卦辞：噬嗑，亨，利用狱。

, 爻辞：初九：屦校灭趾，无咎。

六二：噬肤灭鼻，无咎。

六三：噬腊肉，遇毒，小吝，无咎。

九四：噬干胏，得金矢，利艰贞，吉。

六五：噬干肉，得黄金，贞厉，无咎。

上九：何校灭耳，凶。

 

贲

卦辞：贲，亨，小利有攸往。

爻辞：初九：贲其趾，金车而徒。

六二：贲其须。

九三：贲如濡如，永贞吉。

六四：贲如皤如，白马翰如，匪寇婚媾。

六五：贲于丘园，束帛戈戈，吝，终吉。

上九：白贲，无吝。

 

剥

卦辞：剥，不利有攸往。

爻辞：初六：剥床以足，蔑贞，凶。

六二：剥床以辨，蔑贞，凶。

六三：剥之，无吝。

六四：剥床以肤，凶。

六五：贯鱼以宫人宠，无不利。

上九：硕果不食，君子得舆，小人剥庐。

 

复

卦辞：复，亨，出入无疾，朋来，无吝。反复其道，七日来复，利有攸往。

爻辞：初九：不远复，无祗悔，无吉。

六二：休复，吉。

六三：频复，厉，无咎。

六四：中行独复。

六五：敦复，无悔。

上六：迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年不克征。

 

无妄

卦辞：无妄，元亨利贞。其匪正有眚，不利有攸往。

爻辞：初九：无妄，往吉。

六二：不耕获，不菑畬，则利有攸往。

六三：无妄之灾，或系之牛，行人之得，邑人之灾。

九四：可贞，无咎。

九五：无妄之药，勿药有喜。

上九：无妄行有眚，无攸利。

 

大畜

卦辞：大畜，利贞。不家食、吉。利涉大川。

爻辞：初九：有厉，利已。

九二：舆说輹。

九三：良马逐，利艰贞。曰闲舆卫，利有攸往。

六四：童牛之捁，元吉。

六五： 豮豕之牙，吉。

上九：何天之衢，亨。

 

颐

卦辞：颐，贞吉。观颐，自求口实。

爻辞：初九：舍尔灵龟，观我朵颐，凶。

六二：颠颐，拂经，于丘颐，征凶。

六三：拂颐，贞凶，十年勿用，无莜利。

六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。

六五：拂经，居贞，吉，不可涉大川。

上九：由颐，厉，吉，利涉大川。

 

大过

卦辞：大过，栋桡，利于攸往，亨。

爻辞：初六：籍用白茅，无咎。

九二：枯杨生秭，老夫得其女妻，无不利。

九三：栋桡，凶。

九四：栋隆，吉，有它吝。

九五：枯杨生华，老妇得其士夫，无咎，无誉。

上六：过涉灭顶，凶，无吝。

 

坎

卦辞：坎，习坎有孚维心，亨，行有尚。

爻辞：初六：习坎，入于坎窞，凶。

九二：坎有险，求小得。

六三：来之坎，坎险阻枕。入于坎窞，勿用。

六四：樽酒，簋贰，用缶。纳约自牖，终无咎。

九五：坎不盛，祗既平，无咎。

上六：系用微纆，置于丛棘，三岁不得，凶。

 

离

卦辞：离，利贞，亨。畜 牛牝吉。

爻辞：初九：履错然敬之，无咎。

六二：黄离，元吉。

九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。

九四：突如其来如，焚如，死如，弃如。

六五：出涕沱若，戚嗟若，吉。

上九：王用出征，有嘉折首，获匪其丑，无咎。

 

 

咸

卦辞：咸，亨，利贞。娶女，吉。

爻辞：初六：咸其拇。

六二：咸其腓，凶，居吉。

九三：咸其股，执其随，往蔺吝。

九四：贞吉，悔亡。憧憧往来，朋从尔思。

九五：咸其脢，无悔。

上六：咸其辅颊舌。

 

恒

卦辞：恒，亨，无吝，利贞，利有攸往。

爻辞：初六：浚恒，贞凶，无攸利。

九二：悔亡。

九三：不恒其德，或承之羞，贞吝。

九四：田无禽。

六五：恒其德，贞妇人吉，夫子凶。

上六：振恒，凶。

 

遁

卦辞：遁，亨，小利贞。

爻辞：初六：遁尾，厉，勿用有攸往。

六二：执之用黄牛之革，莫之胜说。

九三：系遁，有疾厉，蓄臣妾，吉。

九四：好遁，君子吉，小人否。

九五：嘉遁，贞吉。

上九：肥遁，无不利。

 

大壮

卦辞：大壮，利贞。

爻辞：初九：壮于趾，征凶，有孚。

九二：贞吉。

九三：小人用壮，君子用罔。祗羊触藩，赢其角。

九四：贞吉，悔亡。藩决不赢，壮子大舆之輹。

六五：丧羊于易，无悔。

上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。

 

晋

卦辞：晋，康侯用锡马蕃蔗，昼日三接。

爻辞：初六：晋如、摧如，贞吉。罔孚，裕无咎。

六二：晋如愁如，贞吉。受兹介福于其王母。

六三：众允、悔亡。

九四：晋如鼫鼠，贞厉。

六五：悔无，失得勿恤，往吉，无不利。

上九：晋其角，惟用伐邑，厉吉,，无咎，贞吝。

 

明夷

卦辞：明夷，利艰贞。

爻辞：初九：明夷于飞，垂其翼，君子于行，三日不食，有攸往，主人有言。

六二：明夷,夷于左股，用拯马壮，吉。

九三：明夷于南狩，得其大首，不可疾贞。

六四：入于左腹，获明夷之心，于出门庭。

六五：箕子之明夷，利贞。

上六：不明晦，初登于天，后入于地。

 

家人

卦辞：家人，利女贞。

爻辞：初九：闲有家，悔亡。

六二：无攸遂，在中馈，贞吉。

九三：家人嗃嗃，悔厉吉；妇人嘻嘻，终吝。

六四：富家，大吉。

九五：王假有家，勿恤，吉。

上九：有孚威如，终吉。

 

睽

卦辞：睽，小事吉。

爻辞：初九：悔亡。丧马勿逐，自复。见恶人，无咎

九二：遇主于巷，无咎。

六三：见舆曳，其牛掣，其人天且劓，无初，有终。

九四：睽孤遇元夫，交孚，历无咎。

六五：悔亡，厥宗噬肤，往何咎。

上九：睽孤见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。

 

蹇

卦辞：蹇，利西南，不利东北，利见大人，贞吉。

爻辞：初六：往蹇，来誉。

六二：王臣蹇蹇，匪躬之故。

九三：往蹇，来反。

六四：往蹇，来连。

九五：大蹇，朋来。

上六：往蹇，来硕，吉。利见大人。

 

解

卦辞：解，利西南，无所往，其来复，吉。有攸往，夙吉。

爻辞：初六：无咎。

九二：田获三狐，得黄矢，贞吉。

六三：负且乘，致寇至，贞吝。

九四：解而拇，朋至斯孚。

六五：君子维有解，吉，有孚于小人。

上六：公用射隼于高墉之上，获之无不利。

 

损

卦辞：损，有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。

爻辞：初九：巳事端往，无咎；酌损之。

九二：利贞，征凶，弗损，益之。

六三：三人行则损一人，一人行则得其友。

六四：换其疾，使遄有喜，无咎。

六五：或益之十朋之龟，弗克违，元吉。

上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。

 

益

卦辞：益，利有攸往，利涉大川。

爻辞：初九：利用为大作，元吉，无咎。

六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。

六三：益之用凶事，无咎。有孚中行告公用圭。

六四：中行告公从，利用为依迁国。

九五：有孚惠心，勿问元吉。有孚惠我德。

上九：莫益之，或击之。立心勿恒，凶。

 

夬

卦辞：夬，杨于王庭，孚号有厉，告自邑，不利即戎，利有攸往。

爻辞：初九：壮于前趾，往不胜，为咎。

九二：惕号，莫夜有戎，勿恤。

九三：壮于頄，有凶，君子夬夬，独行遇雨若濡，有愠，无咎。

九四：臀无肤，其行次且，索羊悔亡，闻言不信。

九五：苋陆夬夬，中行无咎。

上六：无号，终有凶。

 

姤

卦辞：姤，女壮，勿用取女。

爻辞：初六：系于金柅，贞吉。有攸往，见凶，赢豕孚蹢躅。

九二：包有鱼，无咎，不利宾。

九三：臀无肤，其行次且，厉，无大咎。

九四：包无鱼，起凶。

九五：以杞包瓜，含章，有损自天。

上九：姤其角，吝；无咎。

 

萃

卦辞：萃，亨。王假有庙。利见大人，亨，利贞，用大牲吉，利有攸往。

爻辞：初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。

六二：引吉，无咎，孚乃利用禴。

六三：萃如嗟如，无攸利，往无咎，小吝。

九四：大吉无咎。

九五：萃有位，无咎。匪孚，元永贞，悔亡。

上六：赍咨涕洟，无咎。

 

升

卦辞：升，元亨，用见大人，勿恤，南征吉。

爻辞：初六：允升，大吉。

九二：孚乃利用禴，无咎。

九三：升虚邑。

六四：王用享于岐山，吉，无咎。

六五：贞吉，升阶。

上六：冥升，利于不息之贞。

 

困

卦辞：困，亨，贞，大人吉，无咎。有言不信。

爻辞：初六：臀困于株木，入于幽谷，三岁不觌。

九二：困于酒食，朱绂方来，利用享祀，征凶，无咎。

六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。

九四：来徐徐，困于金车，吝，有终。

九五：劓刖，困于赤绂，乃徐有说，利用祭祀。

上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。

 

井

卦辞：井，改邑不改井。无丧无得，往来井井。汔至，亦未繘井，赢其瓶，凶。

爻辞：初六：井泥不食，旧井无禽。

九二：井谷射鲋，瓮敝漏。

九三：井渫不食，为我心恻，可用汲。王明，并受其福。

六四：井渫无咎。

九五：井冽，寒泉食。

上六：井收勿幕，有孚元吉。

 

革

卦辞：革，巳日乃孚，元亨利贞，悔亡。

爻辞：初九：巩用黄牛之革。

六二：巳日乃革之，征吉，无咎。

九三：征凶，贞厉。革言三就，有孚。

九四：悔亡，有孚，改命吉。

九五：大人虎变，未占有孚。

上六：君子豹变，小人革面，征凶，居贞吉。

 

鼎

卦辞：鼎，元吉，亨。

爻辞：初六：鼎颠趾，利出否，得妾以其子，无咎。

九二：鼎有实，我仇有疾，不我能即，吉。

九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。

九四：鼎折足，覆公餗，其形渥，凶。

六五：鼎黄耳，金铉，利贞。

上九：鼎玉铉，大吉无不利。

 

震

卦辞：震，亨，震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。

爻辞：初九：震来虩虩，后笑言哑哑，吉。

六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。

六三：震苏苏，震行无眚。

九四：震遂泥。

六五：震往来厉，亿无丧有事。

上六：震索索，视矍矍，征凶，震不于其躬，于其邻，无咎。婚媾有言。

 

艮

卦辞：艮其背，不获其身，行其庭，不见其人，无咎。

爻辞：初六：艮其趾，无咎，利永贞。

六二：艮其腓，不拯其随，其心不快。

九三：艮其限，列其夤，厉熏心。

六四：艮其身，无咎。

六五：艮其辅，言有序，悔亡。

上六：敦艮，吉。

 

渐

卦辞：渐，女归，吉，利贞。

爻辞：初六：鸿渐于干，小子厉，有言，无咎。

六二：鸿渐于磐，饮食衍衍，吉。

九三：鸿渐于陆，夫征不复，妇孕不育，凶。利用御寇。

六四：鸿渐于木，或得其桷，无咎。

九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。

上九：鸿渐于陆，其羽可用为仪，吉。

 

归妹

卦辞：归妹，征凶，无攸利。

爻辞：初九：归妹以娣，跛能履，征吉。

九二：眇能视，利幽人之贞。

六三：归妹以须，反归以娣。

九四：归妹愆期，迟归有时。

六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。

上六：女承筐无实，士刲羊无血，无攸利。

 

丰

卦辞：丰，亨，王假之，勿忧，宜日中。

爻辞：初九：遇其配主，虽旬无咎，往有尚。

六二：丰其沛，日中见沫。折旧右肱，无咎。

九四：丰其部，日中见斗，遇其夷主，吉。

九五：来章，有庆誉,吉。

上六：丰其屋，部其家，闚其户，阒其无人，三岁不觌，凶。

 

旅

卦辞：旅，小亨，旅，贞吉。

爻辞：初六：旅琐琐，斯其所取灾。

六二：旅即次，怀其资，得童仆贞。

九三：旅焚其次，丧其童仆贞，厉。

九四：旅于处，得其资斧，我心不快。

六五：射雉，一矢亡，终以誉命。

上九：鸟焚其巢，旅人先笑后号啕，丧牛于易，凶。

 

巽

卦辞：巽，小亨，利有攸往，利见大人。

爻辞：初六：进退，利武人之贞。

九二：巽在床下，用史巫纷若，吉，无咎。

九三：频巽，吝。

六四：悔亡，田获三品。

九五：贞吉，悔亡，无不利，无初有终，先庚三日，后庚三日，吉。

上九：巽在床下，丧其资斧，贞凶。

 

兑

卦辞：兑，亨，利贞。

爻辞：初九：和兑，吉。

九二：孚兑，吉。悔亡。

六三：来兑，凶。

九四：商兑未宁，介疾有喜。

九五：孚于剥，有厉。

上六：引兑。

 

涣

卦辞：涣，亨。王假有庙，利涉大川，利贞。

爻辞：初六：用拯马壮，吉。

九二：涣奔其机，悔亡。

六三：涣其躬，无悔。

六四：涣其群，元吉。涣有丘，匪夷所思。

九五：涣汗其大号，涣王居。无咎。

上九：涣其血去，狄出，无咎。

 

节

卦辞：节，亨，苦节不可贞。

爻辞：初九：不出户庭，无咎。

九二：不出门庭，凶。

六三：不节若、则嗟若，无咎。

六四：安节，亨。

九五：甘节，吉，往有尚。

上六：苦节，贞凶，悔亡。

 

中孚

卦辞：中孚，豚鱼吉。利涉大川。利贞。

爻辞：初九：虞吉，有它不燕。

九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。

六三：得敌，或鼓或罢，或泣或歌。

六四：月几望，马匹亡，无咎。

九五：有孚挛如，无咎。

上九：翰音登于天，贞凶。

 

小过

卦辞：小过，亨，利贞，可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。

爻辞：初六：飞鸟以凶。

六二：过其祖，遇其妣，不及其君，遇其臣，无咎。

九三：弗过防之，从或戕之，凶。

九四：无咎，弗过遇之。往厉必戒，勿用永贞。

六五：密云不雨，自我西郊，公弋取彼在穴。

上六：弗遇过之，飞鸟离之，凶，是谓灾眚。

 

既济

卦辞：既济，亨小，利贞。初吉，终乱。

爻辞：初九：曳其轮，濡其尾，无咎。

六二：妇丧其茀茀、勿逐，七日得。

九三：高宗伐鬼方，三年克之，小人勿用。

六四：濡有衣袽，终日戒。

九五：东邻杀牛，不如西郊之瀹祭，实受其福。

上六：濡其首，厉。

 

未济

卦辞：未济，亨。小狐泛济，濡其尾，无攸利。

爻辞：初六：濡其尾，吝。

九二：曳其轮，贞吉。

六三：未济，征凶，利涉大川。

九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。

六五：贞吉，无悔，君子之光有孚，吉。

上九：有孚于饮酒，无咎。濡其首，有孚矢是。
 *  */
/**
 * 
 * 
上谥法
神　圣　贤　文　武　成　康　献　懿　元　章　僖（釐）景　宣　明　昭　正　敬　恭　庄　肃　穆　戴　翼　襄　烈　桓　威　勇　毅　克　庄　圉（御）魏　安　定　简　贞　节　白　匡　质　靖　真　顺　思　考　皓　显　和　元　高　光　大　英　睿　博　宪　坚　孝　忠　惠　德　仁　智　慎　礼　义　周　敏　信　达　宽　理　凯　清　直　钦　益　良　度　类　基　慈　齐　深　温　让　密　厚　纯　勤　谦　友　祁　广　淑　俭　灵　荣　厉　比　絜　舒　贲　逸　退　讷　偲　逑　懋　宜　哲　察　通　仪　经　庇　协　端　休　悦　绰　容　确　恒　熙　洽　绍　世　果　太 崇
上百三十一谥，用之君亲焉，用之君子焉。
中谥法
怀、悼、愍（亦作闵、湣）、哀、隐、幽、冲、夷、惧、息、携、恤、愿、儆。
上十四谥，用之闵伤焉，用之无后者焉。
下谥法
野、夸、躁、伐、荒、炀、戾、刺、虚、荡、墨、亢、千、褊、专、轻、苛、介、暴、虐、愎、悖、凶、慢、忍、毒、恶、残　奰、攘、顽、昏、骄、酗、湎、侥、狃、侈、惑、靡、溺、伪、妄、讟、谄、诬、诈、谲、诡、奷、邪、慝、蛊、危、圮、懦、挠、覆、败、斁、疵、饕、费。


哀：早孤短折曰哀；恭仁短折曰哀；德之不建曰哀；遭难已甚曰哀；处死非义曰哀
安：好和不争曰安；兆民宁赖曰安；宽容平和曰安；宽裕和平曰安；所保惟贤曰安；中心宅仁曰安；修己宁民曰安；务德不争曰安；庄敬尽礼曰安；敬而有礼曰安；貌肃辞定曰安；止于义理曰安；恭德不劳曰安；静正不迁曰安；懿恭中礼曰安；凝重合礼曰安
比：择善而从曰比；事君有党曰比
成：安民立政曰成；刑民克服曰成；佐相克终曰成；制义克服曰成；礼乐明具曰成；持盈守满曰成；遂物之美曰成；通达强立曰成；经德秉德曰成；民和神福曰成；道兼圣智曰成；夙夜警戒曰成；曲直赴礼曰成；仁化纯被曰成；不忘久要曰成；德备礼乐曰成；德见于行曰成；久道化隆曰成；内德纯备曰成；坤宁化洽曰成
诚：纯德合天曰诚；从容中道曰诚；推心御物曰诚；秉德纯一曰诚；明信率下曰诚；肫笃无欺曰诚；实心施惠曰诚
冲：幼少在位曰冲；幼少短折曰冲
崇：能修其官曰崇
纯：中正精粹曰纯；见素抱朴曰纯；安危一心曰纯；志虑忠实曰纯；至诚无息曰纯；内心和一曰纯；治理精粹曰纯
慈：视民如子曰慈；爱育必周曰慈；抚柔平恕曰慈
聪：声入心通曰聪；迩言必察曰聪
达：质直好义曰达；疏通中理曰达
大：则天法尧曰大
戴：爱民好治曰戴；典礼不愆曰戴
荡：好内远礼曰荡；狂而无据曰荡
悼：肆行劳祀曰悼；中年早夭曰悼；恐惧从处曰悼；未中早夭曰悼
道：以德化民曰道
德：绥柔士民曰德；谏争不威曰德；谋虑不威曰德；贵而好礼曰德；忠和纯备曰德；绥怀来人曰德；强直温柔曰德；勤恤民隐曰德；忠诚上实曰德；辅世长民曰德；宽众忧役曰德；刚塞简廉曰德；惠和纯淑曰德；富贵好礼曰德；功成民用曰德；修文来远曰德；睿智日新曰德；善政养民曰德；尊贤亲亲曰德；仁而有化曰德；忧在进贤曰德；宽栗扰毅曰德；直温强义曰德；谏诤不违曰德；周旋中礼曰德；泽及遐外曰德；懿修罔懈曰德
丁：述善不克曰丁；述义不悌曰丁；迷而不悌曰丁
鼎：追改前过曰鼎
定：大虑静民曰定；安民大虑曰定；纯行不爽曰定；安民法古曰定；纯行不二曰定；追补前过曰定；仁能一众曰定；嗣成武功曰定；践行不爽曰定；审于事情曰定；德操纯固曰定；以劳定国曰定；克绥邦家曰定；静正无为曰定；大应慈仁曰定；义安中外曰定；镇静守度曰定
度：心能制义曰度；进退可轨曰度；守法纬民曰度；从容有常曰度；礼仪咨善曰度；宽裕有容曰度；创制垂法曰度；懿徽足式曰度
端：守礼执义曰端；圣修式化曰端；严恭莅下曰端；恭己有容曰端；秉心贞静曰端；守礼自重曰端
敦：善行不怠曰敦；温仁忠厚曰敦；能记国善曰敦；温仁厚下曰敦；笃亲睦族曰敦；树德纯固曰敦
干：犯国之纪曰干
刚：追补前过曰刚；强毅果敢曰刚；致果杀敌曰刚；强而能断曰刚；自强不息曰刚；政刑明断曰刚；威强不屈曰刚；强义果敢曰刚
高：德覆万物曰高；功德盛大曰高；覆帱同天曰高
革：献敏成行曰革
公：立志及众曰公
恭：尊贤贵义曰恭；敬事供上曰恭；尊贤敬让曰恭；既过能改曰恭；执事坚固曰恭；爱民长弟曰恭；执礼御宾曰恭；芘亲之阙曰恭；尊长让善曰恭；渊源流通曰恭；夙夜敬事曰恭；知过能改曰恭；贤而不伐曰恭；率事以信曰恭；不懈于位曰恭；卑以自牧曰恭；不懈于德曰恭；治典不易曰恭；责难于君曰恭；正德美容曰恭；不懈为德曰恭；正己接物曰恭；昭事不忒曰恭；勤恤民隐曰恭；庄以莅下曰恭；谦和不懈曰恭；逊顺事上曰恭
光：功格上下曰光；能绍前业曰光；居上能谦曰光；功烈耿着曰光
广：美化及远曰广；所闻能行曰广
果：好力致勇曰果；好学近智曰果；临事善断曰果
暠：综善典法曰暠
和：不刚不柔曰和；推贤让能曰和；柔远能迩曰和；号令悦民曰和；敦睦九族曰和；怀柔胥洽曰和；温厚无苛曰和
厚：思虑不爽曰厚；强毅敦朴曰厚；敦仁爱众曰厚
胡：弥年寿考曰胡；保民耆艾曰胡；保民畏惧曰胡；
怀：执义扬善曰怀；慈仁短折曰怀；慈仁知节曰怀；失位而死曰怀；慈仁哲行曰怀；民思其惠曰怀
桓：辟土服远曰桓；克敬勤民曰桓；辟土兼国曰桓；武定四方曰桓；克亟成功曰桓；克敌服远曰桓；能成武志曰桓；壮以有力曰桓；
荒：凶年无谷曰荒；外内从乱曰荒；好乐怠政曰荒；昏乱纪度曰荒；从乐不反曰荒；狎侮五常曰荒
徽：元德充美曰徽
惠：柔质慈民曰惠；爱民好与曰惠；柔质爱课曰惠；柔质受谏曰惠；施勤无私曰惠；慈仁好与曰惠；爱民好学曰惠；宽裕慈仁曰惠；和而不流曰惠；慈哲远识曰惠；能绥四方曰惠；子爱困穷曰惠；俭以厚下曰惠；淑质受谏曰惠；恩能及下曰惠；宽裕不苛曰惠；遗爱在民曰惠；分人以财曰惠；利而不费曰惠；抚字心殷曰惠；兴利裕民曰惠；德威可怀曰惠；泽及万世曰惠；仁恕中存曰惠；慈恩广被曰惠
惑：满志多穷曰惑；以欲忘道曰惑；淫溺丧志曰惑；妇言是用曰惑；夸志多穷曰惑
基：德性温恭曰基
坚：彰义掩过曰坚；磨而不磷曰坚
俭：菲薄废礼曰俭；节以制度曰俭；举事有经曰俭
简：一德不懈曰简；平易不訾曰简；治典不杀曰简；正直无邪曰简；易从有功曰简；平易无疵曰简；至德临下曰简；仕不躁进曰简；能行直道曰简；执要能固曰简
节：好廉自克曰节；不侈情欲曰节；巧而好度曰节；能固所守曰节；谨行节度曰节；躬俭中礼曰节；直道不挠曰节；临义不夺曰节；艰危莫夺曰节
介：执一不迁曰介
景：由义而济曰景；耆意大虑曰景；布义行刚曰景；致志大图曰景；繇义而成曰景；德行可仰曰景；法义而齐曰景；明照旁周曰景
敬：夙夜警戒曰敬；令善典法曰敬；夙夜恭事曰敬；象方益平曰敬；象方益年曰敬；夙兴夜寐曰敬；众方克就曰敬；齐庄中正曰敬；广直勤正曰敬；廉直劲正曰敬；难不忘君曰敬；受命不迁曰敬；畏天爱民曰敬；陈善闭邪曰敬；威仪悉备曰敬；戒尊师傅曰敬；戒惧无违曰敬；小心恭事曰敬；戒慎几微曰敬；肃恭无怠曰敬；齐庄自持曰敬；应事无慢曰敬
靖：柔德安众曰靖；恭己鲜言曰靖；宽乐令终曰靖；柔德教众曰靖；柔直考终曰靖；虚己鲜言曰靖；缉熙宥密曰靖；式典安民曰靖；仁敬鲜言曰靖；慎以处位曰靖；政刑不扰曰靖；纲纪肃布曰靖；厚德安贞曰靖；律身恭简曰靖；以德安众曰靖
开：信道轻仕曰开
凯：中心乐易曰凯
康：渊源流通曰康；温柔好乐曰康；安乐抚民曰康；合民安乐曰康；丰年好乐曰康；安乐治民曰康；好乐怠政曰康；能安兆民曰康；俊民用章曰康；久膺多福曰康；寿考且宁曰康；保民迪吉曰康；务德不争曰康；宽裕和平曰康；敬而有礼曰康；保卫社稷曰康；造道自行曰康；动而无妄曰康；温柔好善曰康；思善无逸曰康；温良好学曰康；视履安和曰康
考：大虑行节曰考；秉德不回曰考
克：爱民在刑曰克；秉义行刚曰克；胜敌得俊曰克；胜己之私曰克；
宽：含光得众曰宽；大德包蒙曰宽；御众不近曰宽
匡：贞心大度曰匡；以法正国曰匡；辅弼王室曰匡；弥缝灾害曰匡；正君之过曰匡
旷：审音知化曰旷
类：施勤无私曰类；勤政无私曰类；不忝前哲曰类
礼：奉义顺则曰礼；恭俭庄敬曰礼；善自防间曰礼；躬俭中节曰礼；审节而和曰礼；着诚去伪曰礼；纳民轨物曰礼；恭俭合度曰礼；内则克修曰礼
理：才理审谛曰理；政平刑肃曰理；措正施行曰理；表章道术曰理；才敏详审曰理；治繁不扰曰理
厉（刺）：杀戮无辜曰厉；暴虐无亲曰厉；愎狠无礼曰厉；扶邪违正曰厉；长舌阶祸曰厉；不思忘爱曰刺；复狠遂过曰刺；暴戾无亲曰刺；暴慢九卿曰刺；不思安乐曰刺
戾：不悔前过曰戾；不思顺受曰戾；知过不改曰戾
良：温良好乐曰良；理顺习善曰良；小心敬事曰良；温敬寡言曰良；孝悌成性曰良；小心敬畏曰良；谋猷归美曰良；竭忠无隐曰良；宅衷易直曰良
烈：有功安民曰烈；秉德遵业曰烈；圣功广大曰烈；海外有截曰烈；业成无兢曰烈；光有大功曰烈；戎业有光曰烈；刚正曰烈；宏济生民曰烈；庄以临下曰烈
灵：不勤成名曰灵；死而志成曰灵；死见神能曰灵；乱而不损曰灵；好祭鬼神曰灵；极知鬼神曰灵；不遵上命曰灵；德之精明曰灵
懋：以德受官曰懋；以功受赏曰懋
密：追补前过曰密；思虑详审曰密
闵：慈仁不寿曰闵；在国遭忧曰愍；在国逢艰曰愍；祸乱方作曰愍；使民悲伤曰愍；使民折伤曰愍；在国连忧曰愍；佐国逢难曰愍；危身奉上曰愍（一般和愍混用）
敏：应事有功曰敏；明作有功曰敏；英断如神曰敏；明达不滞曰敏；闻义必徙曰敏；才猷不滞曰敏；好古不怠曰敏
明：照临四方曰明；谮诉不行曰明；思虑果远曰明；保民耆艾曰明；任贤致远曰明；总集殊异曰明；独见先识曰明；能扬仄陋曰明；察色见情曰明；容义参美曰明；无幽不察曰明；圣能作则曰明；令闻不已曰明；奉若天道曰明；遏恶扬善曰明；视能致远曰明；内治和理曰明；诚身自知曰明；守静知常曰明；至诚先觉曰明；远虑防微曰明；懿行宣着曰明；智能晰理曰明；昭晰群性曰明
缪：名与实爽曰缪；伤人蔽贤曰缪；蔽仁伤善曰缪
穆：布德执义曰穆；中情见貌曰穆；贤德信修曰穆；德政应和曰穆；敬和在位曰穆；德化肃和曰穆；圣敬有仪曰穆；粹德深远曰穆；肃容持敬曰穆；容仪肃敬曰穆
宁：裕以安民曰宁；渊衷湛一曰宁；端重自毖曰宁
彭：述而不作曰彭；信而好古曰彭
平：治而无眚曰平；执事有制曰平；惠内无德曰平；治而清省曰平；布纲治纪曰平；克定祸乱曰平；理而无责曰平；布德均政曰平；无常无偏曰平；治道如砥曰平；分不求多曰平；政以行辟曰平；推心行恕曰平
齐：执心克庄曰齐；资辅共就曰齐；轻輶恭就曰齐；执正克庄曰齐
祁：治典不杀曰祁；经典不易曰祁；治定不陂曰祁
迁：博物多爱曰迁；良史实录曰迁
强：和而不流曰强；中立不倚曰强；守道不变曰强；死不迁情曰强；自胜其心曰强。梁光禄大夫江革谥“强”。
钦：威仪悉备曰钦；敬事节用曰钦；克慎成宪曰钦；肃敬而承上曰钦；夙夜祗畏曰钦；敬慎万几曰钦；神明俨翼曰钦；小心励翼曰钦；寅恭供职曰钦
勤：温年好乐曰勤；能修其官曰勤；服劳无怨曰勤；广业不怠曰勤；勤行世业曰勤；好学力行曰勤；能修内职曰勤；夙夜匪懈曰勤；宣劳中外曰勤
清：避远不义曰清；洁己自爱曰清；洁己奉法曰清
顷：甄心动惧曰顷；敏以敬慎曰顷；祗勤追惧曰顷；慈仁和敏曰顷；堕覆社稷曰顷；震动过惧曰顷；阴靖多谋曰顷
悫：行见中外曰悫；执德不惑曰悫；诚以致志曰悫；表里如一曰悫；诚心中孚曰悫；率真御下曰悫
确：执德不惑曰确；执德不回曰确
让：推功尚善曰让；德性宽柔曰让
仁：蓄义丰功曰仁；慈民爱物曰仁；克己复礼曰仁；贵贤亲亲曰仁；杀身成仁曰仁；能以国让曰仁；利泽万世曰仁；率性安行曰仁；功施于民曰仁；屈己逮下曰仁；度功而行曰仁；宽信敏惠曰仁；爱仁立物曰仁；体元立极曰仁；如天好生曰仁；教化溥浃曰仁；慈心为质曰仁；惠爱溥洽曰仁
荣：宠禄光大曰荣；先义后利曰荣
容：宽裕温柔曰容
柔：顺德丽贞曰柔；至顺法坤曰柔
睿：克念作圣曰睿；深思远虑曰睿；圣知通微曰睿；虑周事表曰睿
伤：未家短折曰伤；短折不成曰伤；短折不成曰殇；未家短折曰殇；童蒙短折曰殇（谥号中一般写作殇）
商：昭功宁民曰商；文学博识曰商
绍：疏远继位曰绍
深：秉心塞渊曰深
神：民无能名曰神；壹民无为曰神；安仁立政曰神；物妙无方曰神；圣不可知曰神；阴阳不测曰神；治民无为曰神；应变远方、不疾而速曰神；能妙万物曰神；道化宜民曰神；显仁藏用曰神；则天广运曰神
慎：敏以敬曰慎；沉静寡言曰慎；思虑深远曰慎；谨饬自持曰慎；夙夜敬畏曰慎；小心克勤曰慎
声：不生其国曰声；不主其国曰声
圣：扬善赋简曰圣；敬宾厚礼曰圣；虚己从谏曰圣；敬祀亨礼曰圣；行道化民曰圣；穷理尽性曰圣；穷神知化曰圣；通达先知曰圣；大而化之曰圣；博施济众曰圣；极深研几曰圣；能听善谋曰圣；裁成天地曰圣；睿智天纵曰圣；百姓与能曰圣；备物成器曰圣；备道全美曰圣；神化难名曰圣
胜：容仪恭美曰胜
世：承命不迁曰世；景物四方曰世；贻庥奕叶曰世
淑：言行不回曰淑；虑善从宜曰淑；温仁咸仰曰淑；善行着闻曰淑
舒：举事而迟曰舒；言行轨物曰舒
庶：心能制义曰庶
顺：慈和遍服曰顺；慈仁和民曰顺；柔质慈惠曰顺；和比于理曰顺；德合帝则曰顺；受天百禄曰顺；柔德承天曰顺；德性宽柔曰顺；淑慎其身曰顺；德容如玉曰顺；克将君美曰顺；好恶公正曰顺；德协自然曰顺
舜：仁圣盛明曰舜
思：道德纯一曰思；大省兆民曰思；外内思索曰思；追悔前过曰思；不眚兆民曰思；谋虑不衍曰思；柔能自勉曰思；通明爽愿曰思；深虑道远曰思；念终如始曰思；辟土兼国曰思；追悔前愆曰思
肃：刚德克就曰肃；执心决断曰肃；威德克就曰肃；正己摄下曰肃；能执妇道曰肃；好德不怠曰肃；貌敬行祗曰肃；刚德克服曰肃；身正人服曰肃；法度修明曰肃；严畏自饬曰肃；摄下有礼曰肃；貌恭心敬曰肃：达礼蔽乐曰素
太：克启行禩曰太
泰：循礼安舒曰泰；临政无慢曰泰
通：物至能应曰通；事起而辨曰通
威：猛以刚果曰威；强毅信正曰威；服叛怀远曰威；强毅执政曰威；赏劝刑怒曰威；以刑服远曰威；蛮夷率服曰威；信赏必罚曰威；德威可畏曰威；声灵震叠曰威；庄以临下曰威；
温：德性宽柔曰温；和顺可即曰温；仁良好礼曰温；乐育群生曰温；宽仁惠下曰温
文：经纬天地曰文；道德博闻曰文；慈惠爱民曰文；愍民惠礼曰文；赐民爵位曰文；勤学好问曰文；博闻多见曰文；忠信接礼曰文；能定典礼曰文；经邦定誉曰文；敏而好学曰文；施而中礼曰文；修德来远曰文；刚柔相济曰文；修治班制曰文；德美才秀曰文；万邦为宪曰文；帝德运广曰文；坚强不暴曰文；徽柔懿恭曰文；圣谟丕显曰文；化成天下曰文；纯穆不已曰文；克嗣徽音曰文；敬直慈惠曰文；与贤同升曰文；绍修圣绪曰文；声教四讫曰文
武：刚强直理曰武；威强敌德曰武；克定祸乱曰武；刑民克服曰武；夸志多穷曰武；威强睿德曰武；除伪宁真曰武；威强恢远曰武；帅众以顺曰武；保大定功曰武；刚强以顺曰武；辟土斥境曰武；折冲御侮曰武；除奸靖难曰武；拓地开封曰武；肃将天威曰武；安民和众曰武；克有天下曰武；睿智不杀曰武；恤民除害曰武；赴敌无避曰武；德威遐畅曰武；
息：谋虑不成曰息
熙：允僖庶绩曰熙；敬德光明曰熙；隆称赫奕曰熙
僖（釐）：小心畏忌曰僖；质渊受谏曰僖；有罚而还曰僖；刚克曰僖；有过曰僖；慈惠爱亲曰僖；小心恭慎曰僖；乐闻善言曰僖；恭慎无过曰僖
熹：有功安人曰熹
贤：仁义合道曰贤；宠至益戒曰贤；行义合道曰贤；明德有成曰贤；内治隆备曰贤；内德有成曰贤
显：行见中外曰显；受禄于天曰显；圣德昭临曰显；百辟惟刑曰显；有光前烈曰显；中外仰德曰显；德美宣昭曰显
宪：博闻多能曰宪；赏善罚恶曰宪；行善可记曰宪；在约纯思曰宪；圣能法天曰宪；圣善周达曰宪；创制垂法曰宪；刑政四方曰宪；文武可法曰宪；聪明法天曰宪；表正万邦曰宪；懿行可纪曰宪；仪范永昭曰宪
献：博闻多能曰献；惠而内德曰献；智哲有圣曰献；聪明睿智曰献；文资有成曰献；敏惠德元曰献；圣哲有谋曰献；贤德有成曰献；智能翼君曰献；学该古训曰献；智质有理曰献；智质有操曰献；智质有礼曰献
襄：辟地有德曰襄；甲胄有劳曰襄；因事有功曰襄；执心克刚曰襄；协赞有成曰襄；威德服远曰襄
向：简易多闻曰向
孝：五宗安之曰孝；慈惠爱亲曰孝；秉德不回曰孝；协时肇享曰孝；大虑行节曰孝；慈惠爱民曰孝；慈爱忘劳曰孝；从命不违曰孝；善事父母曰孝；遵义安仁曰孝；几谏不倦曰孝；姻睦其党曰孝；博于备养曰孝；敬慎所安曰孝；尊仁爱义曰孝；能养能恭曰孝；干蛊用誉曰孝；继志成事曰孝；践修世德曰孝；丕承先志曰孝；博施被物曰孝；教刑四海曰孝；德通神明曰孝；先意承志曰孝；能奉祭祀曰孝；志不忘亲曰孝；富贵不骄曰孝；德加百姓曰孝；徽音克嗣曰孝
信：守命共时曰信；出言可复曰信；周仁承命曰信；守礼不违曰信；宽仁孚众曰信；政令划一曰信
修：勤其世业曰修；好学近习曰修；克勤世业曰修
虚：凉德薄礼曰虚；华言无实曰虚
宣：圣善周闻曰宣；施而不成曰宣；善问周达曰宣；施而不秘曰宣；诚意见外曰宣；重光丽日曰宣；义问周达曰宣；能布令德曰宣；浚达有德曰宣；力施四方曰宣；哲惠昭布曰宣；善闻式布曰宣
玄：含和无欲曰玄；应真主神曰玄
逊：谦和善让曰逊
炀：好内远礼曰炀；去礼远众曰炀；好内怠政曰炀；肆行劳神曰炀；去礼远正曰炀；逆天虐民曰炀
尧：翼善传圣曰尧；大而难名曰尧
野：质胜其文曰野；敬而不中礼曰野
仪：善行足法曰仪
夷：克杀秉政曰夷；安心好静曰夷；隐居求志曰夷；失礼基乱曰夷
义：制事合宜曰义；见利能终曰义；先君后己曰义；除天地害曰义；取而不贪曰义；理财正辞曰义；仁能制命曰义；能成其志曰义；道无不理曰义；推功尚善曰义；以礼节行曰义；行礼不疚曰义；见利能让曰义；以公灭私曰义；正身肃下曰义；
逸：隐居放言曰逸
毅：致果杀敌曰毅；强而能断曰毅；勇而近仁曰毅；善行不怠曰毅；温仁忠厚曰毅；能纪国善曰毅；英明有执曰毅；经德不回曰毅；致果克敌曰毅
翼：刚克为伐曰翼；思虑深远曰翼；爱民好治曰翼；小心事天曰翼；小心昭事曰翼；赞宣德化曰翼
懿：温柔贤善曰懿；温和圣善曰懿；体和居中曰懿；爱人质善曰懿；柔克有光曰懿；浸以光大曰懿；行见中外曰懿；爱民质渊曰懿；德浸广大曰懿；文德充实曰懿；秉彝好德曰懿；尚能不争曰懿；主极精纯曰懿；柔德流光曰懿；贤善着美曰懿
隐：陷拂不成曰隐；不显尸国曰隐；见美坚长曰隐；隐括不成曰隐；不尸其位曰隐；违拂不成曰隐；怀情不尽曰隐；不明误国曰隐；威德刚武曰隐；
英：出类拔萃曰英；道德应物曰英；德华茂着曰英；明识大略曰英
婴：恭俭好礼曰婴
雍：居敬行简曰雍
勇：胜敌壮志曰勇；率义死国曰勇；致命为仁曰勇；奋身为义曰勇；持义不挠曰勇；知死不避曰勇；率义共用曰勇；以义死用曰勇；临事屡断曰勇；临难不惧曰勇；见义必为曰勇
幽：壅遏不通曰幽；动静乱常曰幽；早孤有位曰幽；早孤陨位曰幽；早孤销位曰幽；违礼乱常曰幽；暴民残义曰幽；淫德灭国曰幽
友：睦于兄弟曰友
俞：愚智适时曰俞
禹：渊源通流曰禹；受禅成功曰禹
圉：威德刚武曰圉
裕：强学好问曰裕；建中垂统曰裕；宽仁得众曰裕；性量宽平曰裕；仁惠克广曰裕；宽和不迫曰裕；宽和自得曰裕
誉：状古述今曰誉
渊：不幸短命曰渊；沉潜用晦曰渊；德信静深曰渊；沉几烛隐曰渊
元：能思辩众曰元；行义说民曰元；始建国都曰元；主义行德曰元；道德纯一曰元；遵仁贵德曰元；善行仁德曰元；宣慈惠和曰元；至善行德曰元；忠肃恭懿曰元；体仁长民曰元；茂德丕绩曰元；体乾启祚曰元；万邦以贞曰元；体仁内恕曰元；仁明道合曰元；
原：思虑不爽曰原；植德开基曰原；庆流奕叶曰原
远：疏远继位曰远
愿：思厚不爽曰愿；弱无立志曰愿；败乱无度曰愿；忘德败礼曰愿；柔无立志曰愿
章：温克令仪曰章；法度明大曰章；出言有文曰章；敬慎高亢曰章；文教远耀曰章
昭：容仪恭美曰昭；昭德有劳曰昭；圣闻周达曰昭；声闻宣远曰昭；威仪恭明曰昭；明德有功曰昭；圣问达道曰昭；圣德嗣服曰昭；德业升闻曰昭；智能察微曰昭；德礼不愆曰昭；高朗令终曰昭；遐隐不遗曰昭；德辉内蕴曰昭；柔德有光曰昭
哲：知人曰哲；明知渊深曰哲；官人应实曰哲；明知周通曰哲；识微虑终曰哲；知能辨物曰哲
贞：清白守节曰贞；大虑克就曰贞；大宪克就曰贞；不隐无屈曰贞；内外用情曰贞；忧国忘死曰贞；内外无怀曰贞；忠道不扰曰贞；保节扬名曰贞；履正中馈曰贞；守教难犯曰贞；幽间专一曰贞；恒德从一曰贞；直道不挠曰贞；名实不爽曰贞；事君无猜曰贞；德性正固曰贞；率义好修曰贞；德信正周曰贞
真：肇敏行成曰真；不隐无藏曰真
正：内外宾服曰正；大虑克就曰正；内外用情曰正；清白守洁曰正；图国忘死曰正；内外无怀曰正；直道不挠曰正；靖恭其位曰正；其仪不忒曰正；精爽齐肃曰正；诚心格非曰正；庄以率下曰正；息邪讵诐曰正；主极克端曰正；万几就理曰正；淑慎持躬曰正；端型式化曰正；心无偏曲曰正；守道不移曰正
直：肇敏行成曰直；治乱守正曰直；不隐其亲曰直；守道如矢曰直；言行不邪曰直；质而中正曰直；正人之曲曰直；折狱在中曰直；孝弟成性曰直；小心敬事曰直；敏行不挠曰直；率行无邪曰直；秉道正物曰直；
质：名实不爽曰质；忠正无邪曰质；章义掩过曰质；言行相应曰质；恬淡无为曰质；直心靡他曰质；真纯一德曰质；至治还淳曰质；宅心笃实曰质；淳茂无华曰质；静正无华曰质；朴直无华曰质；强立守义曰质
智：官人应实曰智；尊明胜患曰智；默行言当曰智；推芒折廉曰智；临事不惑曰智；察言知人曰智；择任而往曰智
中：王心克一曰中；刚柔不偏曰中；因时致治曰中
忠：危身奉上曰忠；虑国忘家曰忠；让贤尽诚曰忠；危身利国曰忠；安居不念曰忠；临患不反曰忠；盛衰纯固曰忠；廉方公正曰忠；事君尽节曰忠；推贤尽诚曰忠；中能应外曰忠；杀身报国曰忠；世笃勤劳曰忠；善则推君曰忠；死卫社稷曰忠；以德复君曰忠；以孝事君曰忠；安不择事曰忠；教人以善曰忠；中能虑外曰忠；广方公正曰忠；肫诚翊赞曰忠
终：有始有卒曰终；克成令名曰终
纣：残义损善曰纣
专：好功自是曰专；违命自用曰专
庄：兵甲亟作曰庄；睿圉克服曰庄；胜敌志强曰庄；死于原野曰庄；屡征杀伐曰庄；武而不遂曰庄；真心大度曰庄；好勇致力曰庄；威而不猛曰庄；严敬临民曰庄；履正志和曰庄；维德端严曰庄；恭敬端肃曰庄；端恪临民曰庄；端一克诚曰庄；齐敬中礼曰庄；执德不矜曰庄；德盛礼恭曰庄；严恭自律曰庄；严恪有仪曰庄；威德刚武曰壮；赫围克服曰壮；胜敌克乱曰壮；好力致勇曰壮；屡行征伐曰壮；武德刚毅曰壮；非礼弗履曰壮（庄和壮一般混用）
纵：弱而立志曰纵；败乱百度曰纵；忘德败礼曰纵
 * 
 */

