var demo = {
    title: "周易口诀",
    name: "周易口诀",
    data: [{
        title: "八卦方位的五行口诀",
        data: [
            { context: "乾三连、坤六断;离中虚、坎中满;震仰盂、艮覆碗;兑上缺，巽下断。" },
            { context: "乾三连西北开天;坤六断西南八地。" },
            { context: "兑上缺西方双泽;巽下断东南无风。" },
            { context: "艮覆碗东北齐山;震仰盂东方四雷。" },
            { context: "离中虚南方真火;坎中满北方六水。" },
            { context: "八卦相错重叠生;六十四卦化万象。" },
            { context: "天地造化定乾坤;雷厉风行必相薄。" },
            { context: "山泽相连可通气;水火相克不相射。" },
        ]
    }, {
        title: "六十四卦口诀",
        data: [
            { context: "乾坤屯蒙需讼师，比小畜兮履泰否。" },
            { context: "同人大有谦豫随，蛊临观兮噬嗑贲。" },
            { context: "剥复无妄大畜颐，大过坎离三十备。" },
            { context: "咸恒遁兮及大状，晋及明夷家人睽。" },
            { context: "蹇解损益夬姤萃，升困井革鼎震继。" },
            { context: "艮渐归妹丰旅巽，兑涣节兮中孚至。" },
            { context: "小过既济兼未济，是为下经三十四。" },
            { context: "火（离）：火地晋，火山旅，火水未济，火风鼎，火雷噬嗑，火火离，火泽睽，火天大有。" },
            { context: "水（坎）：水地比，水山蹇，水水坎，水风井，水雷屯，水火既济，水泽节，水天需。" },
            { context: "山（艮）：山地剥，山山艮，山水蒙，山风蛊，山雷颐，山火贲，山泽损，山天大畜。" },
            { context: "泽（兑）：泽地萃，泽山咸，泽水困，泽风大过，泽雷随，泽火革，泽泽兑，泽天夬。" },
            { context: "雷（震）：雷地豫，雷山小过，雷水解，雷风恒，雷雷震，雷火丰，雷泽归妹，雷天大壮。" },
            { context: "风（巽）：风地观，风山渐，风水涣，风风巽，风雷益，风火家人，风泽中孚，风天小畜。" },
            { context: "地（坤）：地地坤，地山谦，地水师，地风升，地雷复，地火明夷，地泽临，地天泰。" },
            { context: "天（乾）：天地否，天山遁，天水讼，天风姤，天雷无妄，天火同人，天泽履，天天乾。" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [
            { context: "象中有数数中理;(万事万物的现象之中，一定存在着定数12345678......，而定数之中又包含道理：五行生克制化。)" },
            { context: "以道观象明数理。(我们观察事物时要以道(自然的真理)来看，从而知道了这些现象中的定数与五行生克制化。)" },
            { context: " 以理言事真无比;(然后以五行生克制化的理来判断事物，把结果表达出来，就是预测的正确结果。)" },
            { context: "不可不信妙无许。(学会了这些道理，是妙不可言的，就像掌握了未来那样，很是自在。)" },
            { context: "心若无欲心则灵;(在预测时，心中如果没有任何的贪婪与自私的话，心就一定灵验，心所想的就是准确的预测结果。)" },
            { context: "心无挂碍言出行。(在判断事物时，不要怀疑自己，放心，没有任何的障碍，说出来一定会应验。)" },
            { context: "法外无法无定法;(预测方法就这么简单，完全是在易经范畴之内的，但方法也不是固定的，要活学活用啊。)" },
            { context: "不拘古法心为法。(不要拘泥于原先人们的那些预测的方法，以自己的心为主才是好方法。)" },
            { context: "" },
            { context: "" },
        ]
    }, {
        title: "注意事项：",
        data: [
            { context: "心血来潮读易经;(我读易经是心血来潮读的，这里主要是读《易传》，易传是易经的解释，又称十翼，是给易经装的十支翅膀，毕竟易经是上古人士作的，我们看不懂，也不必看懂，只要理解了易传的含义，把握其中的精华所在，然后和自己的体悟融会贯通，但一定要熟记64卦的挂名就可以了。易经一定有它简易的一面，我们就从简单的入手就好。)" },
            { context: "读懂易经神来到。(其实，读懂易传足够了，根本就不必去再读易经原文了，就像自己就是神仙那样，很舒服自在。)" },
            { context: "顺手拈来八卦象;(预测未来完全是任凭心血来潮、随意找出卦象来。)" },
            { context: "鬼使神差不枉然。(就算是写错了八卦，搞错了卦理，说出来的结果也是准确的，就这么怪。)" },
            { context: "世间本无善与恶;(其实啊，人世间并没有善与恶的分别，只是人们自己分开来的。)" },
            { context: "因果循环天理合。(宇宙间只有因果的天理在循环。)" },
            { context: "吉中有凶凶藏吉;(其实，所有的事物皆是如此，好事情中总是有不完美的地方，坏事情中也有好的地方。)" },
            { context: "居安思危便化无。(如果能做到顺境中考虑到逆境会到来的话，做好预防措施，逆境就永远不会来到，凶也能化为吉了。)" },
        ]
    }, {
        title: "八卦象数口诀",
        data: [{
            title: "乾卦",
            data: [
                { context: "乾物金玉与珠宝，冠镜木果钱钟表。" },
                { context: "高档用品如轿车，圆物刚物全是了。" },
                { context: "动物马狮天鹅象，寺院皇宫都市撞。" },
                { context: "高楼宫殿博物馆，君父长官有名望。" },
                { context: "英雄独裁掌权人，刚毅果断积极行。" },
                { context: "冷酷傲慢是缺点，还有强制任专横。" },
                { context: "身体胸部头骨肺，季节秋天戌亥配。" },
                { context: "颜色大赤玄金黄，一四九数西北位。­" },
                { context: "" },
            ]
        }, {
            title: "坤卦",
            data: [
                { context: "坤人勤劳又恭敬，沉默迟缓性柔顺。" },
                { context: "消极懒躺懦弱穷，依赖吝啬要谨慎。" },
                { context: "人物普通之大众，农夫乡人泥瓦工。" },
                { context: "老母后母妻寡妇，臣民顾问村干部。" },
                { context: "大腹之人地产商，阴气盛者小人狂。" },
                { context: "牛马雌兽脾胃肉，西南八五十色黄。" },
                { context: "辰戌丑未均旺季，五谷布衣包瓦器。" },
                { context: "矮旧农舍会市场，田野仓库平原地。" },
                { context: "" },
            ]
        }, {
            title: "震卦",
            data: [
                { context: "震怒躁动起虚惊，性急无礼强霸民。" },
                { context: "表现进步显勇敢，追求紧迫便粗心。" },
                { context: "人物有名是将帅，警察法官长子在。" },
                { context: "狂士声大善吹牛，运动驾驶跑得快。" },
                { context: "住宅楼阁闹市中，公园车站大道同。" },
                { context: "唯有庭院山林静，歌厅舞厅乱轰轰。" },
                { context: "春来寅卯四八三，龙蛇鹰蜂鹤鹿眠。" },
                { context: "足肝神经声音发，竹木制品采花鲜。" },
                { context: "" },
            ]
        }, {
            title: "巽卦",
            data: [
                { context: "巽为长女为僧道，教师商人手艺妙。" },
                { context: "优柔寡断科技人，额宽面白头发少。" },
                { context: "奔波忙碌飘难定，多欲空虚基不牢。" },
                { context: "进退忧疑生权谋，鼓舞附和直爽好。" },
                { context: "场地山林之寺观，商店码头邮局连。" },
                { context: "窄路管道长直物，木制纤维丝线牵。" },
                { context: "蝇笔蚊香电风扇，兰花草约救生圈。" },
                { context: "鸡鹅鸭蛇五三八，青兰辰巳股肱边。" },
            ]
        }, {
            title: "坎卦",
            data: [
                { context: "坎人算计太聪明，义气漂泊不安宁。" },
                { context: "时时险陷灾难困，狡猾欺诈亦劳心。" },
                { context: "善则思想多创造，恶则暗昧匪与盗。" },
                { context: "劳苦沉默变酒鬼，耳血腰肾防不妙。" },
                { context: "江湖泉井与河沟，酒店澡堂监狱囚。" },
                { context: "车库饭店地下室，油盐酱醋饮料流。" },
                { context: "带核桃李放酒具，磁盘影带计算器。" },
                { context: "一六亥子属北方，色黑猪鱼狐鼠遇。" },
                { context: "" },
            ]
        }, {
            title: "离卦",
            data: [
                { context: "离为火兮为日电，聪明虚心重表现。" },
                { context: "煽动轻浮好虚荣，自满扩张示鲜艳。" },
                { context: "中层美人文艺人，目疾兵戈幻多情。" },
                { context: "报刊印章图书信，影视机器灯照明。" },
                { context: "大腹中空瓶笼类，玻璃门窗烧烤会。" },
                { context: "名胜书馆影剧场，医院学校火山射。" },
                { context: "公安法院检察院，三二七南红紫变。" },
                { context: "雉龟虾蟹凤孔雀，心目上焦小肠患。" },
                { context: "" },
            ]
        }, {
            title: "艮卦",
            data: [
                { context: "艮为少男与儿童，僧道闲人土建工。" },
                { context: "石匠囚犯监狱吏，奴仆官僚可怜虫。" },
                { context: "主观任性太顽固，困阻偏激保守路。" },
                { context: "沉着冷静慢更新，建设改善莫停步。" },
                { context: "丘陵坟墓山高台，银行寺庙休息宅。" },
                { context: "堤坎监狱派出所，仓库门坎桌子鞋。" },
                { context: "磁器石碑床与伞，硬木硬果钱袋满。" },
                { context: "五黄十七在东北，手背胃鼻虎鼠犬。" },
            ]
        }, {
            title: "兑卦 ­",
            data: [
                { context: "兑为少女妾可爱，巫师巫婆娼妓坏。" },
                { context: "动口职业如歌女，饮食金融与破败。" },
                { context: "喜悦温柔逞雄辩，谗毁谤说成淫滥。" },
                { context: "笑骂吵闹空议论，服从脱落装伪善。" },
                { context: "身体口舌肺咽痰，泽中之物羊猴猿。" },
                { context: "饮食用具缺损品，金刀金类乐器玩。" },
                { context: "有口瓶子酒杯罐，山洞池井水泽畔。" },
                { context: "废墟路口破壁屋，四二九白西方看。​​​​" },
                { context: "" },
            ]
        },
        ]
    }, {
        title: "爻辞吉凶 ­",
        data: [
            { context: "爻辞中关于吉凶的断语共分为九个层次，它们由吉到凶的排列顺序是吉、亨、利、无咎、悔、吝、厉、咎、凶。" },
            { context: "吉，代表吉祥，是最好的结果。" },
            { context: "亨，代表顺利、畅通，是无障碍的意思。" },
            { context: "利，代表有意、适宜，是向好的方面发展。" },
            { context: "无咎，是没有过错，平平淡淡，是介于吉凶之间。" },
            { context: "悔，是有过失而悔恨，能接受教训。" },
            { context: "吝，代表羞辱，如果不知羞辱就会走向过失。" },
            { context: "厉，代表危险，但吉凶未定，随时可能向两方转化。" },
            { context: "咎，是出现了过失，需要承担责任，不过过失的状况轻于凶。" },
            { context: "凶，代表凶险、凶恶，是最坏的结果。" },

        ]
    },
    //	
    //	
    {
        title: "六十四卦爻辞",
        data: [{
            title: "乾为天01 -- 乾，元，亨，利，贞。【大吉大利，吉利的贞卜。】",
            data: [
                { context: "初九：潜龙，勿用。【初九：潜藏的龙，无法施展。】" },
                { context: "九二：见龙在田，利见大人。【九二：龙出现在大地上，有利于会见贵族王公。】" },
                { context: "九三：君子终日乾乾，夕惕若历，无咎。【九三：有才德的君子始终是白天勤奋努力，夜晚戒惧反省，虽然处境艰难，但终究没有灾难。】" },
                { context: "九四：或跃在渊，无咎。【九四：龙也许跳进深潭，没有灾难。】" },
                { context: "九五：飞龙在天，利见大人。【九五：龙飞腾在空中，有利于会见贵族王公。】" },
                { context: "上九：亢龙有悔。【上九：升腾到极限的龙会有灾祸之困。】" },
                { context: "用九：见群龙，无首吉。【群龙出现在天空，看不出首领，吉利。】" },
            ]
        }, {
            title: "天泽履10 -- 履虎尾，不咥人，亨。【踩着虎尾巴，老虎不咬人，吉利。】",
            data: [
                { context: "初九：素履往，无咎。【初九：以朴素坦白的态度处世，没有灾害。】" },
                { context: "九二：履道坦坦，幽人贞吉。【九二：行道之人，胸怀坦荡；隐居之人，长逢吉兆。】" },
                { context: "六三：眇能视，跛能履，履虎尾，咥人凶，武人为于大君。【六三：瞎了眼睛却要看物，跛了脚却要行走，这是勉为其难，犹如踩着虎尾巴，终将为虎所伤。这是凶险之事。武人纂夺国政，同样是凶险之事。】" },
                { context: "九四：履虎尾，愬愬，终吉。【九四：踩着虎尾巴，但能遇险知惧，最后仍吉利】" },
                { context: "九五：夬履，贞厉。【九五：行为急躁莽撞；卜其行事有危险之象】" },
                { context: "上九：视履考祥，其旋元吉。【上九：行为审慎，遇事周密面反复地考虑，大吉。】" },
            ],
        }, {
            title: "天火同人13 -- 同人于野，亨。利涉大川，利君子贞。【聚众于郊外，将行大事，吉利。有利于涉水渡河，有利于君子的卜问。】",
            data: [
                { context: "初九：同人于门，无咎。【初九：聚集大众于王门，将行大事，没有灾祸。】" },
                { context: "六二：同人于宗，吝。【六二：聚同族于宗庙，卜祷凶吉，因为面临艰难。】" },
                { context: "九三：伏戎于莽。升其高陵，三岁不兴。【九三：将军队隐蔽在深山密林，并且占领了制高点，但长时期不能取胜。】" },
                { context: "九四：乘其墉，弗克，攻吉。【九四：爬上了敌人的城墙，城还没有攻下来，继续攻打才能获胜。】" },
                { context: "九五：同人，先号咷而后笑，大师克相遇。【九五：聚集起来的大众先哭号后欢笑，因为大军及时增援，大获胜仗。】" },
                { context: "上九：同人于郊，无悔。【上九：聚众于郊外，致祭于神灵祝贺胜利，自然没有悔咎。】" },
            ],
        }, {
            title: "天雷无妄25 -- 无妄，元亨利贞。其匪正有眚，不利有攸往。【嘉美通泰，卜问得吉兆。行为不正当，则有灾殃，有所往则不利。】",
            data: [
                { context: "初九：无妄，往吉。【初九：不要妄行非正，吉利。】" },
                { context: "六二：不耕获，不菑畬，则利有攸往。【六二：不耕种就想收获，不开荒地就想种熟地。这些妄谬的行径怎能有利?】" },
                { context: "六三：无妄之灾，或系之牛，行人之得，邑人之灾。【六三：意外的灾难。比喻说有人将牛系在不该系的地方，行人顺手牵牛获意外之得，邑人失牛受到意外之灾。】" },
                { context: "九四：可贞，无咎。【九四：称心的占问，没有灾难】" },
                { context: "九五：无妄之药，勿药有喜。【九五：患意外之病，不要忙乱服药，自可痊愈。】" },
                { context: "上九：无妄行有眚，无攸利。【上九：不要胡作妄行！将有灾殃，没有好处。】" },
            ],
        }, {
            title: "天风姤44 -- 姤，女壮，勿用取女。【梦见女子受伤。筮遇此卦，不利于娶女。】",
            data: [
                { context: "初六：系于金柅，贞吉。有攸往，见凶，赢豕孚蹢躅。【初六：细柔之线牵附于黄铜柅子之上。这是吉利的贞兆。若占问有所往，则必逢凶险，就象瘦弱的猪被不情愿地拖回来。】" },
                { context: "九二：包有鱼，无咎，不利宾。【九二：厨中有鱼。占得此爻，没有灾祸，但不利宴请宾客。】" },
                { context: "九三：臀无肤，其行次且，厉，无大咎。【九三：臀部负伤，行走困难。占得此爻，有危险，但尚无大的灾难。】" },
                { context: "九四：包无鱼，起凶。【九四：厨中无鱼。筮遇此爻，有所动作必遭凶险。】" },
                { context: "九五：以杞包瓜，含章，有损自天。【九五：匏瓜缠着杞树生长，隐印的瓜纹很好看。忽然从头顶上方掉下一个瓜来。】" },
                { context: "上九：姤其角，吝；无咎。【上九：遭遇野兽，处于它的角锋之下，不是好兆头，但没有大的灾难。 】" },
            ],
        }, {
            title: "天水讼06 -- 讼，有孚，窒惕。中吉，终凶。利见大人，不利涉大川。【虽有利可图(获得俘虏)，但要警惕戒惧。其事中间吉利，后来凶险。占筮得此爻，有利于会见贵族王公，不利于涉水渡河。】",
            data: [
                { context: "初六：不永所事，小有言，终吉。【初六：做事不能持之以恒，稍有过错，最后还是吉利的。】" },
                { context: "九二：不克讼，归而逋，其邑人三百户无眚。【九二：讼事失败，归到采邑，三百户奴隶逃亡。没有大的灾祸。】" },
                { context: "六三：食旧德，贞厉，终吉。或从王事，无成。【六三：依赖先人遗业过活。卜问得险兆，但最后是吉利的。但是，如果服务于王事，谋取利禄，却不会成功。】" },
                { context: "九四：讼事失败，败讼回家，服从判决。卜问平安，得吉利之兆。" },
                { context: "九五：讼，元吉。【九五：争讼，筮遇此爻，大吉大利。】" },
                { context: "上九：或锡之鞶带，终朝三褫之。【上九：王侯赐予人以绅带，但不满一天，三次赐予三次革夺】" },
            ],
        }, {
            title: "天山遁33 ---  遁，亨，小利贞。【通达。小有利之占问。】",
            data: [
                { context: "初六：遁尾，厉，勿用有攸往。【初六：君子全部隐退，国家就危险了。不能有所作为了。】" },
                { context: "六二：执之用黄牛之革，莫之胜说。【六二：抓来用黄牛革绳紧紧捆绑，这样就不能解脱了。】" },
                { context: "九三：系遁，有疾厉，蓄臣妾，吉。【九三：被拖累而不能决然隐退，就像身染重病，情形危险。在这种情况下，蓄养奴婢或可有利。】" },
                { context: "九四：好遁，君子吉，小人否。【九四：喜爱隐居，这对君子是吉利的，对小人则未必。】" },
                { context: "九五：嘉遁，贞吉。【九五：退隐以时，值得赞美，卜问前程，通泰吉利。】" },
                { context: "上九：肥遁，无不利。【上九：远走高飞，退隐山林，无不利。】" },
            ],
        }, {
            title: "天地否12 -- 否之匪人，不利君子贞，大往小来。【为小人所隔阂，这是不利于君子的卜占，事业也将由盛转衰。】",
            data: [
                { context: "初六：拔茅茹以其汇，贞吉，亨。【初六：连根拔掉茅草，及其同类，占得此爻则吉利，亨通。】" },
                { context: "六二：包承，小人吉，大人否亨。【六二：厨中有肉，这对老百姓来说是吉利，对贵族来说并不是通泰的表现。】" },
                { context: "六三：包羞。【六三：厨中有美味。】" },
                { context: "九四：有命，无咎。畴离祉。【九四：君王有赏赐之命，没有灾害，谁能得到赏赐呢?】" },
                { context: "九五：休否，大人吉。其亡其亡，系于苞桑。【九五：警戒覆亡，贵族王公如此存心则吉利。危险呵，危险，国家命运好像系在柔弱的苞草、桑枝上一样。】" },
                { context: "上九：倾否，先否后喜。【上九：短暂的恶运，先遇恶运后交好运。】" },
            ],
        }, {
            title: "泽天夬43 -- 夬，杨于王庭，孚号有厉，告自邑，不利即戎，利有攸往。【夬卦：王庭里正跳舞作乐。有人呼告：“有敌人来犯。”邑中传来命令：“出击不利，要严阵以待。”筮遇此爻，出外旅行则吉利。】",
            data: [
                { context: "初九：壮于前趾，往不胜，为咎。【初九：脚趾受伤，仍然继续前进，将因为脚力不胜而遭致灾难。】" },
                { context: "九二：惕号，莫夜有戎，勿恤。【九二：恐惧地惊叫，夜间有敌来犯，但不足为患。】" },
                { context: "九三：壮于頄，有凶，君子夬夬，独行遇雨若濡，有愠，无咎。【九三：颧骨受伤，这是凶象。君子匆匆忙忙地独个儿行路，碰上了雨，全身淋湿了，令人很不快，但没有灾难。】" },
                { context: "九四：臀无肤，其行次且，索羊悔亡，闻言不信。【九四：臀部受伤，走起路来踉踉跄跄。牵羊上路，悔恨丢失了羊儿，这是由于对别人的告诫不相信。】" },
                { context: "九五：苋陆夬夬，中行无咎。【九五：细角山羊在道路中间蹦蹦跳跳，筮遇此爻无灾难】" },
                { context: "上六：无号，终有凶。【上六：狗在哭叫，预兆着终将有凶险之事。】" },
            ],
        }, {
            title: "兑为泽58 -- 兑，亨，利贞。【亨通。吉利的贞卜。】",
            data: [
                { context: "初九：和兑，吉。【初九：和睦欢喜，吉利。】" },
                { context: "九二：孚兑，吉。悔亡。【九二：优待俘虏，吉利，没有悔恨。】" },
                { context: "六三：来兑，凶。【六三：以使人归服为乐，蕴藏着凶险。】" },
                { context: "九四：商兑未宁，介疾有喜。【九四：商谈恢复邦交之事，尚未达成协议，但两国的矛盾分歧有了愈合的趋势。】" },
                { context: "九五：孚于剥，有厉。【九五：被剥国俘虏。剥国无理挑衅，必遭惩罚(对我方而言，坏事将变为好事)。】" },
                { context: "上六：引兑。陪【上六：引导大家和睦相处。】" },
            ],
        }, {
            title: "泽火革49 -- 革，巳日乃孚，元亨利贞，悔亡。【祭祀之日用俘虏作人牲，亨通，吉利的卜问。没有悔恨。】",
            data: [
                { context: "初九：巩用黄牛之革。【初九：用黄牛的皮革束紧加固(战车)。】" },
                { context: "六二：巳日乃革之，征吉，无咎。【六二：祭祀的日期要改变。随之要重新卜问征战的日期，结果卜得吉兆，没有灾难。】" },
                { context: "九三：征凶，贞厉。革言三就，有孚。【九三：出征，吃了败仗，卜问得凶兆。但是，只要振奋精神，整顿装备，重新开战，则能转败为胜，生擒强敌。】" },
                { context: "九四：悔亡，有孚，改命吉。【九四：没有悔恨。至于占问战争，则小有战果，如果改帅易将，则将大吉。】" },
                { context: "九五：大人虎变，未占有孚。【九五：大人虎变，未占有孚。】" },
                { context: "上六：君子豹变，小人革面，征凶，居贞吉。【上六：君子精神振奋，但基层官兵一反常态。筮遇此爻，占问征伐，则凶险。卜问居处则吉利。】" },
            ],
        }, {
            title: "泽雷随17 --- 随，元亨，利贞，无咎。【大吉大利，卜得吉兆，没有灾害。】",
            data: [
                { context: "初九：官有渝，贞吉，出门交有功。【初九：馆舍时里发生事故，筮遇此爻则吉，出门同行都得好处。】" },
                { context: "六二：系小子，失丈夫。【六二：抓住了未成年的奴隶，跑了成年的奴隶。】" },
                { context: "六三：系丈夫，失小子。随有求得，利居贞。【六三：抓住了成年奴隶，跑了未成年奴隶。希望无失不如现得。筮遇此爻，卜问居处则吉利。】" },
                { context: "九四：随有获，贞凶。有孚在道，以明，何咎？【九四：追名逐利，贪多务获，卜问得凶兆。押送俘虏上路，明于约束，没有灾难。】" },
                { context: "九五：孚于嘉，吉。【九五：俘虏了不少嘉人，吉利。】" },
                { context: "上六；拘系之，乃从维之，王用亨于西山。【上六：将俘虏拘禁起来，紧紧捆绑，周文王将他们作为人牲在西山祭祀神灵。】" },
            ],
        }, {
            title: "泽风大过28 -- 大过，栋桡，利于攸往，亨。【屋粱压得弯曲了。有所往则有利，通泰。】",
            data: [
                { context: "初六：籍用白茅，无咎。【初六：恭敬地用白茅垫着祭品，可以无灾祸。】" },
                { context: "九二：枯杨生秭，老夫得其女妻，无不利。【九二：枯杨发芽，老头子娶少女为妻，并无不吉利。】" },
                { context: "九三：栋桡，凶。【九三：屋梁弯曲，这是凶险之象】" },
                { context: "九四：栋隆，吉，有它吝。【九四：屋梁挺直，吉利。但有意外之患则不好应付。】" },
                { context: "九五：枯杨生华，老妇得其士夫，无咎，无誉。【九五：枯杨开花，老妇人嫁给一个年轻人，这件事不好也不坏。】" },
                { context: "上六：过涉灭顶，凶，无吝。【上六：盲目涉水，水深过顶，虽遇凶险，但终归没有灾难。】" },
            ],
        }, {
            title: "泽水困47 -- 困，亨，贞，大人吉，无咎。有言不信。【通泰。卜问王公贵族之事吉利，没有灾难。筮遇此爻，有罪之人无法申辩清楚。】",
            data: [
                { context: "初六：臀困于株木，入于幽谷，三岁不觌。【初六：臀部被狱吏的刑杖打伤，被投入黑暗的牢房中，三年不见其人。】" },
                { context: "九二：困于酒食，朱绂方来，利用享祀，征凶，无咎。【九二：酒醉未醒，穿着红色服装的蛮夷前来进犯，忧患猝临，宜急祭神求佑。至于占问出征，则有危险。其他事无大的灾祸。】" },
                { context: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。【六三：被石头绊倒，被蒺藜刺伤，历难归家，妻子又不见了，这是凶险之兆。】" },
                { context: "九四：来徐徐，困于金车，吝，有终。【九四：其人被关押在囚车里，慢慢地走来。真不幸，但最后还是被释放。】" },
                { context: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。【九五：割了鼻子，断了腿，被身着红色服装的蛮夷虏去。后来慢慢找到脱身的机会，终于逃脱回家。宜急祭神酬谢。】" },
                { context: "上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。【上六：被葛藟绊倒，被小木桩刺伤，处境如此艰难，不宜有所行动，否则悔上加悔。至于占问出征则吉利。】" },
            ],
        }, {
            title: "泽山咸31 -- 咸，亨，利贞。娶女，吉。【通达，吉利的贞卜。娶女，吉利。】",
            data: [
                { context: "初六：咸其拇。【初六。伤其大脚趾。】" },
                { context: "六二：咸其腓，凶，居吉。【六二：伤其腿肚子，这是凶兆。小腿负伤，不宜出门，安居不动，自然平安。】" },
                { context: "九三：咸其股，执其随，往蔺吝。【九三：伤其股，并伤及股下之肉。带伤出行，定遭灾难。 】" },
                { context: "九四：贞吉，悔亡。憧憧往来，朋从尔思。【九四：贞卜吉利，无所悔恨。纷沓往来，朋友们都顺从你的意旨。】" },
                { context: "九五：咸其脢，无悔。【九五：伤其背肉，但没有灾祸。】" },
                { context: "上六：咸其辅颊舌。【上六：伤其腮帮、脸颊、舌头。】" },
            ],
        }, {
            title: "泽地萃45 -- 萃，亨。王假有庙。利见大人，亨，利贞，用大牲吉，利有攸往。【通泰。王到宗庙举行祭祀。占得此卦，利于会见贵族王公，亨通，这是吉利的贞兆。用牛牲祭祀，也很吉利，并且出行吉利。】",
            data: [
                { context: "初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。【初六：捕获了俘虏，却又逃跑了，引起纷乱和忧虑，大家呼喊着四处追捕。终于追回了，又高兴得嘻嘻哈哈，用不着担忧了。占得此爻，大胆前往，没有灾难。 】" },
                { context: "六二：引吉，无咎，孚乃利用禴。【六二：占得此爻，长时间吉利，没有灾难。占问祭祀，贞兆显示：春祭要用俘虏作人牲才好。】" },
                { context: "六三：萃如嗟如，无攸利，往无咎，小吝。【六三：忧愁嗟叹。占得此爻，无所利。出行则无灾难，但有小小的麻烦。】" },
                { context: "九四：大吉无咎。【九四：大吉大利，没有灾难。】" },
                { context: "九五：萃有位，无咎。匪孚，元永贞，悔亡。【九五：瘁心力于其职守，没有灾祸。不轻易责罚别人，卜问长期的吉凶，贞兆显示：没有大的悔恨。】" },
                { context: "上六：赍咨涕洟，无咎。【上六：叹息流涕，忧心忡忡，但没有灾难。】" },
            ],
        }, {
            title: "火天大有14 -- 大有，元亨。【昌隆通泰。】",
            data: [
                { context: "初九：无交害，匪咎艰则无咎。【初九：不要彼此侵害，即没有灾祸，既使处于艰难之中，也没有灾祸。 】" },
                { context: "九二：大车以载，有攸往，无咎。【九二：用大车装物载人，有明确的目的地，没有灾祸。】" },
                { context: "九三：公用亨于天子，小人弗克。【九三：天子宴请公侯。小人则不能参与。】" },
                { context: "九四：匪其彭，无咎。【九四：用曝晒男巫来求雨，旱情严重，但没有灾祸。】" },
                { context: "六五：厥孚交如，威如，吉。【六五：来犯之敌被紧紧捆绑，严厉惩罚，吉利。】" },
                { context: "上九：自天祐之，吉，无不利。【上九：上天保祐，吉利，无所不顺利。】" },
            ],
        }, {
            title: "火泽睽38 -- 睽，小事吉。【筮遇此卦，小事吉利。】",
            data: [
                { context: "初九：悔亡。丧马勿逐，自复。见恶人，无咎【初九：不必悔恨，丢失了马匹，不必寻找，它自会回来，途中碰见坏人，也不会有灾祸。】" },
                { context: "九二：遇主于巷，无咎。【九二：遇着了热情好客的主人，没有灾难。】" },
                { context: "六三：见舆曳，其牛掣，其人天且劓，无初，有终。【六三：看见一辆拉货的车，拉车的牛一俯一仰拉得很费劲，赶车的人是—个烙了额，割了鼻的奴隶。起初车子陷着不动，后来终于拉动了。】" },
                { context: "九四：睽孤遇元夫，交孚，历无咎。【九四：旅人孤单地行路，遇上一个踱子，一同被抓住，情形危险，但终无灾祸。】" },
                { context: "六五：悔亡，厥宗噬肤，往何咎。【六五：没有悔恨。瞧见同族宗人在吃肉，孤单的旅人欣然结伴同行，一路平安无事。】" },
                { context: "上九：睽孤见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。【上九：旅人孤单地行路，见一头大猪伏在路上，又遇上一辆大车，上面满载着打扮得奇形怪状的人。旅人搭弓欲射，后来又放下弓箭。因为这伙人不是强盗，而是去订婚的。旅人照常行进，遇上大雨，但一切平安。】" },
            ],
        }, {
            title: "离为火30 -- 离，利贞，亨。畜 牛牝吉。【吉利的占问，通泰。饲养母牛，吉利。】",
            data: [
                { context: "初九：履错然敬之，无咎。【初九：听到纷来沓至的脚步声，立时警惕戒备，可以无灾难。】" },
                { context: "六二：黄离，元吉。【六二：天空出黄霓，大吉大利。】" },
                { context: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。【九三：黄昏时分有霓虹出现在天空，这是凶兆，人们居然不击鼓唱歌禳除它，老人感到悲哀，灾殃快要来了。】" },
                { context: "九四：突如其来如，焚如，死如，弃如。【九四：灾难突然降临，敌人见房屋就烧，见人就杀，此处变成一片废墟。】" },
                { context: "六五：出涕沱若，戚嗟若，吉。【六五：灾难过后，人们痛哭，人们悲叹，然而吉利。】" },
                { context: "上九：王用出征，有嘉折首，获匪其丑，无咎。【上九：国王出征，反击敌人，将有嘉国的国君斩首，抓到了许多俘虏，无灾无难。】" },
            ],
        }, {
            title: "火雷噬嗑21 -- 噬嗑，亨，利用狱。【通泰。利于讼狱。 】",
            data: [
                { context: "初九：屦校灭趾，无咎。【初九：拖着刑具，磨破了脚趾，但没有大的灾难。】" },
                { context: "六二：噬肤灭鼻，无咎。【六二：大吃鲜鱼嫩肉，遭受割鼻之刑，但没有大难。 】" },
                { context: "六三：噬腊肉，遇毒，小吝，无咎。【六三：吃腊肉，中毒。碰上了麻烦，但不十分严重。】" },
                { context: "九四：噬干胏，得金矢，利艰贞，吉。【九四：啃吃骨头，发现骨头中有金属箭头。卜问艰难之事，结果是吉利的。】" },
                { context: "六五：噬干肉，得黄金，贞厉，无咎。【六五：吃干肉，发现金属箭头。卜问得危险之兆，但最终可以无灾祸。】" },
                { context: "上九：何校灭耳，凶。【上九：肩上扛着大枷，磨破了耳朵，凶险。】" },
            ],
        }, {
            title: "火风鼎50 -- 鼎，元吉，亨。【大吉大利，亨通。】",
            data: [
                { context: "初六：鼎颠趾，利出否，得妾以其子，无咎。【初六：将鼎倾覆，鼎足向上，筮遇此爻，利于清除恶人。以无子而纳妾。因纳妾而得子，没有灾祸】" },
                { context: "九二：鼎有实，我仇有疾，不我能即，吉。【九二：鼎中有食物。筮遇此爻，家里有饭吃，仇家有疾病，再没有什么东西困扰我，吉利。】" },
                { context: "九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。【九三：鼎耳脱落了。筮遇此爻，打猎无所获。野味莫吃光，老天要下雨，不知何日能出猎，坐吃山空，食物将匮乏，节约渡难关，终于得吉利。】" },
                { context: "九四：鼎折足，覆公餗，其形渥，凶。【九四：鼎足太轻，不堪重负，以致折断，倾覆王公的珍馐美味，弄得汁液满地，形容狼藉。这是凶险之兆。】" },
                { context: "六五：鼎黄耳，金铉，利贞。【六五：豪华之鼎，上面装配有铜耳、铜铉。筮遇此爻吉利。】" },
                { context: "上九：鼎玉铉，大吉无不利。【上九：金属之鼎配以玉石之铉。占得此爻，大吉，无所不利。】" },
            ],
        }, {
            title: "火水未济64 -- 未济，亨。小狐泛济，濡其尾，无攸利。【亨通。小狐狸快要渡过河，却打湿了尾巴。看来此行无所利。】",
            data: [
                { context: "初六：濡其尾，吝。【初六：涉水渡河，沾湿了衣尾，前进有困难。】" },
                { context: "九二：曳其轮，贞吉。【九二：提着腰带涉水过河。卜问得吉兆。】" },
                { context: "六三：未济，征凶，利涉大川。【六三：渡不了河，出行有凶险。不利于涉水渡河。】" },
                { context: "九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。【九四：吉利的贞卜。没有悔恨。大动干戈，助殷讨伐鬼方，费时三年，打败了它，获得殷国的奖赏。】" },
                { context: "六五：贞吉，无悔，君子之光有孚，吉。【六五：吉利的贞卜，没有悔恨。打了胜仗，捕获了俘虏，这是君子的光荣，吉利。】" },
                { context: "上九：有孚于饮酒，无咎。濡其首，有孚矢是。【上九：捕获了俘虏，饮酒庆贺。没有灾难。但酗酒闹事，头发都淋湿了。俘虏乘机作乱，将他们杀了。 】" },
            ],
        }, {
            title: "火山旅56 -- 旅，小亨，旅，贞吉。【稍见亨通。贞卜旅行，吉利。】",
            data: [
                { context: "初六：旅琐琐，斯其所取灾。【初六：旅人三心二意，进退犹豫，最后还是离开住所，结果自遭灾祸。】" },
                { context: "六二：旅即次，怀其资，得童仆贞。【六二：旅人来到市场，带着钱财，买来一男仆，卜问得吉兆。】" },
                { context: "九三：旅焚其次，丧其童仆贞，厉。【九三：旅人来到着火的市场上，新买的男仆乘乱跑掉。卜问得险兆。】" },
                { context: "九四：旅于处，得其资斧，我心不快。【九四：旅人回到客居之处，因为赚了不少钱，心中不踏实。】" },
                { context: "六五：射雉，一矢亡，终以誉命。【六五：射野鸡，一发命中，其人因而博得善时的美名。】" },
                { context: "上九：鸟焚其巢，旅人先笑后号啕，丧牛于易，凶。【上九：鸟儿的巢窠被焚烧，周人的邑落被抢劫，四处流落的周人呵，美好的生活已成往事，悲惨的现实即在眼前，狄人牵着牛羊去，往后的日子怎么过。】" },
            ],
        }, {
            title: "火地晋35 -- 晋，康侯用锡马蕃蔗，昼日三接。【康侯用成王赐予的良马来繁殖马匹，一天多次配种。】",
            data: [
                { context: "初六：晋如、摧如，贞吉。罔孚，裕无咎。【初六：攻击敌人，打垮敌人，卜问得吉兆。胜利之师没有捕捉俘虏，没有抢掠财物，不会有灾难。】" },
                { context: "六二：晋如愁如，贞吉。受兹介福于其王母。【六二：攻击敌人，压倒敌人，卜问得吉兆。因为得到了先祖母的庇佑获得大福。】" },
                { context: "六三：众允、悔亡。【六三：万众一心，全力进攻，无所悔恨。】" },
                { context: "九四：晋如鼫鼠，贞厉。【九四：攻击敌人而胆小如鼠，卜问得凶兆。】" },
                { context: "六五：悔无，失得勿恤，往吉，无不利。【六五：无所悔恨，吃了败仗，不要气馁。只要再接再厉，终必转败为胜。无所不利】" },
                { context: "上九：晋其角，惟用伐邑，厉吉,，无咎，贞吝。【上九：攻击敌人，必须较量敌我双方的力量，可以考虑攻击敌人的城邑。但其结局难料：或许危险，或许吉利，或许没有灾难，或许正践凶兆。】" },
            ],
        }, {
            title: "雷天大壮34 -- 大壮，利贞。【吉利的卜问。】",
            data: [
                { context: "初九：壮于趾，征凶，有孚。【初九：伤于脚趾。筮遇此爻，出征则凶，但尚有收获。】" },
                { context: "九二：贞吉。【九二：卜问得吉兆。】" },
                { context: "九三：小人用壮，君子用罔。祗羊触藩，赢其角。【九三：小人捕兽凭气力，君子捕兽靠网围。卜问得险兆。公羊以角撞藩，结果被篱笆卡住。】" },
                { context: "九四：贞吉，悔亡。藩决不赢，壮子大舆之輹。【九四：卜问得吉兆，没有悔恨。因为公羊冲决篱笆，摆脱了拘系，但又被车轮撞伤，不能乱冲乱撞了。】" },
                { context: "六五：丧羊于易，无悔。【六五：丧羊于狄。筮遇此爻，没有大的灾祸。】" },
                { context: "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。【上六：羊角插进了篱笆，退不了，进不了，处境不利。但是，目前虽处于艰难之中，最终可以化解逢吉。】" },
            ],
        }, {
            title: "雷泽归妹54 -- 归妹，征凶，无攸利。【筮遇此爻，出征凶险。无所利。】",
            data: [
                { context: "初九：归妹以娣，跛能履，征吉。【初九：嫁女而将其妹妹一同陪嫁。跛脚而能行走。筮遇此爻，出行吉利。】" },
                { context: "九二：眇能视，利幽人之贞。【九二：眼睛瞎了而能看得见。这是利于囚徒的贞卜。】" },
                { context: "六三：归妹以须，反归以娣。【六三：嫁女而用其姊陪嫁，随后又与其妹妹返归父母家。】" },
                { context: "九四：归妹愆期，迟归有时。【九四：出嫁时超过了婚龄，迟迟不嫁是因为有所等待。】" },
                { context: "六五：帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。【六五：帝乙嫁女于周文王，以其次女陪嫁。论嫁妆姊的不如妹的好。良辰择在某月十四日，吉利。】" },
                { context: "上六：女承筐无实，士刲羊无血，无攸利。【上六：献祭之时，新娘捧着盛祭品的筐具，但筐中无物；新郎以刀刺羊，但羊不流血。此不祥之兆，无所利。】" },
            ],
        }, {
            title: "雷火丰55 -- 丰，亨，王假之，勿忧，宜日中。【举行祭祀，君王将亲临宗庙。不要担心，最佳时刻当在正午时分。】",
            data: [
                { context: "初九：遇其配主，虽旬无咎，往有尚。【初九：旅途之中受到一位女主人的接待，与这位寡居的女人结成夫妻。占卜结果显示：不会遭人议论，而且能得到人们的赞同。】" },
                { context: "六二：丰其蔀，日中见斗，往得疑疾；有孚发若，吉。【六二：将小席拼缀起来，躺下休息。正午时分，有人说看见北斗星。看来旅伴之中有人精神错乱。对他加以刺激，或许可以使他清醒。】 " },
                { context: "九三：丰其沛，日中见沫。折旧右肱，无咎。【九三：将铺草加厚，躺下休息。正午时分，此人又说看见鬼魅。将他的右臂折断。经此一吓，或许他能清静。】" },
                { context: "九四：丰其部，日中见斗，遇其夷主，吉。【九四：将小席拼缀起来，躺下休息。正午时分，此人还在说看见北斗星，看来还未恢复正常。幸好遇着了他的老店主，把他托付给老店主，这一下可清静平安了。】" },
                { context: "九五：来章，有庆誉,吉。【六五：赚得美玉，大家都庆贺夸奖他。这是吉利之兆。】" },
                { context: "上六：丰其屋，部其家，闚其户，阒其无人，三岁不觌，凶。【上六：房子空荡荡的，屋顶上散乱盖着草席，从门缝里探视，寂无一人。看样子这里多年未住人了。这是不祥之兆。】" },
            ],
        }, {
            title: "震为雷51 -- 震，亨，震来虩虩，笑言哑哑，震惊百里，不丧匕鬯。【临祭之时，雷声传来，有的人吓得浑身发抖，片刻之后，才能谈笑如常。巨雷猝响，震惊百里，有的人却神态自若，手里拿着酒勺子，连一滴酒都没有洒出来。】",
            data: [
                { context: "初九：震来虩虩，后笑言哑哑，吉。【初九：雷声传来，吓得浑身发抖，后来听到雷声，仍谈笑如常，吉利。】" },
                { context: "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。【六二：雷电交加，十分危险，惊慌之中丢失了钱币，翻山越蛉，走了很远的路程去寻找也没有找到。筮者告诉他：“不必追寻了，七八日内，这损失可得补偿。”】" },
                { context: "六三：震苏苏，震行无眚。【六三：出门时遇到电闪雷鸣，感到疑惧不安。继续前进，不会有灾祸。】" },
                { context: "九四：震遂泥。【九四：雷电下击，接触到地面。】" },
                { context: "六五：震往来厉，亿无丧有事。【六五：巨雷轰鸣，危险在前。只要小心谨慎，不至于酿成灾祸，亦无损于事。】" },
                { context: "上六：震索索，视矍矍，征凶，震不于其躬，于其邻，无咎。婚媾有言。【上六：雷电交加，其人行动谨慎，警戒四顾，因为行路艰难，危险四伏。但是雷电不会击在他身上，而是落在邻人的头上。因为他本人没有什么过错，而其他邻人却犯有罪责。】" },
            ],
        }, {
            title: "雷风恒 -- 恒，亨，无吝，利贞，利有攸往。【通达，没有过失，吉利的卜问。有所往则有利。】",
            data: [
                { context: "初六：浚恒，贞凶，无攸利。【初六：掘进不止，卜问凶险，没有什么好处。】" },
                { context: "九二：悔亡。【九二：没有悔恨。】" },
                { context: "九三：不恒其德，或承之羞，贞吝。【九三：不能保持其德行，必然蒙受耻辱。卜问得艰难之兆。】" },
                { context: "九四：田无禽。【九四：畋猎无所获。】" },
                { context: "六五：恒其德，贞妇人吉，夫子凶。【六五：操行一贯。卜得妇人吉利，丈夫财凶险。】" },
                { context: "上六：振恒，凶。【上六：久动不息，凶险。】" },
            ],
        }, {
            title: "雷水解40 -- 解，利西南，无所往，其来复，吉。有攸往，夙吉。【利于西南行，但是，若没有确定的目标，则不如返回，返回吉利。如果有确定的目标，则宜早行，早行吉利。】",
            data: [
                { context: "初六：无咎。【初六：筮遇此爻，没有灾难。】" },
                { context: "九二：田获三狐，得黄矢，贞吉。【九二：畋猎获得三只狐狸，猎物身上带着铜箭头。卜问得吉兆。】" },
                { context: "六三：负且乘，致寇至，贞吝。【六三：带着许多财物，又是背负，又是车拉，招摇惹盗，自然招致盗寇抢劫，卜问有灾祸之象。】" },
                { context: "九四：解而拇，朋至斯孚。【九四：赚了钱，而懒怠不想走，结果被人虏去。】" },
                { context: "六五：君子维有解，吉，有孚于小人。【六五：君子被拘囚后又获释，吉利；小人贝!j将受罚。】" },
                { context: "上六：公用射隼于高墉之上，获之无不利。【上六：在高高的城墙上，王公射中一只鹰，并且抓到了，这没有什么不吉利的。】" },
            ],
        }, {
            title: "雷山小过 -- 小过，亨，利贞，可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。【亨通，这是吉利的贞卜。但是只适宜于小事，不适宜大事。飞鸟空中过，叫声耳边留，警惕人们：登高必遇险，下行则吉利。】",
            data: [
                { context: "初六：飞鸟以凶。【初六：飞鸟经过空中，预兆着凶险。】" },
                { context: "六二：过其祖，遇其妣，不及其君，遇其臣，无咎。【六二：错过了他的祖父，但遇着了他的祖母；没有赶上国君，还是遇着了臣僚。虽有差迟，但非徒劳，因而无灾难。】" },
                { context: "九三：弗过防之，从或戕之，凶。【九三：不要过分指责，但要制止他的错误发展，如果听任放纵，反而害了他，必遭凶险。】" },
                { context: "九四：无咎，弗过遇之。往厉必戒，勿用永贞。【九四：没有过错，不要指责他，但要防止发生错误。前去冒险，则必须立即加以警告，无须乎卜问往后的吉凶。】" },
                { context: "六五：密云不雨，自我西郊，公弋取彼在穴。【九五：在我西郊的上空，云气密布，降雨在即。王公本是去射鸟，可是在洞穴捉到野兽。】" },
                { context: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。【上六：不加制之，因而犯下过失，好比飞鸟钻入罗网，凶险呵，这叫做灾难。】" },
            ],
        }, {
            title: "雷地豫 -- 豫，利建侯，行师。【有利于封侯建国，出兵打仗。】",
            data: [
                { context: "初六：鸣豫，凶。【初六：津津乐道于荒淫享乐，凶险。 】" },
                { context: "六二：介于石，不终日，贞吉。【六二：夹在石缝中，幸而不到一天就被人救出。卜问得吉兆。 】" },
                { context: "六三：盱豫，悔；迟,有悔。【六三：懒散游乐，将招致后悔；再加上懈怠大意，那就后悔莫及。】" },
                { context: "九四：由豫，大有得，勿疑，朋盍簪。【九四：田猎取乐，大获鸟兽。筮遇此爻，勿疑友人多嘴而谗己。 】" },
                { context: "六五：贞疾，恒不死。【六五：卜问疾病，长时间内不会死去。】" },
                { context: "上六：冥豫，成有渝，无咎。【 上六：末日将至尚且享乐，已成之事也将毁败。】" },
            ],
        }, {
            title: "风天小畜09 -- 小畜，亨。密云不雨，自我西郊。【吉利。在西郊一带浓云密布，但雨没有下来。】",
            data: [
                { context: "初九：复自道，何其咎，吉。【初九：由原路返回，有什么灾祸？吉利。 】" },
                { context: "九二：牵复，吉。【九二：牵引着返回，吉利。】" },
                { context: "九三：舆说辐，夫妻反目。【九三：车子坏了一个轮子。夫妻互相口角。】" },
                { context: "六四：有孚，血去惕出，无咎。【六四：捕获了俘虏，战争危险暂时消除了，但仍须保持警惕，才能没有灾难。】" },
                { context: "九五：有孚挛如，富以其邻。【九五：捕获俘虏，串连搁缚，这些对物与邻邑同享。】" },
                { context: "上九：既雨既处，尚德载，妇贞厉，月几望，君子征凶。【上九：久雨新停，还赶得上栽种作物。妇女占得此爻则凶险。夏历某月十四日君子离家出行也有危险。】" },
            ],
        }, {
            title: "风泽中孚61 -- 中孚，豚鱼吉。利涉大川。利贞。【豚鱼献祭，虽物薄但心诚，吉利。并利于涉水过河。这是吉利的贞卜。】",
            data: [
                { context: "初九：虞吉，有它不燕。【初九：行安神之礼，吉利。有这样的变故，自然不行讌礼。】" },
                { context: "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。【九二：老鹤在树荫下鸣叫，小鹤在旁边附和。我有美酒，与你共享用。 】" },
                { context: "六三：得敌，或鼓或罢，或泣或歌。【六三：击败了敌人，有的击鼓追击，有的凯旋报捷；消息传来，有的高兴得热泪盈眶，有的放声高歌。】" },
                { context: "六四：月几望，马匹亡，无咎。【六四：月中的时候，马匹丢失了，但无大的灾祸。】" },
                { context: "九五：有孚挛如，无咎。【九五：俘虏成群，串连捆绑。没有灾难。】" },
                { context: "上九：翰音登于天，贞凶。【上九：鸡飞到天空。卜问得凶兆。】" },
            ],
        }, {
            title: "风火家人37 -- 家人，利女贞。【卜问妇女之事吉利。】",
            data: [
                { context: "初九：闲有家，悔亡。【初九：防范家庭出现意外事故，没有悔恨。】" },
                { context: "六二：无攸遂，在中馈，贞吉。【六二：妇女在家中料理家务，安排饍食，没有失误，这是吉利之象。】" },
                { context: "九三：家人嗃嗃，悔厉吉；妇人嘻嘻，终吝。【九三：贫困之家，众口嗷嗷待哺，这是愁苦之事，但能辛勤劳作，可以脱贫致富。而富贵之家，骄奢淫逸，妻室儿女只知嬉笑作乐，终将败落。】" },
                { context: "六四：富家，大吉。【六四：幸福家庭，大吉大利。】" },
                { context: "九五：王假有家，勿恤，吉。【九五：君王到家庙祭祀祖先，不要忧虑，祖先福佑家人，凡事吉利。】" },
                { context: "上九：有孚威如，终吉。【上九：君上掌握杀罚之权，威风凛凛，权柄不移，终归吉利。】" },
            ],
        }, {
            title: "风雷益42 -- 益，利有攸往，利涉大川。【筮遇此爻，利于有所往，利于涉水渡河。】",
            data: [
                { context: "初九：利用为大作，元吉，无咎。【初九：筮遇此爻，利于大兴土木，大吉大利，并无灾祸。】" },
                { context: "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。【六二：有人赐予价值十朋的大龟，不可拒违其命。卜问得长久的吉兆。君王祭祀天帝，吉利。】" },
                { context: "六三：益之用凶事，无咎。有孚中行告公用圭。【六三：因为武王逝世，增加祭祀鬼神的祭物，没有灾祸。武庚乘国丧作乱，周公发兵征讨，大获胜仗，抓获俘虏。中衍向周公报告，从而举行祭祀。】" },
                { context: "六四：中行告公从，利用为依迁国。【六四：中衍向周公报告了处理殷室遗民之事，周公听从了，顺利地将殷商遗民分封给各封国。】" },
                { context: "九五：有孚惠心，勿问元吉。有孚惠我德。【九五：捕获了很多俘虏，安抚他们，不必追究，大吉大利。这些俘虏，将感戴我的恩德。】" },
                { context: "上九：莫益之，或击之。立心勿恒，凶。【上九：没有人帮助他，还有人攻击他。在这种情况下，立志不坚定，就要坏事。】" },
            ],
        }, {
            title: "巽为风57 -- 巽，小亨，利有攸往，利见大人。【稍见亨通。利于出行，利于会见王公贵族。 】",
            data: [
                { context: "初六：进退，利武人之贞。【初六：进退听命，这是利于武人的占卜。】" },
                { context: "九二：巽在床下，用史巫纷若，吉，无咎。【九二：病人卧床不起，祝史巫士降神祭祀，禳灾驱鬼，忙碌不停。病情有好转，灾难消除了。】" },
                { context: "九三：频巽，吝。【九三：勉强顺从，其心必不顺畅。】" },
                { context: "六四：悔亡，田获三品。【六四：没有悔恨，狩猎获得各种猎物。】" },
                { context: "九五：贞吉，悔亡，无不利，无初有终，先庚三日，后庚三日，吉。【九五：贞卜得吉兆，没有悔恨，无所不利。虽没有良好的开端，但有良好的结局。时日定在丁日或癸日，其事一定成功。】" },
                { context: "上九：巽在床下，丧其资斧，贞凶。【上九：人隐伏在床底下，钱财则被洗劫一空。卜问得凶兆。】" },
            ],
        }, {
            title: "风水涣59 -- 涣，亨。王假有庙，利涉大川，利贞。【亨通，因为君王亲临宗庙，禳灾祈福。并利于涉水过江河。这是吉利的贞卜。】",
            data: [
                { context: "初六：用拯马壮，吉。【初六：洪水突来，因而乘马逃避，匆促跌伤，幸免淹亡之祸，吉利。】" },
                { context: "九二：涣奔其机，悔亡。【九二：洪水奔涌，冲毁房基。性命无虞。不章中之万幸。】" },
                { context: "六三：涣其躬，无悔。【六三：洪水冲到身上，幸免于难，尚可庆幸。】" },
                { context: "六四：涣其群，元吉。涣有丘，匪夷所思。【六四：洪水冲向人群，然而十分幸运，因为人群聚集在山丘上，洪水只能淹到山脚，否则其后果是平常难以想像的。】" },
                { context: "九五：涣汗其大号，涣王居。无咎。【九五：洪水横溢，淹没国都，淹及王宫，牵好人员早巳撤走，没有大的灾难。】" },
                { context: "上九：涣其血去，狄出，无咎。【上九：洪水退去，忧患消除，但仍须警惕，加强防范，这样就没有灾难。】" },
            ],
        }, {
            title: "风山渐53 -- 渐，女归，吉，利贞。【女大当嫁，这是好事。这是吉利的贞卜。】",
            data: [
                { context: "初六：鸿渐于干，小子厉，有言，无咎。【初六：鸿雁走进了山涧。筮遇此爻，警惕小孩顽皮，遭遇危险，应该加以谴责，则没有灾难。】" },
                { context: "六二：鸿渐于磐，饮食衍衍，吉。【六二：鸿雁走上水边高地，饱饮饱食，自得喜乐。筮遇此爻，吉利。】" },
                { context: "九三：鸿渐于陆，夫征不复，妇孕不育，凶。利用御寇。【九三：鸿雁走到旱地上。筮遇此爻，丈夫出征可能不再回返，妇女怀孕可能流产，这是凶险之兆。但有利于抵御敌寇。】" },
                { context: "六四：鸿渐于木，或得其桷，无咎。【六四：鸿雁飞到树木上，有的停息在河边堆放的桷木上。筮遇此爻，没有灾难。】" },
                { context: "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。【九五：鸿雁走到山陵上。筮遇此爻，妻子多年不能怀孕，但始终不会被人取代，吉利。】" },
                { context: "上九：鸿渐于陆，其羽可用为仪，吉。【上九：鸿雁走到山头上，它的羽毛可用来编织舞具。这是吉利之兆。】" },
            ],
        }, {
            title: "风地观20 -- 观，盥而不荐，有孚颙若。【祭祀时灌酒降神而不献人牲，因为用作祭祀的俘虏的头部肿了，不能用作祭品。】",
            data: [
                { context: "初六：童观，小人无咎，君子吝。【初六：愚蠢近视，对一般百姓来讲尚无大碍，但对于担负政治责任的君子来说，将会铸成大错。】" },
                { context: "六二：闚观，利女贞。【六二：囿于一孔之见，这是有利于女人的贞兆。】" },
                { context: "六三：观我生，进退。【六三：观察亲族的思想动向，从而决定为政的措施。】" },
                { context: "六四：观国之光，利用宾于王。【六四：观察国家政绩风俗的辉煌表现。筮遇此爻，有利于朝觐君王。】" },
                { context: "九五：观我生，君子无吝。【九五：善于观察亲族之意向，君子可以无过错。】" },
                { context: "上九：观其生，君子无吝。【上九：观察其他部族的意向，君子可以无过错。】" },
            ],
        }, {
            title: "水天需05 -- 需，有孚，光亨，贞吉。利涉大川。【抓到俘虏。大吉大利，吉利的卜问。有利于涉水渡河。】",
            data: [
                { context: "初九：需于郊。利用恒，无咎。【初九：在郊外等侯，应该照旧等待下去，没有危险。】" },
                { context: "九二：需于沙。小有言，终吉。【九二：在沙地上等待，稍微有过错，最后还是吉利的。】" },
                { context: "九三：需于泥，致寇至。【九三：在泥淖中等待，把强盗招引过来。】" },
                { context: "六四：需于血，出自穴。【六四：起初在血泊中滞留，后来从凶险的陷阱中逃脱出来。】" },
                { context: "九五：需于酒食，贞吉。【九五：在酒宴上等待，这是吉利的占兆。】" },
                { context: "上六：入于穴，有不速之客三人来，敬之，终吉。【上六：进入地穴式的房屋，有三位不速之客来到，恭敬地接待他们，结果是吉利的。】" },
            ],
        }, {
            title: "水泽节60 -- 节，亨，苦节不可贞。【亨通。如果以节制为苦，其凶吉则不可卜问。】",
            data: [
                { context: "初九：不出户庭，无咎。【初九：筮遇此爻，杜门不出，没有灾祸。】" },
                { context: "九二：不出门庭，凶。【九二：筮遇此爻，杜门不出，也有凶险。】" },
                { context: "六三：不节若、则嗟若，无咎。【六三：不节俭则困穷，处困穷则知悔过，知悔过则可以无灾难。】" },
                { context: "六四：安节，亨。【六四：安于节俭遵礼的生活，通泰。】" },
                { context: "九五：甘节，吉，往有尚。【九五：以节俭遵礼为乐，吉利。秉此而行，所往必得别人资助。】" },
                { context: "上六：苦节，贞凶，悔亡。【上六：以节俭遵礼为苦，卜问得凶兆，其人将为家道败落而悔恨。 】" },
            ],
        }, {
            title: "水火既济63 -- 既济，亨小，利贞。初吉，终乱。【亨通。这是小见吉利的贞卜。起初吉利，最后将发生变故。】",
            data: [
                { context: "初九：曳其轮，濡其尾，无咎。【初九：提着腰带过河，打湿了衣尾。没有大问题。】" },
                { context: "六二：妇丧其茀茀、勿逐，七日得。【六二：妇人丢失了头巾，不用寻找，七日内可以不寻而得。】" },
                { context: "九三：高宗伐鬼方，三年克之，小人勿用。【九三：高宗讨伐鬼方，费时三年才打败它。筮遇此爻，不可重用小人。】" },
                { context: "六四：濡有衣袽，终日戒。【六四：撑着用败絮塞罅漏的船，整日里提心吊胆。 】" },
                { context: "九五：东邻杀牛，不如西郊之瀹祭，实受其福。【九五：东邻杀牛，不如西邻之礿祭①，实受其福。】" },
                { context: "上六：濡其首，厉。【上六：涉水过河，水拍湿其头部，危险。】" },
            ],
        }, {
            title: "水雷屯03 -- 屯，元亨，利贞。勿用有攸往，利建侯。【大吉大利，吉利的占卜。不利于出门。有利于建国封侯。】",
            data: [
                { context: "初九：磐桓，利居贞，利建侯。【初九：徘徊难进。这是有利于居住的卜问。巫遇此爻，有利于建国封侯。】" },
                { context: "六二：屯如邅（走）如，乘马班如。匪寇婚媾，女子贞，不字，十年乃字。【六二：逡巡不前。行路踌躇，驾着马车原地回旋，不是前来抢劫，而是迎娶新娘。占得这个女子不能孕育，十年才能怀孕。】" },
                { context: "六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。【六三：追捕野鹿，没有充当向导的官员。思忖着鹿逃入山林。君子机灵，认为不如放弃。深入山林，认为会有危险。】" },
                { context: "六四：乘马班如，求婚媾，往，吉无不利。【六四：驾着马车原地回旋，这是寻求婿姻。放胆前进，必定吉利。】" },
                { context: "九五：屯其膏，小，贞吉；大，贞凶。【九五：屯积肥肉。筮遇此爻，问小事则吉，问大事则凶。】" },
                { context: "上六：乘马班如，泣血涟如。【上六：驾着马车原地回旋，哭泣无声，滴泪涟涟。】" },
            ],
        }, {
            title: "水风井48 -- 井，改邑不改井。无丧无得，往来井井。汔至，亦未繘井，赢其瓶，凶。【改建邑落而不改建水井，等于什么也没有干。人们往来井边汲水，水井干涸淤塞，不去加以淘洗，反而将吊水罐打破，这是凶险之象。】",
            data: [
                { context: "初六：井泥不食，旧井无禽。【初六：井水混浊不可食用。墤塌的陷阱已关不住野兽。】" },
                { context: "九二：井谷射鲋，瓮敝漏。【九二：在井口张弓射井中小鱼。瓮瓶又破又漏。】" },
                { context: "九三：井渫不食，为我心恻，可用汲。王明，并受其福。【九三：君上看见井水污浊不能食用，为我们感刭伤心。淘洗干净，就可汲饮。君上英明呵，众人都获得他们的好处。】" },
                { context: "六四：井渫无咎。【六四：用砖石垒筑井壁，进行顺利。】" },
                { context: "九五：井冽，寒泉食。【九五：水洁泉寒，清凉可口，可以食用。】" },
                { context: "上六：井收勿幕，有孚元吉。【上六：陷阱下宽上窄，十分隐蔽，甚至可以不加伪装。果然捕获了野兽，大吉大利。】" },
            ],
        }, {
            title: "坎为水29 -- 坎，习坎有孚维心，亨，行有尚。【习坎卦。抓获俘虏，劝慰安抚他们，通泰。途中将得到帮助。】",
            data: [
                { context: "初六：习坎，入于坎窞，凶。【初六：坎坑之中又有坎坑，陷入重坑之中，凶险。】" },
                { context: "九二：坎有险，求小得。【九二：坑坑坎坎，道有险阻。敢于行险道，或小有收获。】" },
                { context: "六三：来之坎，坎险阻枕。入于坎窞，勿用。【六三：向坑坎走来，这坑坎既险又深，陷入重坎之中，非常不利。】" },
                { context: "六四：樽酒，簋贰，用缶。纳约自牖，终无咎。【六四：用铜樽盛酒，用圆簋盛饭。然而对于关押在坎窖里的犯人，只须用瓦盆子就行了，牢饭从天窗里送进取出，其人遭此噩运，但最后还是没有危险。】" },
                { context: "九五：坎不盛，祗既平，无咎。【九五：坎坑虽没有填满，小山头却被锄平。没有灾难。】" },
                { context: "上六：系用微纆，置于丛棘，三岁不得，凶。【上六：把犯人用绳索捆紧，投入周围有丛棘的监狱中，三年不得释放，这是凶脸之事。】" },
            ],
        }, {
            title: "水山蹇39 -- 蹇，利西南，不利东北，利见大人，贞吉。【筮遇此卦，利西南行，不利东北行。利见贵族王公，获吉祥之兆。】",
            data: [
                { context: "初六：往蹇，来誉。【初六：出门艰难，归来安适。】" },
                { context: "六二：王臣蹇蹇，匪躬之故。【六二：王臣之所以屡犯艰难，并不是为自身私利。】" },
                { context: "九三：往蹇，来反。【九三：出门困难重重，归来笑逐颜开。】" },
                { context: "六四：往蹇，来连。【六四：出门步履艰难，归来时却有车可乘。】" },
                { context: "九五：大蹇，朋来。【九五：经历了很多艰难困苦，终予获得大利。】" },
                { context: "上六：往蹇，来硕，吉。利见大人。【上六：出门困难重重，归来欢喜跳跃。筮遇此爻，吉利，利于会见贵族王公。】" },
            ],
        }, {
            title: "水地比08 -- 比，吉。原筮，元永贞，无咎。不宁方来，后夫凶。【吉利。同时再卜筮，仍然大吉大利。卜问长时期的吉凶，也没有灾祸。不愿臣服的邦国来朝，迟迟不来者有难。】",
            data: [
                { context: "初六：有孚比之，无咎。有孚盈缶，终来有它，吉。【初六；捕获俘虏，安抚他们，没有灾难。捕获俘虏，满盆满罐的酒饭招待他们。虽然可能有意外之患，但最后是吉利的。】" },
                { context: "六二：比之自内，贞吉。【六二：内部和睦团结，卜闻得吉兆。】" },
                { context: "六三：比之匪人。【六三：跟败类狼狈为奸。】" },
                { context: "六四：外比之，贞吉。【六四：跟外邦联盟亲善，卜问得吉兆。】" },
                { context: "九五：显比，王用三驱，失前禽。邑人不诫，吉。【九五：普遍的和洽。君王采用三面包围的方法狩猎，网开一面，有意放走逃奔的野兽。老百姓对君王狩猎毫不惊惧。筮遇此爻吉利。】" },
                { context: "上六：比之无首，凶。【六：小人朋比为奸，勾心斗角，无法形成一个团结的中心，这是非常危险的事。】" },
            ],
        }, {
            title: "山天大畜 -- 大畜，利贞。不家食、吉。利涉大川。【利贞。不家食②，吉。利涉大川。】",
            data: [
                { context: "初九：有厉，利已。【初九：将有危险，祭祀鬼神则能化凶为吉。】" },
                { context: "九二：舆说輹。【九二：车辐脱落，车轮坏了。】" },
                { context: "九三：良马逐，利艰贞。曰闲舆卫，利有攸往。【九三：良马交配。占问艰难之事吉利。每天练习防卫性车战。有所往则有利。】" },
                { context: "六四：童牛之捁，元吉。【六四：将木棒横缚在好斗公牛的犄角上。筮遇此爻，大吉大利。】" },
                { context: "六五： 豮豕之牙，吉。【六五：将好奔突的大猪圈起来，吉利。】" },
                { context: "上九：何天之衢，亨。【上九：得到上天的福佑，大吉大利。】" },
            ],
        }, {
            title: "山泽损41 -- 损，有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。【筮遇此卦，将有所俘获，大吉大利，没有灾难，是称心的卜问。而且所往将获利。将有人送来两盆食物，可享口福。】",
            data: [
                { context: "初九：巳事端往，无咎；酌损之。【初九：祭祀大事，得赶快去参加，这才不会有灾难。祭品过丰，可以酌情减损。】" },
                { context: "九二：利贞，征凶，弗损，益之。【九二：吉利的卜问。征伐他国则凶。因为这样作对于他国非但不能损伤，反而有利。】" },
                { context: "六三：三人行则损一人，一人行则得其友。【六三：三人同行，难免意见分岐，必有一人被孤立。一人独行，孤单无助，则主动邀人作伴。】" },
                { context: "六四：换其疾，使遄有喜，无咎。【六四：要消除疾病，赶快求巫祭神，病就会有好转，必无灾难。】" },
                { context: "六五：或益之十朋之龟，弗克违，元吉。【六五：有人送给他价值十朋的大龟，这不能拒而不收，得龟用于占卜这是大吉之事。】" },
                { context: "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。【上九：不要减损，不要增益，一任其旧，没有灾难，卜问得吉兆。筮遇此爻，有所往则必获利，将得到一单身奴隶。】" },
            ],
        }, {
            title: "山火贲22 -- 贲，亨，小利有攸往。【通达。有所往则有小利。】",
            data: [
                { context: "初九：贲其趾，舍车而徒。【初九：脚穿花鞋，舍车不乘，徒步而行。】" },
                { context: "六二：贲其须。【六二：修饰自己的胡须。】" },
                { context: "九三：贲如濡如，永贞吉。【九三：奔跑向前，汗流浃背。卜问长时期的凶吉而得吉兆。】" },
                { context: "六四：贲如皤如，白马翰如，匪寇婚媾。【六四：奔跑气吁吁，太阳火辣辣。高头白马，向前飞奔。不是来抢劫，而是来娶亲。】" },
                { context: "六五：贲于丘园，束帛戈戈，吝，终吉。【六五：奔向丘园，送上许多布帛，初遇困难，终则顺利。】" },
                { context: "上九：白贲，无吝。【上九：送上白底饰以诸色花纹的布帛，不会坏事。】" },
            ],
        }, {
            title: "山雷颐27 -- 颐，贞吉。观颐，自求口实。【占卜得吉兆。研究颐养之道，在于自食其力。】",
            data: [
                { context: "初九：舍尔灵龟，观我朵颐，凶。【初九：自己储藏着大量的财宝，还要羡嫉人家的财物，必遭凶险之事。】" },
                { context: "六二：颠颐，拂经，于丘颐，征凶。【六二：为了餬口，就得在山坡上开荒种地。为了生计而去抢劫别人，这是凶险之事。】" },
                { context: "六三：拂颐，贞凶，十年勿用，无莜利。【六三：违背养生正道，靠歪门邪道过活，占问得凶兆。十年都得倒霉，永无好处。】" },
                { context: "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。【六四：所求不过餬口，害人之心不可存，吉利。虎视眈眈，防人之心不可无。这样就可以安享天年，悠然自得，无灾祸。】" },
                { context: "六五：拂经，居贞，吉，不可涉大川。【六五：开荒种地，平居度日，占问得吉兆。筮遇此爻，不可涉水渡河。】" },
                { context: "上九：由颐，厉，吉，利涉大川。【上九：遵循生活正道，先艰难而终吉利。筮遇此爻，有利于涉水渡河。】" },
            ],
        }, {
            title: "山风蛊18 -- 蛊，元亨，利涉大川，先甲三日，后甲三日。【大吉大利。利于涉水渡河，但须在甲前三日之辛日与甲后三日之丁日启程。】",
            data: [
                { context: "初六：干父之蛊，有子，考无咎。厉，终吉。【初六：继承父业，有一个孝顺的儿子，固然没有灾害，即使遇到危险，最后乃吉利。】" },
                { context: "九二：干母之蛊，不可贞。【九二：继承母业，则吉凶不可卜问。】" },
                { context: "九三：干父之蛊，小有悔，无大咎。【九三：继承父业，即使稍有过错，也不会出大问题。】" },
                { context: "六四：裕父之蛊，往见吝。【六四：光大父业，施行起来困难重重。】" },
                { context: "六五：干父之蛊，用誉。【六五：继承父业，博得了赞誉。】" },
                { context: "上九：不事王侯，高尚其事。【上九：不服务于王侯，因为其人看重自身价值。】" },
            ],
        }, {
            title: "山水蒙04 -- 蒙，亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。【通泰。不是我有求于幼稚愚昧的人，而是幼稚愚昧的人有求于我。第一次占筮，神灵告诉了他。轻慢不敬的再三占筮，轻慢不敬的占筮，神灵就不会告诉他。但还是吉利的卜问。】",
            data: [
                { context: "初六：发蒙，利用刑人，用说桎梏，以往吝。【初六：伐山垦荒，可以利用服罪的犯人。因为解除他们的桎梏前往，结果招来灾难。】" },
                { context: "九二：包蒙吉，纳妇吉，子克家。【九二：包捆割倒的荒草。这是吉兆。筮遇此爻，娶迎妻子，吉利。男女能相配成家。】" },
                { context: "六三：勿用取女，见金夫，不有躬，无攸利。【六三：不要抢劫女子为婚，会遭到武装者的抵抗，丢掉性命，没有什么好处。】" },
                { context: "六四：困蒙，吝。【六四：困怠子伐山垦荒，将遇险。】" },
                { context: "六五：童蒙，吉。【六五：砍伐山木，吉利。】" },
                { context: "上九：击蒙。不利，为寇；利，御寇。【上九：割草伐木。筮遇此爻，不利于充当盗寇，而有利于防御盗寇。】" },
            ],
        }, {
            title: "艮为山 -- 艮其背，不获其身，行其庭，不见其人，无咎。【卸掉责任，挂笏隐退，朝列之中已看不到他的身影，在他的庭院中寻找，也没有找到。其人远走高飞，自无灾祸。】",
            data: [
                { context: "初六：艮其趾，无咎，利永贞。【初六：歇脚养息，不要轻举妄动，自然无灾难，这是长期吉利的贞兆。】" },
                { context: "六二：艮其腓，不拯其随，其心不快。【六二：停立不行，但腿部肌肉还是负伤。心里很不愉快。】" },
                { context: "九三：艮其限，列其夤，厉熏心。【九三：卸掉重担，保护腰部，但是胁间肉却已裂开了，引退不及时，则罹凶险。这是由于为名利所惑，不能迅速引退卸职所招致的灾祸。】" },
                { context: "六四：艮其身，无咎。【六四：引退保身，没有灾祸。】" },
                { context: "六五：艮其辅，言有序，悔亡。【六五：闭口少言，讲话有分寸，自然没有悔恨。】" },
                { context: "上九：敦艮，吉。【上九：注意保护自己的脑袋，首级不失，自然吉利。】" },
            ],
        }, {
            title: "山地剥23 -- 剥，不利有攸往。【有所往则不利。】",
            data: [
                { context: "初六：剥床以足，蔑贞，凶。【初六：床足脱落。无须占问，这是凶险之象。】" },
                { context: "六二：剥床以辨，蔑贞，凶。【六二：床板脱落。无须占问，这是凶险之象。】" },
                { context: "六三：剥之，无吝。【六三：割取邻国邻邑的土地人民，可以无灾祸。】" },
                { context: "六四：剥床以肤，凶。【六四：剥取床上的垫席，这是凶险之象。】" },
                { context: "六五：贯鱼以宫人宠，无不利。【六五：宫人依次当夕受宠，无所不利。】" },
                { context: "上九：硕果不食，君子得舆，小人剥庐。【上九：劳者不得食，不劳者得食；君子乘坐华丽的车子，小人的草屋不蔽风雨。】" },
            ],
        }, {
            title: "地天泰11 -- 泰，小往大来，吉，亨。【由小而大，由微而盛，吉利，亨通。 】",
            data: [
                { context: "初九：拔茅茹以其汇，征吉。【初九：连根拨掉茅草，及其同类。征伐敌人，吉利。】" },
                { context: "九二：包荒，用冯河。不遐遗，朋亡，得尚于中行。【九二：用挖空的瓠瓜绑在身上波河，不至于沉没。钱币丢失了，在半路上得到别人的帮助。】" },
                { context: "九三：无平不陂，无往不复。艰贞无咎，勿恤其孚，于食有福。【九三：平地终将变成坡地，离去必定复返。卜问艰难之事，爻象显示必能渡过难关，不要担心被人虏去，而且在饮食上尚有口福。】" },
                { context: "九四：六四：翩翩，不富以其邻，不戒以孚。或跃在渊，无咎。【六四：巧言欺人，将给邻邑带来灾难；不加警戒，即将遇难被虏。】" },
                { context: "六五：帝乙归妹以祉，元吉。【六五：殷帝乙嫁女于周文王，因而得福，大吉大利。】" },
                { context: "上六：城复于隍，勿用师，自邑告命。贞吝。【上六：城墙攻破倒塌在护城濠里。“停止进攻”，从邑中传来命令。卜问得不祥之兆。】" },
            ],
        }, {
            title: "地泽临19 -- 临，元亨，利贞。至于八月有凶。【大吉大利，吉利的卜问。到了八月，可能有凶险】",
            data: [
                { context: "初九：咸临，贞吉。【初九：以感化的政策治民。卜问得吉兆。】" },
                { context: "九二：咸临，吉，无不利。【九二：用温和的政策治民，吉利，无不吉利。】" },
                { context: "六三：甘临，无攸利，既忧之，无咎。【六三：用压服的政策治民，没有什么好处。如果有所忧悔，灾祸可以消除。】" },
                { context: "六四：至临，无咎。【六四：亲自理国治民，没有害处。】" },
                { context: "六五：知临，大君之宜，吉。【六五：以明智治民，得君王之体，自然吉利。】" },
                { context: "上六：敦临，吉，无咎。【上六：以敦厚之道治民，吉利，自然无灾祸。】" },
            ],
        }, {
            title: "地火明夷36 -- 明夷，利艰贞。【卜问艰难之事则利。】",
            data: [
                { context: "初九：明夷于飞，垂其翼，君子于行，三日不食，有攸往，主人有言。【初九：“鹈鹕在飞翔，停栖在沼畔。君子离家走，三日无食粮。”筮遇此爻，有所往，则必遭主人谴责。】" },
                { context: "六二：明夷,夷于左股，用拯马壮，吉。【六二：鹈鹕，鹈鹕，伤于左股，君子负伤，因马获救。吉利。】" },
                { context: "九三：明夷于南狩，得其大首，不可疾贞。【九三：在南方的猎区，拉弓射箭，获得一些大野兽。筮遇此爻，占问疾病则不利。】" },
                { context: "六四：入于左腹，获明夷之心，于出门庭。【六四：回到深隐之处吧！走出居室，进入社会，就感到环境的险恶，退隐的念头油然而生。】" },
                { context: "六五：箕子之明夷，利贞。【六五：殷亡后，箕子逃到东方邻国避难，卜问得吉兆。】" },
                { context: "上六：不明晦，初登于天，后入于地。【上六：阳光消失了，天黑了。太阳初升，君子进仕之象；太阳隐没，君子退隐之象。】" },
            ],
        }, {
            title: "地雷复24 -- 复，亨，出入无疾，朋来，无吝。反复其道，七日来复，利有攸往。【通泰。出门、居处均无疾病。有钱可赚而可以无灾祸。往返途中，七日可归。有所往则有所利。】",
            data: [
                { context: "初九：不远复，无祗悔，无吉。【初九：出外不远就返回，没有大的过失，大吉大利。】" },
                { context: "六二：休复，吉。【六二：圆满而归，吉利。】" },
                { context: "六三：频复，厉，无咎。【六三：愁眉苦脸地回来，是遇到了危险，知难而退可以无灾祸。】" },
                { context: "六四：中行独复。【六四：中途独自返回。】" },
                { context: "六五：敦复，无悔。【六五：经过考察，决定返回，可以无悔。】" },
                { context: "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年不克征。【上六：迷途难返，凶险，有灾祸。筮遇此爻，出兵打仗，终有大败，连累国君遭遇凶险，元气大伤，十年后还不能再举征伐。】" },
            ],
        }, {
            title: "地风升46 -- 升，元亨，用见大人，勿恤，南征吉。【非常亨通，有利于会见王公贵族，不用担忧。占得此爻，出征南方吉利。】",
            data: [
                { context: "初六：允升，大吉。【初六：前进发展，大吉大利。】" },
                { context: "九二：孚乃利用禴，无咎。【九二：春祭宜用俘虏作为人牲，则无灾祸。】" },
                { context: "九三：升虚邑。【九三：登临于建立在大丘之上的城邑。】" },
                { context: "六四：王用享于岐山，吉，无咎。【六四：周王在岐山祭祀鬼神。筮遇此爻，吉利，并无灾祸。】" },
                { context: "六五：贞吉，升阶。【六五：占得吉兆，所占之事将逐步发展。 】" },
                { context: "上六：冥升，利于不息之贞。【上六：深夜不眠，勤勉不息地工作则符合此吉兆。 】" },
            ],
        }, {
            title: "地水师07 -- 师，贞丈人。吉，无咎。【占问总指挥的军情，没有灾祸。】",
            data: [
                { context: "初六：师出以律，否藏凶。【初六：整军出战全凭纪律，不遵守纪律就会有凶险。】" },
                { context: "九二：在师中，吉，无咎。王三锡命。【九二：主帅身在军中指挥，吉利，没有灾难。君王三次颁命嘉奖。】" },
                { context: "六三：师或舆尸，凶。【六三：军队出征，有人载尸而归，这是凶险之兆。】" },
                { context: "六四：师左次，无咎。【六四：军队在左边扎营，没有危险。】" },
                { context: "六五：田有禽，利执言，无吝。长子帅师，弟子舆尸，贞凶。【六五：打猎时获得猎物，作战中捕获俘虏，没有灾祸。长子指挥军队，次子战败阵亡，这是凶险的贞兆。】" },
                { context: "上六：大君有命，开国承家，小人勿用。【上六：国君颁发命令，有人被封为诸侯，享有封国，有人被封为大夫，享有采邑。但是不要重用无才无德的小人。】" },
            ],
        }, {
            title: "地山谦15 -- 谦，亨，君子有终。【通泰。筮遇此卦，君子将有所成就。】",
            data: [
                { context: "初六：谦谦君子，用涉大川，吉。【初六：谦让，再谦让，这才是君子的风度。具有这种品德，即使冒险涉水过河，也是吉利的。】" },
                { context: "六二：鸣谦，贞吉。【六二：明智而谦让，卜问得吉兆。】" },
                { context: "九三：劳谦，君子有终，吉。【九三：勤劳而谦让，这样的人将有好结果，凡事吉利。】" },
                { context: "六四：无不利，撝谦。【六四：无所不利，只要奋勇直前而又谦虚谨慎。】" },
                { context: "六五：不富以其邻，利用侵伐，无不利。【六五：贫穷是由于敌国的侵掠，应该对之讨伐，无所不利。】" },
                { context: "上六：鸣谦，利用行师，征邑国。【上六：明智而谦让，出兵征伐邑国自然获胜。】" },
            ],
        }, {
            title: "坤为地 -- 坤，元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。【大吉大利。占问雌马得到吉兆。君子前去旅行，先迷失路途，后来找到主人，吉利。西南行获得财物，东北行丧失财物。占问定居，得到吉兆。 】",
            data: [
                { context: "初六：履霜，坚冰至。【初六：践踏着薄霜，可以推断坚厚的冰层快要冻结成了。 】" },
                { context: "六二：直方大，不习无不利。【六二：平直、方正、辽阔是大地的特点。即使前往陌生的地方，也没有什么不利的。】" },
                { context: "六三：含章可贞。或从王事，无成有终。【六三：战胜殷商。称心的占卜。有人服役于战争，没有取得战绩，但结局还是好的。 】" },
                { context: "六四：括囊，无咎、无誉。【六四：扎紧了口袋，如缄口不言，没有指责，也没有赞誉。】" },
                { context: "六五：黄裳元吉。【六五：黄色的裙裤，大吉大利。】" },
                { context: "上六：龙战于野，其血玄黄。【上六。龙在大地上争斗，血流遍野。】" },
                { context: "用六：利永贞。【用六：占问得长久的吉利。】" },
            ],
        },]
    }
    ]
}
data = [demo]

/**
 * 周易占卦
第一卦   乾为天 困龙得水之象
乾者，健也。刚健不曲，正中之谓。故有困龙得水之象。如同一条蛰龙久困渊中不得舒展，忽然天降大雨得雷鸣而起任意飞腾。占次卦者时来运转之兆也。
象曰：困龙得雨好运交，不由喜气上眉梢。一切谋望皆如意，向后时运渐渐高。
诗曰：大吉之课，无不欢乐。上人见喜，诸事不错。
断曰：词讼和吉，病人全愈。功名有成，求谋大吉。

第二卦   天风姤 他乡遇友之象
姤者，遇也。不期而遇，故友乡遇友之象。乃是一行人久困在外，举目无亲，偶遇一友相亲相爱甚是得意。占次卦者时来运转之兆也。
象曰：他乡遇友喜气欢，须知运气福重添，自令交了顺当运，向后保管不相干。
诗曰：交易有成，官事有理。走失可寻，出门见喜。
断曰：功名有成，家宅平安，占病无妨。

第三卦   天山遁 浓云蔽日之象
遁者，避也。退避不出，故有浓云蔽日之象。夫浓云蔽日者，如同太阳正当晌午时节，天下照耀，忽然来了一块浓云遮蔽其光，占此卦者，谋事不遂之兆也。
象曰：浓云蔽日不光明，劝君且莫远出行。婚姻求财皆不吉，提防口舌到门庭。
诗曰：月令不喜，走失难见。交易合伙，诸事平淡。
断曰：占病不安，讼事见官。功名慢成，事不遂心。

第四卦   天地否 虎落陷坑之象
否者，塞也。闭塞不通，故有虎落陷之象。夫虎落陷坑者，如同一只猛虎下山寻食，不料被人掘下陷坑诓虎下去，纵有威风不能伸展。占此卦者凶多吉少之兆也。
象曰：虎落陷坑不堪言，进前容易退后难。谋望不遂自己便，疾病口舌是牵连。
诗曰：走失难寻，交易不定。婚姻合伙，不可轻动。
断曰：占财可成，贵人远行。出门不宜，事事晚成。

第五卦   风地观 旱蓬逢河之象
观者，观也。人借观望，故有旱蓬逢河之象。乃是一池莲花正当天旱之时，池干花渴全不滋润。忽然天降大雨，河水流来，其花又得茂盛。占 卦者主贵人扶持之象。
象曰：卦遇蓬花旱逢河，生意买卖利息多。婚姻自有人来助，出门永不受折磨。
诗曰：走失得见，口舌消散。疾病借除，月令真喜。
断曰：占讼得利，占病即愈，占信得见，谋事得意。

第六卦   山地剥 鹰鹊同林之象
剥者，落也。阴腾阳落，故有鹰鹊同林之象。此乃一小鹊天晚投宿大林之中，遇鹰在内，不想鹰见鹊即生恶意。占此卦者主小人琐碎干事无成之兆也。
象曰：鹊遇天晚宿林中，不知林内先有鹰。虽然同处心生恶，卦若逢之事非轻。
诗曰：鹰鹊同林不相合，占卜逢之琐碎多。恩人无义反为恶，是非平地起风波。
断曰：先难后易，谋事不利。交遇节令，忧愁变喜。


第七卦   火地晋 锄地得金之象
晋者，进也。露出地上，故有锄地得金之象。夫锄地得金者，乃是易农夫锄地抱陇甚是劳苦。一日锄地锄出金来甚是得意。占此卦者时来运转之兆也。
象曰：锄地锄去苗里草，谁想财帛将人找。一锄锄出金子来，这个运气真算好。
诗曰：锄地得金卦如何，占者逢之喜气多。谋望求借有意，运转时来处处合。
断曰：进退两难，不敢强辩。拨云见日，该你出现。

第八卦   火天大有 砍树莫雀之象
大有者，宽也。大中而上不应之，故有砍树摸雀之兆也。乃是一人遇见树上一窝黄雀有心上去摸之，恐其恍惚，随即将树砍倒拿稳的。占此卦者，做事稳当之兆也。
象曰：砍树摸雀做牢，是非口舌自然消。婚姻合伙不费力，若问走失未见逃。
诗曰：此卦占之好处多，砍树摸雀是稳妥，稳稳当当得到手，别人空看摸不着。
断曰：恍惚不做，拿稳下手。君求名利，到处自有。

第九卦   坎为水 水底捞月之象
坎者，陷也。于重险无功也。故有水底捞月之象。乃是一轮明月照入水中甚是真切。来了一人只当是元宝就要下水去捞，如何捞得着。占此卦者，劳而无功之兆也。
象曰：一轮明月照水中，只见影儿不见踪，愚夫当财下去取，摸来摸去一场空。
诗曰：水底明月不可捞，占者逢之运不高。交易出行难获利，走失行人无音耗。
断曰：求名不遂，疾病未愈。婚姻无成，合伙不利。

第十卦   水泽节 斩将封神之象
节者，有限而止也。故有斩将封神之象。夫斩将封神者，乃是姜太公灭纣之后，在万风山封神，一切亡魂尽赴台前，俱各受封得位。占次此者，百无禁忌之兆也。
象曰：时来运转喜气生，登台封神姜太公。到此诸神皆退位，纵然有祸不为凶。
诗曰：太公封神不非凡，谋望求财稳如山。交易合伙大吉庆，疾病口舌消除安。
断曰：月令高强，声名大扬。走失有信，官事无妨。

第十一卦  水雷屯 乱丝无头之象
屯者，物始生而未遇也。故有乱丝无头之象。乃是一机户在室外织丝，忽然狂风骤起将丝刮乱，左撕右扯找不出头来。占此卦者，颠倒错乱之象。
象曰：风刮乱丝不见头，颠三倒四犯忧愁。慢从（款）来左顺绪，急促反惹不自由。
诗曰：乱丝无头事难择，逢着闲事且暂推，交易出行无好处，谋望求财心不遂。
断曰：疾病未好，婚姻不巧。口舌琐事，做事颠倒。

第十二卦  水火既济 金榜提名之象
既济者，既成之事也。故有金榜提名之象。夫金榜提名者，乃是一应试之人上京应试，考罢三场，忽然金榜提名，甚是得意有趣。占此卦者吉庆如意之兆也。
象曰：金榜之上提姓名，不负当年苦用功。人逢此卦多吉庆，一切谋望大亨通。
诗曰：金榜提名喜气新，十人遇着九遂心，你今交了顺当运，步步登科有高升。
断曰：月令既喜，寻人得见，走失能找，口舌消散。

第十三卦  泽火革 旱苗得雨之象
革者，变革也。凶变为吉，故有旱苗得雨之象。乃是春苗久旱而无雨，则苗枯也，幸得天公作云，沛然下雨，则苗勃然而旺。占此卦者，时来运转之兆也。
象曰：苗逢旱天渐渐衰，幸得天恩降雨来。忧去喜来能变化，求谋干事遂心怀。
诗曰：旱苗得雨茂堂堂，交易求财也相当。婚姻合伙借如意，官司疾病两无妨。
断曰：出行大吉，走失能找，行人来信，百般凑巧。

第十四卦  雷火丰  古镜重明之象
丰者，大也。以明而动，故有古镜重明之象。夫古镜重明者，似一多年古镜日久不甚光明，忽然遇一匠人重磨明又极光亮。占此卦者，时来运转之兆也。
象曰：古镜昏暗好几年，一朝磨明似月圆，君子谋事逢此卦，时来运转喜自然。
诗曰：古镜重明甚光显，主人目下运气转，婚姻求财多吉庆，走失行人去不远。
断曰：出行有意，交易得魁，疾病渐好，求名必遂。

第十五卦  地火明夷 过河拆桥之象
夷者，伤也。明而见伤，故有过河拆桥之象。夫过河拆桥者，如与人共同修桥渡河，谁想合伙人先过后立即将桥拆除使另一合伙人能前行。占此卦者主临事难为不顺之兆也。
象曰：时乖运拙走不着，急忙过河拆了桥。恩人无义反为怨，凡事无功枉受劳。
诗曰：过河拆桥事堪伤，交易出行有祸殃。谋望求财空费力，婚姻合伙不相当。
断曰：行人未至，头绪不准。口舌躲避，凡事当心。

第十六卦  地水师 马到成功之象
师者，兵众也。战无不克，故有马到成功之象。夫马到成功者，如同一将官奉命出征伐寇，力透重围，大获全胜。占此卦者，诸事成全之兆也。
象曰：将帅领旨去出征，骑着烈马拉硬弓，百步穿杨去的准，箭中金线喜气生。
诗曰：马到成功喜气扬，求名取利大吉昌。婚姻合伙无妨碍，交易出行也顺当。
断曰：疾病大好，走失能找，行人求信，百般凑巧。

第十七卦  艮为山  矬巴勾裘之象
艮者，止也。止于极而不进，故有矬巴勾裘之象。乃是一矬巴心想摘裘，急于寻树，不料到了树下，树高人矮干看却捞不着。占此卦者，主事巴竭不顺之兆也。
象曰：财帛常打心上走，可惜眼前难到手。不如意时且忽耐，逢着闲事休开口。
诗曰：矬巴勾裘难捞枝，交易行人不投机。谋望求财最费力，婚姻合伙总是虚。
断曰：好事济成罗，暂且勾不着，凡事须谨慎，交节自然和。

第十八卦  山火贲  喜气盈门之象
贲者，饰也。水物之有饰，故有喜气盈门之象，是周文王生有圣德又得圣姒氏以为之配。于是内而家齐，外而国治，三分天下有其二。占此卦者如意之兆也。
象曰：时来运转瑞气周，窈窕淑女君子求。钟鼓乐之大吉庆，占者逢之喜临头。
诗曰：课逢吉神在运中，纵有凶处不为凶。婚姻合伙渐渐好，生意财源日日增。
断曰：出行吉祥，安市无妨。失物得见，月令高强。

第十九卦  山天大畜  阵势得开之象
大畜者，所畜之聚也。故有阵势得开之象。乃是广成子在灯光阵遭困，即将翻天印祭起打烂群仙阵破开阵势。占此卦者，再无间隔相当之兆也。
象曰：忧愁常锁两眉尖，千头万绪挂心间。从今以后防开阵，任意行雨不相天。
诗曰：此卦占之带六合，疾病口舌渐渐磨，婚姻合伙皆如意，谋望求财无差说。
断曰：行人有信，出门大吉。交了好运，百世和顺。

第二十卦  山泽损  推车吊耳之象 
损者，减省也。损内益外，故有推车吊耳之象。夫推车吊耳者，如同一车夫推车下崖，不想下至中间吊下耳来，左右安插不着。占此卦者，主事费力之兆也。
象曰：时运不至费心多，比着推车受折磨。山路崎岖吊下耳，左插右安安不着。
诗曰：推车吊耳路难行，心中打算力不从，君子占此琐碎卦，纵无灾害也困穷。
断曰：时运不遂，莫要胡为，交节换月，自然夺魁。

第二十一卦 火泽暌 贩卖猪羊之象
暌者，乖异也。       故有贩卖猪羊之象。夫贩卖猪羊者，乃是姜太公不遇时，贩猪羊快，贩羊羊迟。猪羊齐贩，遇断宰杀。占此卦者，主事不遂心，弄巧反拙之兆也。
象曰：此卦占来运气乖，如同太公做买卖，贩猪羊快贩羊迟，猪羊齐贩断了宰。
诗曰：贩卖猪羊运不遂，卦占行人不见回，交易出行无好处，婚姻求财且莫为。
断曰：名不利，利不全，病不意，做事难。

第二十二卦 天泽履  凤鸣歧山之象
履者，礼也。有所蹑而未进，故凤鸣歧山之象。乃是凤凰祥瑞之鸟人不常见忽然鸣于歧山之上，遂出文王治世，事称圣德。占此卦者王国家祯之兆也。
象曰：凤凰落在西歧山，去鸣几声出圣贤，天降文王开基业，富贵荣华八百年。
诗曰：凤鸣歧山开四方，占者逢之大吉昌。走失行人有音信，生意合伙入财乡。
断曰：出行有益，求财必准。疾病皆除，谋事平稳。

第二十三卦 风泽中孚 行走薄冰之象
孚者，信也。故有行走薄冰之象。如同一人过河无桥，踏冰而走，不想走到中间其冰甚薄，心中惶恐。占此卦者，主当事从缓，不可急迫之兆也。
象曰：路上行人色匆匆，急忙无桥过薄冰，小心谨慎过得去，一步错了落水中。
诗曰：行人走冰怕冰薄，交易出行犯琢磨，婚姻合伙休大意，官司口舌须要和。
断曰：薄冰甚是险。行人都难禁君子占此卦，凡事要小心。

第二十四卦 风山渐  骏马除笼之象
渐者，进也。 以渐而进，故有骏马出笼之象。乃是一匹骏马被笼罩住甚是忧闷。忽然 有玩童误开笼门其马乘机而出，脱离灾难任意飞腾。占此卦者喜庆之兆也。
象曰：骏马幸得出笼中，脱离灾难显威风。一朝得意福力至，东西南北任意行。
诗曰：骏马出笼万里裎，交易出行大吉昌，寻人费力逃难好，官司疾病俱无妨。
断曰：合伙如意，迁移如心，买卖兴旺，求财十分。

第二十五卦 雷为震  金钟夜撞之象
震者，动也。震惊百里，故有金钟夜撞之象。乃是一口金钟深埋多时，忽然一日冲出重新高挂，半夜间敲钟一下声音响亮。占此卦者，诸事有成之兆也。
象曰：一口金钟在泥池，人人看了当玩石，忽然一日钟悬起，响亮一声天下知。
诗曰：占者逢之撞夜钟，时来运转响一声，谋望求财不费力，交易出行有大功。
断曰：求名称意，做事遂心。走失行人，自然有信。

第二十六卦 雷地豫  青龙得位之象
豫者，和乐也。人心和乐，故有青龙得位之象。乃是姜太公路遇龙须虎，力拔不出，方拜太公为师得了位。占此卦者，逢凶化吉之兆也。
象曰：太白桥下杏黄旗，收妖为徒归西歧。自此青龙得了位，一旦谋望百事宜。
诗曰：青龙得位吉重生，谋望求财事有成，婚姻出行无阻隔，是非口舌得安宁。
断曰：交易有成，行人即归，头向可就，合伙无妨。

第二十七卦 雷水解  五关脱难之象
解者，难之散也。遇难即解，故有五关脱难之象。夫五关脱难者，即是黄飞虎路过五关被俘，幸得哪吒相求，方得出关。占此卦者，有祸不成之兆也。
象曰：目下月令如过关，千辛万苦受熬煎。时来恰遇有人求，任意所为不相干。
诗曰：五关脱难运抬头，劝君须当把财求。交易出行有人助，疾病口舌不须愁。
断曰：婚姻大好，行人来早。谋望成全，诸事凑巧。

第二十八卦 雷风恒  鱼来撞网之象
恒者，久也。久于其道，故有鱼来撞网之象也。如一渔翁心想拿鱼。到了河边撒下网去。其鱼自投网中，渔翁收网甚是喜欢。占此卦者，百事如意之兆也。
象曰：渔翁寻鱼运气好，鱼来撞网跑不了。别人使本挣不来，谁想一到久凑巧。
诗曰：鱼来撞网乐自然，卦占行人不久还。交易婚姻两成就，谋望求财不费难。
断曰：出行凑巧，有病即好。虽有口舌，自然消了。

第二十九卦 地风升  指日高升之象
升者，进也，又上也。似乎升晋，故有指日高升之象。乃是一官员夜梦红日东升，醒来即有圣旨降临，加官增职高升三级。占此卦者，时来运转，发福生财，吉人扶持之兆也。
象曰：士人来占必得名，生意买卖也兴隆。匠艺逢之交易好，农间庄稼亦收成。
诗曰：指日高升气象新，走失行人有信音。功名出行遂心好，疾病口舌皆除根。
断曰：求财到手，谋望有成。寻人得见，加宅安宁。

第三十卦   水风井  枯井生泉之象
井者，静也，又通也。水从穴出，故有枯井生泉之象。如同一井枯久不汲，已经枯竭。不料重遭阴雨，泉从地出，细水能以长流。占此卦者，时来运转之兆也。
象曰：枯井破废已多年，一朝流泉出来鲜，资生济竭人称羡，时来运转喜自然。
诗曰：枯井生泉福禄加，声名意气大光华，以前虽是驳辂日，向后自然有发达。
断曰：精神渐爽，福禄日增。出入皆吉，百事通泰。

第三十一卦 泽风大过  夜梦金银之象
大过者，祸也。三阴不胜其重，故有夜梦金银之象。乃是一人思想求财，全不能得。一日夜梦许多金银，得了极易，醒来乃是无有。占此卦者，虚花之兆也。
象曰：夜晚梦里梦金银，醒来却不见一文，目下只宜求本分，思想终是空劳神。
诗曰：夜梦金银醒来空，求名求利大不通。婚姻难成交易散，走失行人未见踪。
断曰：月令不和，事做不着。凡事忍耐，休去琢磨。

第三十二卦 泽雷随  推车靠崖之象
随者，顺也。己能随物，物能随己，故有推车靠崖之象。乃是一人推车陷于泥中，费尽气力。忽然至崖前，行入干道，渐觉松缓。占此卦者，步步登高之兆也。
象曰：泥里步踏好几年，推车靠崖在眼前。目下就该再使力，爬上崖去发敕源。
诗曰：推车靠崖道路干，谋望求财不费难，婚姻出行无阻碍，疾病口舌得宁安。
断曰：苦极生荣，喜气盈盈，一切做事，大不离形。

第三十三卦 巽为风  孤舟得水之象
巽者，顺也。巽顺而入，故有孤舟得水之象。乃一孤舟落在砂滩之地，久不动转，忽然，大雨倾盆，河水涨溢，其船有得撑渡。占此卦者，困极生福之兆也。
象曰：一叶孤舟落砂滩，有篙无水进退难。时逢大雨江湖溢，不用费力任往还。
诗曰：孤舟得水离砂滩，出外行人早已还。是非口舌皆无碍，婚姻合伙更不差。
断曰：功名称意，求财得利。交易可成，疾病全愈。

第三十四卦 风天小畜  密云不雨之象
小畜者，以阴畜塞也。有气无质，故有密云不雨之象。如同天旱太甚，田苗枯槁，人皆望云盼雨。谁想密布其云而无沛然之雨。占此卦者，暂且忍耐之兆也。
象曰：苗逢旱天尽焦梢，谁想云浓雨不浇，农人仰面长吁气，是从款来莫心高。
诗曰：浓云密排下雨难，盼望行人不见还，交易出行空费力，婚姻求财是枉然。
断曰：月令中平，暂且从容，疾病口舌，交节安宁。

第三十五卦 风火家人  镜里观花之象
家人者，一家人同也。内外各失其真，故有镜里观花之象。乃一人对镜梳妆见有鲜花可爱，意欲摘取，向镜中取之不成。占此卦者，可望虚花之兆也。
象曰：一朵鲜花镜中开，看着极好取不来。劝君休把镜花恋，卦若逢之主可怪。
诗曰：镜里观花休认真，谋望求财不遂心。交易慢成婚姻合，走失行人无信音。
断曰：出行不遇，疾病不愈。求名无准，谋事不宜。

第三十六卦 风雷益  枯木开花之象
益者，增益也。有益无损，故有枯木开花之象。乃一枯朽之木久不发芽，小人见者常欲伐之，幸得天时运转，雨露滋润而能开花。占此卦者，闲极生荣之兆也。
象曰：时来运转吉气发，多年枯木又开花。枝叶重生多茂盛，几人见了几人夸。
诗曰：枯木开花渐渐荣，主人事业大兴隆。婚姻求财多吉庆，口舌疾病皆安宁。
断曰：交易有成，见官有理。走失可寻，出门见喜。

第三十七卦 天雷无妄  鸟被笼牢之象
无妄者。望灾也。不期而望而自至，故鸟被笼牢之象。乃一鹦哥飞落寻食，不料被人陷于笼中，虽然舌尖嘴巧，难以飞腾。占此卦者，主事不如意之兆也。
象曰：飞鸟失机落笼中，纵然奋飞不能腾。目下只宜守本份，妄想爬高万不能。
诗曰：鸟被笼牢难出头，占者逢之不自由，谋望求财难定准，疾病口舌犯忧愁。
断曰：出门不遇，合伙无利，婚姻走失，疾病不宜。

第三十八卦 火雷噬磕  饥人遇食之象
噬者，啮也。磕者，合也啮而合，故有饥人遇食之象。乃是一人三日不食，饥饿不能出门，偶遇富人携饭相赠得饱而起，渐渐兴旺。占此卦者，凑巧之兆也。
象曰：运拙如同身受饥，幸得送饭又遇食，适口充腹心欢喜，忧愁从此渐消移。
诗曰：饥人遇食喜重来，凡事称心惬人怀，疾病口舌消除散，生意合伙大发财。
断曰：见官有理，出门见喜，婚姻成全，诸事如意。

第三十九卦 山雷颐  渭水访贤之象
颐者，食也。口食物以自养，故有渭水访贤之象。乃是姜太公不得时，在渭水河边钓鱼，文王闻知亲来访请上车，载而归。加为尚父。占此卦者，否极泰来之兆也。
象曰：太公垂钓渭水河，手执丝竿忧愁多。时来又遇文王访，自此永不受折磨。
诗曰：文王访贤在渭滨，谋望求财皆遂心。交易出行都如意，疾病口舌可离身。
断曰：渭水访贤，大吉大利，占着此卦，好了运气。

第四十卦  山风蛊  推磨岔道之象
蛊者，坏也。极而有此事，故有推磨岔道之象。乃推磨岔道之人心甚忙乱，将磨扣绳反挂推磨，使磨推倒，推转不顺当。占此卦者，反巧弄拙之兆也。
象曰：卦中爻象如推磨，顺当为福反为祸。心中有益且迟迟，凡事尽从忙里错。
诗曰：推磨岔道运不济，疾病口舌犯忧虑，婚姻合伙心改变，谋望求财不着实。
断曰：出行无益，行人未回，走失难见，诸事莫为。

第四十一卦  离为火  天官赐福之象
离者，丽也。俭丽子贱，故有天官赐福之象。天官福禄之种在人运中，必然逢凶化吉，祸难呈祥，做事称心，无不如意。占此卦者，主有事成发福生财之兆也。
象曰：官长来占主高升，庄农人家产业增，生意买卖利也厚，匠艺占之大亨通。
诗曰：来人占卦遇官天，必然福禄降人间，一切谋望皆吉庆，忧愁尽去主平安。
断曰：月令皆喜，诸事通便，出门见喜，灾消病散。

第四十二卦  火山旅  宿鸟焚巢之象
旅者，覆也。客旅覆，故有宿鸟焚巢之象。乃是一飞鸟在树上垒窝安身，不料被小人举火焚巢。占此卦者，主做事常常无成之兆也。
象曰：飞鸟树上垒窝巢，小人使计举火烧。君占此卦为不吉，一切谋望在徒劳。
诗曰：宿鸟焚巢时运低，婚姻合伙病难医。交易有阻皆不利，官事口舌被人欺。
断曰：出行费力，行人未还，走失无信，求财也难。

第四十三卦 火风鼎  渔人得利之象
鼎者，烹饪之物也。烹以养贤，故有渔人得利之象。乃是一渔翁湖边寻鱼，望见鶑鴑蛤蜊，蛤蜊鶑鴑向前齐得，甚是得意。占此卦者一举两得之兆也。
象曰：鶑鴑蛤蜊落沙滩，蛤蜊鶑鴑两翅扇，渔翁进前双得利，走失行人即自还。
诗曰：渔翁得利喜自然，望名求财两周全。婚姻合伙双得利，卦若逢之喜气添。
断曰：出门有益，交易可成，官事不妨，生意兴隆。

第四十四卦  火水未济  太岁月建之象
未济者，事不成也。火水不交，故有太岁月建之象。乃是杨任奉命寻营，即有张奎旭夜行前来偷营劫寨，只得竭力巡访。占此卦者，主有小人坑害、内里生心之兆也。
象曰：离地着人几丈深，提防偷营劫寨人，后封太岁为凶煞，时加谨慎祸不侵。
诗曰：太岁入运事多愁，婚姻财帛莫强求，交易出行未见吉，走失行人不露头。
断曰：官讼不吉昌，口舌有灾殃。目下且忍耐，遇月保无妨。

第四十五卦  山水蒙  小鬼偷钱之象
蒙者，昧也。常昧不明，故有小鬼偷钱之象。如同命运一竭，全不宽快。遇有钱之时无任多少便不着数。就如小鬼偷钱一般。占此卦者，时运不祥之兆也。
象曰：卦中爻象犯小耗，君子占着运不高，婚姻合伙有琐碎，做事必然受苦劳。
诗曰：卦中气象犯小耗，谋望求财空过桥。婚姻合伙有人破，交易出行枉徒劳。
断曰：为人多丈义，挣钱不费力，有心学仔细，倒被鬼偷去。

第四十六卦  风水涣  隔河望金之象
涣者，散也。散而不聚，故有隔河望金之象。乃是一行人隔河望见金子一锭，意欲探取，无奈河宽水深，全不能过。纵有财帛也只能干看却不能到手。占此卦者，枉费徒劳之力也。
象曰：隔河望见一锭金，欲取河宽水又深，指望发财难到手，尽夜思想枉费心。
诗曰：财帛隔着一道河，岸宽水深摸不着，过日交节方吉利，目下不宜乱琢磨。
断曰：婚姻不济，合伙无利。交易出行，总不如意。

第四十七卦  天水讼  二人争路之象
讼者，辩论也。则有争执，故有二人争路之象。夫二人争路者，乃是一条小路甚是狭窄，过来二人相撞一处，俱要争先，皆不肯落后。占此卦者，事有不顺之兆也。
象曰：心中有事实难成，恰遇二人狭路逢，两人皆欲争先走，谁也不让争不停。
诗曰：二人争路皆不降，占者逢之少主张。交易出行有阻隔，生意合伙也平常。
断曰：目下不济，休生闲气，好事难成，求财费力。

第四十八卦  天火同人  仙人指路之象
同人者，与人亲也。同心同意，故有仙人指路之象。乃是一行人迷了路径，不知东西南北，正在忧闷之间，忽有仙人前来指引，遂即走上正路。占此卦者，无往而不利之兆也。
象曰：心中有事犯猜疑，谋望从前不着题，幸与明人来指引，诸般忧闷自消之。
诗曰：仙人指路过路通，劝君任意走西东。交易求财不费力，生意合伙也相通。
断曰：婚姻有成，行人归来，走失可见，做事无差。

第四十九卦  坤为地  饿虎得食之象
坤者，顺也。内外纯阴，其性柔顺，故有饿虎得食之象。乃是一只猛虎腹中饥饿，正要寻食，不料一肥羊失群迷路，恰遇饿虎，被食之。占此卦者，顺利也。
象曰：肥羊失群入山岗，饿虎逢之把口张，适口充饥心欢喜，卦若逢之大吉昌。
诗曰：饿虎得食喜气欢，求名应试主高迁，出门吉利行人到，是非口舌不相干。
断曰：寻人得见，走失有信，疾病渐好，凡事借顺。

第五十卦    地雷复  夫妻反目之象
昔日黄巢作反，命朱温搜营杀院，曾占此卦，果然杀院收妻，背旨脱逃，自为大梁王，就应了夫妻反目之象。
复者，反也。反复不定，故有夫妻反目之象。乃是姜子牙久不遇时，甚是穷窘，马氏不贤，常于争嚷。占此卦者， 同人不和，翻脸无情之兆也。
象曰：马氏太公不相和，世人占之忧疑多。恩人无义反为怨，是非平地起风波。
诗曰：夫妻反目不顺情，卦占谋望未有成。官司惊恐财帛散，若问家宅不安宁。
断曰：目下不吉，行事不利，交节换月，自然安息。

第五十一卦  第泽临  发政施仁之象
临者，上临下也。坤居地上，似临民之义，故有发政施仁之象。乃是商朝百姓被纣王暴虐。如在涂炭之中，忽见文王大行其政，重得安居。占此卦者，时运亨通之兆也。
象曰：君王无道民叫怨，常相拨云见日天，幸逢明主施仁政，重又安居乐自然。
诗曰：发政施仁志量高，出外求财任逍遥。交易婚姻大有益，走失行人有信捎。
断曰：口舌见官，疾病慢愈，求名称意，家宅平安。

第五十二卦  地天泰  喜报三元之象
泰者，通泰也。诸事通泰，故有喜报三元象。乃一考试之人考罢三场，专候揭晓，忽见人来报喜，甚觉得意。占此卦者，大吉大利之兆也。
象曰：学文满腹入场闱，三元及第得意一回，从今解去愁和闷，且喜平地一声雷。
诗曰：喜报三元运气强，谋望求事大吉祥。交易出行甚得意，是非口舌皆无妨。
断曰：婚姻慢成，行人即至，走失可寻，诸般称意。

第五十三卦  雷天大壮 工师得木之象
大壮者，志也。大壮利贞，故有工师得木之象。夫工师得木者，如同一个木匠，入山多时不做生活，忽然一日得一大木锯伐在地重做生活。占此卦者，运气抬头之兆也。
象曰：卦占工师得大木，跟前该着走上路，时来运转多顺当，有事只管放心做。
诗曰：工师得木喜重重，买卖求财大亨通。婚姻合伙皆如意，一切谋望皆有功。
断曰：出门吉利，口舌远避。疾病皆除，行人即至。

第五十四卦  泽天夬  游蜂脱网之象
夬者，决也。刚健而悦，故有游蜂脱网之象。乃是一群游蜂穿花过柳，误入蜘蛛网内，幸而大风经过，将网刮破，其蜂脱灾难任意飞腾。占此卦者，吉庆如意之兆也。
象曰：蜘蛛撒网赛天牢，粘住游蜂翅翎毛。幸遇天风吹破网，脱离灾难又逍遥。
诗曰：游蜂脱网喜无边，增财进口福禄添。外则通达内则顺，富贵荣华胜似前。
断曰：词讼了结，疾病除根。求财到手，做事遂心。

第五十五卦  水天需  明珠出土之象
需者，须也。待时而动，故有明珠出土之象。乃是一颗明珠尘埋日久，不甚光明，忽然被风将尘土吹去，明珠又得鲜明显出，见者无不珍爱。占此卦者，时运亨通之兆也。
象曰：明珠尘埋日久深，无光无亮到如今。忽然大风吹尘去，自然显露又重新。
诗曰：明珠出离尘埃来，口舌官事消散开。走失行人当见面，交易有成永无灾。
断曰：谋望有成，婚姻最合，求财如意，也喜动挪。

第五十六卦  水地比  船得顺风之象
比者，和也。相助相辅，故有船得顺风之象。乃是一艘粮船载重于浅水之中，全撑不动。忽然刮起顺风，船得撒棚而进全不费力。占此卦者，无往而不利之兆。
象曰：顺风行船撒起棚，上天相助一蓬风。不用费力逍遥去，任意而行大亨通。
诗曰：船得顺风任飘行，投向有准宜出行。交易求财大得利，一切谋望事有成。
断曰：走失可寻，见官有理。婚姻求名，保管恭喜。
第五十七卦  兑为泽   趁水和泥之象
兑者，悦也。临事而悦，故有趁水和泥之象。如同兴土修造，将要和泥，忧其水远。幸得天泽大雨，沟浍皆盈。趁水和泥，纯无费力。占此卦者，如意凑巧之兆也。
象曰：这个卦象真可取，                休要错过这机关，
诗曰：趁水调和泥更匀，投向有准宜出门，交易婚姻大有益，走失行人不用寻。
断曰：口舌消散，病遇良医。求财到手，谋事大吉。

第五十八卦  泽水困  撮抽杆梯之象
困者，困厄也。不能自振，故有撮抽杆梯之象。夫撮抽杆梯者，如同二人商议摸雀，已经撮上杆去，又把梯子抽了，心神恍惚，悬想不定。占此卦者，谋望不稳之兆也。
象曰：时运不来好伤怀，撮上杆去把梯抬。一个虫翼无到手，转了上去下不来。
诗曰：今有小人暗来欺，千方百计与商议，明明与来说好话，撮上杆去抽了梯。
断曰：当交君子，莫听小人。凡事谨慎，永不受贫。

第五十九卦  泽地萃  鲤鱼化龙之象
萃者，升聚也。万物萃聚，故有鲤鱼化龙之象。乃是一条鲤鱼被网惊走，游至龙门之下，急忙跳跃而过，身化为龙。占此卦者，飞龙在天，利见大人之兆也。
象曰：游鱼戏水被网惊，跳过龙门身化龙。三尺杨柳垂金线，万朵桃花显你能。
诗曰：鲤鱼化龙喜气来，口舌疾病身无灾。忧疑从今都消散，祸门闭来福门开。
断曰：鲤鱼化龙，喜事重重，求财到手，做事有成。

第六十卦    泽山咸  萌芽出土之象
咸者，交感也。天地感而万物出，故有萌芽出土之象。乃坡地青草当秋冬之时被牧童烧山。幸遇阳转春回，青草萌芽又能发生。占此卦者，时来运转之也。
象曰：运去黄金失色，时来棒棰发芽。月令极好无差，且喜心宽意达。
诗曰：脚踏棒  转悠悠，时运不来莫强求。幸得今日童点火，自有好事在后头。
断曰：谋望有成，出门可行。走失来信，疾病安宁。

第六十一卦  水山蹇  雨雪载途之象
蹇者，难也。足不进行走艰难，故有雨雪载途之象。乃是一出行人到了半路途中，先雨后雪，泥泞艰难，甚是费力。占此卦者，诸事缠绵，谋望不稳之兆也。
象曰：大雨倾地雪满天，路上行人苦又寒。拖泥带水费尽力，事不遂心且耐烦。
诗曰：雨雪载途甚泥泞，交易不定难出行。疾病抱拉婚姻慢，谋望求财事不成。
断曰：行人未至，投向不稳，南向缠绵，求名不准。

第六十二卦  地山谦  二人分金之象
谦者，逊让也。有而不居， 有二人分金之象。乃是两个穷人同乎患难，不分你我，倏然拾得金子一对，随即二人全不犯争。占此卦者，百事亨通之兆也。
象曰：天赐贫人一对金，不争不竞两平分。彼此分得金到手，一切谋望皆遂心。
诗曰：二人分金喜气和，谋望求财吉庆多。口舌渐消疾病少，走失行人归旧窝。
断曰：婚姻称意，出行得地。交易合伙，无不吉利。

第六十三卦  雷山小过  急过独桥之象
小过者，过也。阳过于阴，故有急过独桥之象。乃是一行人来至河边，过一独木桥，甚是迟疑，心恍落入水中，放心急过，却倒无一害。占此卦者，主进则有功，退则无益之兆也。
象曰：行人路过独木桥，内心惶恐眼发毛。爽利保你过的去，慢行一定不安牢。
诗曰：独木桥上步难行，主人心事不安宁。交易合伙宜  就，婚姻有成莫迟停。
断曰：求财到手，官事平常。目下不吉，交节自强。 

第六十四   雷泽归妹  缘木求鱼之象
归妹者，大也。少女从长男，阴阳不交，故有缘木求之鱼象。乃是一人思想拿鱼，不向水中去求，却向树上勾取，焉能得鱼。占此卦者，谋望不遂之兆也。
象曰：求鱼须当向水中，树上求之不顺情，受尽爬揭难遂意，劳而无功还平平。
诗曰：缘木求鱼事多难，虽不得鱼无后灾，若是行险弄巧地，事不遂心枉安排。
断曰：月令不好，做事颠倒。打算的多，遂心的少。
 */