let demo = {
    title: "春秋战国真有趣",
    name: "春秋战国真有趣",
    data: [{
        title: "刚柔并济的政治斗争",
        data: [
            { context: "‘郑伯克段于鄢’  -- 第一，段以下犯上，违反了孝悌之道、君臣之义，所以直呼其名，以示警诫；第二，寤生和段两兄弟相争，如同一国二君，分庭抗礼，所以用了“克”这个字；第三，称寤生为郑伯，而不按惯例称为郑庄公（寤生死后被谥为庄公），是讽刺他没有尽到兄长的责任——不但不教育弟弟，反而养成其恶——也说明他本来的动机就是想杀死弟弟；第四，不写段“出奔共”这部分史实，是因为如果写了，好像罪责全在段身上了，其实寤生同样有责任，只是不好下笔罢了。这就是所谓的春秋笔法，微言大义，每一句话甚至每一个字都有其特定的含义与价值判断；该写什么，不写什么，都有其深思熟虑。读史至此，喟然长叹，寤生固然歹毒，史官的笔触更毒！ " },
            { context: "PS：春秋左传中的微言大义  " },
            { context: "周朝的封建制度中，诸侯是有等级的，从高到低有“公、侯、伯、子、男”五等，世袭罔替。 " },
            { context: "说实话，这个理由非常牵强。但是，强权即公理，那些年间，郑庄公、齐僖公和鲁隐公这三人认为谁有罪，谁就必定有罪了，简直是毫不含糊。 " },
            { context: "林语堂曾经说，中国的哲人是这样一种人：“睁着一只眼，闭着一只眼，看穿了他周遭所发生的事情和他自己努力的徒然，可是还保留着充分的现实感去走完人生的道路。他很少幻灭，因为他没有虚幻的憧憬，很少失望，因为他从来没有怀着过度的希望。他的精神就是这样解放了的。” " },
            { context: "颖考叔的悲剧说明了两个道理：一是做人不能锋芒毕露，尤其是原本地位不高的人，即使有幸获居高位，也要坚持谦虚谨慎的态度，保持一颗平常心；二是千万不要得罪老板的亲戚，尤其是老板的小舅子之类 " },
            { context: "PS：不知道是否对，但是一个人的素质决定能走多高多远 " },
            { context: "周朝的封建制度中，诸侯是有等级的，从高到低有“公、侯、伯、子、男”五等，世袭罔替。 " },
            { context: "说实话，这个理由非常牵强。但是，强权即公理，那些年间，郑庄公、齐僖公和鲁隐公这三人认为谁有罪，谁就必定有罪了，简直是毫不含糊。 " },
            { context: "林语堂曾经说，中国的哲人是这样一种人：“睁着一只眼，闭着一只眼，看穿了他周遭所发生的事情和他自己努力的徒然，可是还保留着充分的现实感去走完人生的道路。他很少幻灭，因为他没有虚幻的憧憬，很少失望，因为他从来没有怀着过度的希望。他的精神就是这样解放了的。” " },
            { context: "颖考叔的悲剧说明了两个道理：一是做人不能锋芒毕露，尤其是原本地位不高的人，即使有幸获居高位，也要坚持谦虚谨慎的态度，保持一颗平常心；二是千万不要得罪老板的亲戚，尤其是老板的小舅子之类 " },
            { context: "PS: 不知道是否对，但是一个人的素质决定能走多高多远" },
        ]
    }, {
        title: "第2章新鲜血液的注入：外族崛起",
        data: [
            { context: "真可谓铁打的祭仲，流水的国君，这样算起来，他已经是郑国的六朝元老了。真不明白，郑国上上下下怎么就能容他翻手为云覆手为雨，把迎立国君当把戏呢？ " },
            { context: "荣格的共时性理论告诉我们，几件毫不相干的事如果在同一时空相遇，产生的效果往往是极其巨大的，以至于人们禁不住以为这些事情其实是冥冥之中已经注定。 " },
            { context: "PS：我觉得还挺有道理的 " },
            { context: "连妃为什么不得志？岂止她不得志，几乎后宫所有女人都不得志。前些年周天子郑重其事地将女儿王姬嫁给齐襄公做老婆，第二年也就郁郁而终了。这一切，都是因为那个从鲁国回来的文姜，她以酥风媚骨带给齐襄公无限美好的偷情感觉，成为了齐国后宫佳丽共同的噩梦。 " },
            { context: "我不能只站在现代人的立场上来评价古人的所作所为，比如徒人费的所作所为。一代人自有一代人的价值观，脱离历史背景来对他们评头论足等于是放马后炮，很有失公允。但我忍不住要说，徒人费，如果有来生，还是继续做奴才吧。 " },
            { context: "大夫雍廪发动政变，杀死了公孙无知和连、管二人。对于这件事，《春秋》的记载是：“齐人杀无知。”《左传》的记载是：“雍廪杀无知。”用的都是杀人的“杀”，而非弑君的“弑”。这就说明，当时的社会舆论并没有承认公孙无知政权的合法性。 " },
            { context: "《春秋》微言大义，对于遣词造句非常讲究。同样是死，有的人叫作“崩”，有的人叫作“薨”，有的人叫作“卒”；有的人本来应该“薨”，却因为丧礼没有办到位，变成了“卒”；有的人本来应该“崩”，却因为死得太早，变成了“薨”。 " },
            { context: "PS:再次感受春秋的微言大义，非历史外人能够理解的。 " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    },
    ]
}
data = [demo]







    
