let demo = {
    title: "春秋战国真有趣",
    name: "春秋战国真有趣",
    data: [{
        title: "刚柔并济的政治斗争",
        data: [
            { context: "‘郑伯克段于鄢’  -- 第一，段以下犯上，违反了孝悌之道、君臣之义，所以直呼其名，以示警诫；第二，寤生和段两兄弟相争，如同一国二君，分庭抗礼，所以用了“克”这个字；第三，称寤生为郑伯，而不按惯例称为郑庄公（寤生死后被谥为庄公），是讽刺他没有尽到兄长的责任——不但不教育弟弟，反而养成其恶——也说明他本来的动机就是想杀死弟弟；第四，不写段“出奔共”这部分史实，是因为如果写了，好像罪责全在段身上了，其实寤生同样有责任，只是不好下笔罢了。这就是所谓的春秋笔法，微言大义，每一句话甚至每一个字都有其特定的含义与价值判断；该写什么，不写什么，都有其深思熟虑。读史至此，喟然长叹，寤生固然歹毒，史官的笔触更毒！ " },
            { context: "PS：春秋左传中的微言大义  " },
            { context: "周朝的封建制度中，诸侯是有等级的，从高到低有“公、侯、伯、子、男”五等，世袭罔替。 " },
            { context: "说实话，这个理由非常牵强。但是，强权即公理，那些年间，郑庄公、齐僖公和鲁隐公这三人认为谁有罪，谁就必定有罪了，简直是毫不含糊。 " },
            { context: "林语堂曾经说，中国的哲人是这样一种人：“睁着一只眼，闭着一只眼，看穿了他周遭所发生的事情和他自己努力的徒然，可是还保留着充分的现实感去走完人生的道路。他很少幻灭，因为他没有虚幻的憧憬，很少失望，因为他从来没有怀着过度的希望。他的精神就是这样解放了的。” " },
            { context: "颖考叔的悲剧说明了两个道理：一是做人不能锋芒毕露，尤其是原本地位不高的人，即使有幸获居高位，也要坚持谦虚谨慎的态度，保持一颗平常心；二是千万不要得罪老板的亲戚，尤其是老板的小舅子之类 " },
            { context: "PS：不知道是否对，但是一个人的素质决定能走多高多远 " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
            { context: " " },
        ]
    }, {
        title: "第2章新鲜血液的注入：外族崛起",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    }, {
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },

        ]
    },
    ]
}
data = [demo]