let demo={
    title: "春秋战国真有趣",
    name: "春秋战国真有趣",
    data: [{
        title: "刚柔并济的政治斗争",
        data: [
            { context: "‘郑伯克段于鄢’  -- 第一，段以下犯上，违反了孝悌之道、君臣之义，所以直呼其名，以示警诫；第二，寤生和段两兄弟相争，如同一国二君，分庭抗礼，所以用了“克”这个字；第三，称寤生为郑伯，而不按惯例称为郑庄公（寤生死后被谥为庄公），是讽刺他没有尽到兄长的责任——不但不教育弟弟，反而养成其恶——也说明他本来的动机就是想杀死弟弟；第四，不写段“出奔共”这部分史实，是因为如果写了，好像罪责全在段身上了，其实寤生同样有责任，只是不好下笔罢了。这就是所谓的春秋笔法，微言大义，每一句话甚至每一个字都有其特定的含义与价值判断；该写什么，不写什么，都有其深思熟虑。读史至此，喟然长叹，寤生固然歹毒，史官的笔触更毒！ " },
           { context: "PS：春秋左传中的微言大义  " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
           { context: " " },
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },{
        title: "刚柔并济的政治斗争",
        data: [
            { context: " " },
           
        ]
    },
    ]
}
data = [demo]