var demo = {
    title: "梅花易数",
    name: "梅花易数",
    data: [{
        title: "卷一基础",
        data: [
            { context: "1.周易卦象：乾(☰)一，兑(☱)二，离(☲)三，震(☳)四，巽(☴)五，坎(☵)六，艮(☶)七，坤(☷)八" },
            { context: "8.八卦象例：乾三连 坤六断 震仰盂 艮覆碗 离中虚 坎中满 兑上缺 巽下断 " },
            { context: "2.五行生克：金生水，水生木，木生火，火生土，土生金。金克木，木克土，土克水，水克火，火克金。" },
            { context: "3.八宫所属五行：乾兑金，坤艮土，震巽木，坎水，离火。" },
            { context: "3.八宫所属方位：乾宫位居西北，属金；兑宫位居西方，属金；坤宫位居西南。属土；艮宫位居东北，属土；震宫位居东方，属木；巽宫位居东南，属木；坎宫位于正北，属水；离宫位于正南，属火。 " },
            { context: "4.卦气旺：震，巽木旺于春；离火旺于夏；乾兑金旺于秋；坎水旺于冬；坤艮土旺于辰戌丑未月（即三月，六月，九月，十二月）。" },
            { context: "5.卦气衰： 春坤，艮；夏乾，兑；秋震，巽；冬离；辰戌丑未坎。" },
            { context: "6.十天干：甲，乙东方木。丙，丁南方火。戊，己中央土。庚，辛西方金。壬，癸北方水。" },
            { context: "阳干：甲，丙，戊，庚，壬。阴干：乙，丁。己，辛，癸。" },
            { context: "7.十二地支：子水鼠，丑土牛，寅木虎，卯木兔，辰土龙，巳火蛇，午火马，未土羊，申金猴，酉金鸡，戌土犬，亥水猪。" },
            { context: "阳支：子，寅，辰，午，申，戌。阴支：丑，卯，巳，未，酉，亥。" },
            { context: "9.占法：《易》中秘密穷天地，造化天机泄未然；中有神明司祸福，从来切莫教轻传。" },
            { context: "10.玩法：    一物从来有一身，一身还有一乾坤；能知百事备于我，肯把三才别立根。天向一中分造化，人于心上起经纶；仙人亦有两般话，道不虚传只在人。" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
        ]
    }
    ]
}
data = [demo]
