let demo = {
    title: "特别关注整理",
    name: "特别关注整理",
    data: [{
        title: "特别关注202005",
        data: [
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
            { context: "" },
        ]
    },{
        title: "特别关注202004",
        data: [
            { context: "年轻时依靠结晶获取的每一分钱，都会在你今后的人生里加倍奉还，上帝永远是公平的。" },
            { context: "朋友圈不会告诉你人生真相。" },
            { context: "投硬币，想扔第二次的时候，其实就已经知道答案了" },
            { context: "很多人问，为什么看历史，很多人回答，以史为鉴。现在我来告诉你，以史为鉴，是不可能的。因为我发现，其实历史没有变化，技术变了，衣服变了，饮食变了，这都是外壳，里面什么都没有变化，还是几千年前那一套，转来转去，该犯的错误还是要犯，该杀的人还是要杀，岳飞会死，袁崇焕会死，再过一千年，还是会死。所有发生的，是因为它有发生的理由，能超越历史的人，才叫以史为鉴，然而我们终究不能超越，因为我们自己的欲望和弱点。所有的错误，我们都知道，然而终究改不掉。能改的，叫做缺点，不能改的，叫做弱点。顺便说下，能超越历史的人，还是有的，我们管这种人，叫做圣人。" },
            { context: "如果有效就坚持到底，哪怕它不再流行。" },
            { context: "最关心的部分悄然改变，不在关注看到的事物，转而观察本该出现缺没有出现的事物；不在关注发生了事情，转而思考本该发生却没能发生的事情" },
            { context: "教练的本质，是帮助我们改变心智模式和挖掘潜能的一门技术，所以教练员并不需要在技术层面比运动员懂得更多。" },
            { context: "三种象征物来形容教练，第一，教练是镜子，镜子不会给你评语，不会告诉你答案，第二，教练是指南针，有了指南针，我们就不会迷路；第三，教练是催化剂，会加速我们的成长但并不会改变我们的成分，也不会参与我们的化学反应。" },
            { context: "从今天开始，想一想你定下的目标，以及你完成后能带你什么样的美好回报。想的越具体，越清晰，越激动人心，你就越有坚持下去的动力。" },
            { context: "只有崇拜别人、自己才能进步，不要谷歌都装作顶天立地的，自己什么也不是，凭什么高大起来啊？" },
            { context: "古语云：玉不琢不成器。穷其一生，我们能遇到几位用心雕琢璞玉的老师呢？不要因为老师的责备而选择怨恨，也许老师恰恰是在用这种方式来成就你。" },
            { context: "读不懂的书就不去读了，看不清的人心就不去看了，解释不清的武会就不解释了，说不出口的心事就不说了。" },
            { context: "当你给别人铺路的时候，你实际上也在左右他的前进方向。" },
            { context: "事后论人，局外论人，是学者大病。事后论人，每将知人说的极愚；局外论人，每将难事说的极易。" },
            { context: "推迟满足感、承担责任、尊重事实、保持平衡。   ----所谓自律" },
            { context: "一定要小心挑选敌人，因为你会发现，你和敌人变得越来越像。" },
        ]
    },{
        title: "特别关注202003",
        data: [
            { context: "无论做什么事情，如果一开始你选择了偷懒，之后就会有很多麻烦；如果一开始你选择了用心，到后面会越来越容易。" },
            { context: "性痴则志凝，故书痴者文必恭，艺痴者技必良，世之落魄而无成者，皆自谓不痴也。以是慧黠而过，乃是真痴。" },
            { context: "手机拿走了所有人的无聊，也顺便把与无聊有关的伟大创造拿走了" },
            { context: "中国太重视学习有用的东西了，我们都是为了每个结果去学，遇事我们会迅速地上升，但是，一单你学的东西被淘汰了，你马上变成了无用的人" },
            { context: "‘引用资料证明自己的观点正确’跟‘抄袭资料当做自己的观点’有着本质的区别。" },
            { context: "欲成大树，莫于草争" },
            { context: "破坏安谧的生活，总是先从破坏淡薄的心境开始。" },
            { context: "既然上了生活的贼船，那就做一个快乐的海盗。" },
            { context: "痛苦是人生的经验，而受苦是你给他贴的标签。" },
            { context: "从艺术家的眼光来看，华丽鲜艳并不一定意味着美，色彩调和，赏心悦目，才能给人以美的感受。" },
            { context: "一块给狗的骨头不是慈善，一块与够分享的骨头才是慈善。" },
            { context: "所谓强者，是既有意志，又能等待时机的人。" },
            { context: "当人能在神身上看到人性的时候，人才有可能在自己身上看到神性。" },
            { context: "" },
            { context: "" },
        ]
    },
]}