// [常用的一些]
// 沉鱼落雁。闭月羞花。倾城倾国。  国色天香。手如柔荑。肤如凝脂。领如蝤蛴。齿如瓠犀。螓首蛾眉。巧笑倩兮。美目盼兮。仪静体闲。貌若天仙。环肥燕瘦。窈窕淑艾。秀丽端庄。艳若桃李。花枝招展。温柔可人。活泼可爱。亭亭玉立。如花似玉。软玉温香。兰质蕙心。秀外慧中。楚楚动人。明眸皓齿。天生丽质。

// [内涵]
// 宛丘淑媛。色艺无双。才貌双冠。巾帼风姿。淑逸闲华。色艺双全。恬静贤淑。多情善感。天生丽质。貌婉心娴。兰心蕙性。风情万种。淑艾才情。温柔之至。温婉柔顺。温雅含蓄。娴静端庄。秀外慧中。
// 倚栏游径释闲情。兰质慧心纤指拈棋。态浓意远淑且真。奇服旷世，骨像应图。
// 美人才调信纵横，非将此骨眉公卿。为含金柳，为芳兰芷，为雨前茶。
// 小窗凝坐独幽情。

/**
 * [形容美貌]
姿色天然。占尽风流。一貌倾城。般般入画。皎若秋月。秀色可餐。天桃浓李。艳色绝世。月貌花容。名嫒美姝。风风韵韵。风流蕴藉。芳菲妩媚。花颜月貌。出水芙蓉。端丽冠绝。方桃譬李。百般难描。百年难遇。国色天香。光艳逼人。瑰姿艳逸。绝色难求。绝色盖世。绝代之丽。绝世佳人。耀如春华。仙姿玉色。莲花仙子。明艳端庄。明媚妖娆。面赛芙蓉。貌似天仙。美不胜收。浓桃艳李。倾国倾城。琼姿花貌。秋水伊人。桃腮杏面。桃花玉面。莺惭燕妒。月里嫦娥。香娇玉嫩。妍姿俏丽。艳美绝伦。  艳绝一时。艳美绝俗。香艳夺目。艳若桃李。秀色可餐。香草美人。雪肤花貌。巫女洛神。天姿国色。天生丽质。六朝粉黛。金枝玉叶。白璧无暇。桃羞李让。春半桃花。
秀靥艳比花娇。玉颜艳堪春红。
人面桃花，情致两饶。灿如春华，皎如秋月。桃之天天，灼灼其华。弱水三千，靓女如云。
普天壤其无俪，旷干载而特生。
群芳难逐，天香国艳。巴东有巫山，窈窕神女颜。新月如佳人，出海初弄色。新月如佳人，潋潋初弄月。
 */

 /**
  * [肤色]
薄粉敷面。半妆美人。盛颜仙姿。微施粉泽。杏面桃腮。颜如渥丹。玉面淡拂。丹铅其面。傅粉施朱。点额寿阳。弄粉调朱。面如冠玉。
粉白黛绿。脂粉污颜色。小白长红越女腮。细润如脂，粉光若腻。
不施粉黛而颜色如朝霞映雪。

[眉毛]
点染曲眉。螓首蛾眉。红粉青蛾。紫芝眉宇。淡扫蛾眉。眉似新月。眉清目秀。粉白黛黑。修眉联娟。扫眉才女。眉目传情。眉目如画。朗目疏眉。柳眉如烟。
粉白黛绿。绀黛羞春华眉。丽质仙娥生月殿。婉转双蛾远山色。
懒起画蛾眉，花面相交映。眉将柳而争绿，面共桃而竞红。黛眉开娇横远岫，绿鬓淳浓染春烟。眸球乌灵闪亮长眉连娟，微睇绵藐。经珠不动凝两眉，铅华销尽见天真。
  */


  /**
   * [眼晴]
暗送秋波。清眸流吩。含情凝睇。明眸皓歯。眸含秋水。双目澄徹。双瞳剪水。雰里看花。星眸微噴。杏眼明仁。月眉星眼。明眸善眛。
脇去秋波那一装。回眸一-笑百媚生。粉腮紅洞，秀眸惺松。回眸一笑，  百媚从生。干朝回吩，万載流芳。水中望月，云迦探竹。顧畍生輝，撩人心杯。
明眸善眛。

[唇歯]唇色朱櫻一点。
絳唇映日。
丹唇外朗，皓歯内鮮。
唇紅歯白。
朱唇榴歯，的碌圸床。丹唇列素歯，翠彩友蛾眉。
臾歯。
歯如含(斉、編)贝。皓歯星眸。素歯朱唇。

[头发]斜抱云和。双鬟隔香紅。紺发浓于沐。鬟云欲度香腮雪。仰无云髻，俯弄芳荣
   */


   /**
[香气]红袖添香。
暗香袭人芳馨满体。
芳香袭人。粉妆玉琢。玉体香肌。兰熏桂馥。
相携踏青，绣履遗香。香簟爽眠，幽韵撩人。
美人在时花满堂，至今三载闻余香。
颜如玉，气如兰。罗帷绮箔脂粉香。
美人葺居，沉香亭北，百花槛栏，自
是天葩故里。

[笑容]宜笑遗光。嫣然巧笑。--颦一笑。笑比褒姒。
回顾千万，一笑干金。
微晕红潮一线，拂向桃腮红，
两颊笑涡霞光荡漾。
绣幕芙蓉一笑开，斜偎宝鸭衬香腮，
眼波才动被人猜。
一笑倾城，再笑倾国，三笑倾我心。
    */


    /**[肌肤]
冰肌莹彻。柔弱无骨。珠圆玉润。圆润如玉。
皓如凝脂。
肌若凝脂，气若幽兰。冰肌玉肤，滑腻似酥。一肌妙肤，弱骨纤形。
肌理细腻骨肉匀。玉体迎风玉骨冰肌。柔心弱骨神清骨秀，香肌玉体玉骨冰肌。

[腰肢脖颈手足]婀娜小蛮。潘鬓沈腰。肩若削成，腰若约素。
回身举步，恰似柳摇花笑润初妍。隔户杨柳弱袅袅，恰似十五女儿腰。
纤纤玉手。手可生花。凌波玉足。修耳隆鼻。
修项秀颈。
手如柔荑，颜如舜华。腕白肌红，细圆无节。
折纤腰以微步，呈皓腕于轻纱。
足下蹑丝履，头上玳瑁光。指如削葱根，口如含朱丹，纤纤作细步，精妙世无双。擢纤纤之素手，雪皓腕而露形。
灯前目，被底足，帐中音。
     * 
     */

     
    /**[体态]
小巧玲珑。娇小玲珑。空谷幽兰。楚楚动人。静如处女。仪静体闲。婷婷玉立。窈窕淑女。如花似玉。优雅闲适。掩映生姿。柔情绰态。窈窕无双。风流尔雅。丰姿绰约。娇嫩丰盈。丰盈窈窕。丰姿冶丽。丰标不凡。干娇百媚。媚态如风。增娇盈媚。姣丽蛊媚。艳冶柔媚。
妍姿妖艳。
环肥燕瘦。粉藻其姿。浓淡适中，修短合度。柔桡轻曼，妩媚纤弱。冶容多姿鬓，芳香已盈路。腰若流纨素，耳著明月铛。班姬续史之姿，谢庭咏雪之态。长颦减翠，瘦绿消红(美人病之态)梨花带雨，蝉露秋枝(美人泣之态)

[睡态醉态]
朦胧惺忪。醉颜微酡。腮晕潮红，羞娥凝绿。
春光外泄。酒微醺，妆半卸。
金针倒拈，绣屏斜倚(美人懒之态)
轻云出岫。
鬓云乱洒，酥胸半掩(美人睡态)镜中貌，月下影，隔帘形，睡初醒。
     * 
     */

     
    /**
     * [行动]
盈盈走来。丰姿尽展。舞态生风。倚栏待月。英姿飒爽。婀娜多姿。
柔美飘逸。
款步姗姗。袅袅娜娜。雍容雅步。湘纹飘逸。
舞尽霓裳。仪态万干(方)。
身轻如燕。弱柳扶风。翩若惊鸿，婉若游龙。步履轻盈，珊珊作响。踏五色祥云，捧灿烂花枝。
翩若轻云出岫。
携佳人兮步迟迟腰肢袅娜似弱柳。
娥娥理红妆，纤纤抬素手。
粉腻酥融娇欲滴。风吹仙袂飘飘举。澄妆影于歌扇，散衣香于舞风，拭珠
沥于罗袂，传金翠杯于素手。

[声音]
清喉娇啭。含娇细语。娇莺初啭。嘤然有声。
微风振箫(音)。
     */

     /**
      * [年龄]豆蔻华年。
盈盈十五，娟娟二八。
药栏花榭生妙龄。

[打扮]
珠围翠绕。楚楚衣衫。.珠纱遮面。丰容靓饰。含娇倚榻。花枝招展。丰神冶丽。艳妆华服。素服花下。海棠标韵。白巾翠袖。淡雅脱俗。淡雅如仙。风娇水媚。金瓒玉珥。衣冠楚楚。丽艾盛饰。丽雪红妆。浓妆艳裹。俏丽俊逸。雍容华贵。玉瓒螺髻。铺红叠翠。罗袖初单。金莲凤头。浮翠流丹。
罗绮文秀。凤钗头上风。
双珥照夜，煜煜垂晖。
云鬓花颜金步摇。盛服浓妆韶颜雅容。洁白素衣清幽淡雅。
单衫杏子红，双鬓鸦雏色。头上倭堕髻，耳中明月珠。花钿委地无人收，方是真饰缘。
鸡鸣外欲曙，新妇起严妆。著我绣夹裙，事事四五通。足下蹑丝履，头上玳瑁光。腰若流纨素，耳著明月挡。指如削葱根，口如含朱丹。纤纤作细步，精妙世无双。
(《孔雀东南飞》)
      */