var demo = {
    title: "自己写的小诗",
    name: "自己写的小诗",
    data: [{
        title: "春潮",
        data: [
            { context: "春风拂过杨柳新,笛声绕梁耳目清.风筝燕子双嬉戏,锦鲤不见镜湖冰." },
        ]
    }]
}

//金玉檀公策，借以擒劫贼。鱼蛇海间笑，羊虎桃桑隔。树暗走痴故，釜空苦远客。屋梁有美尸，击魏连伐虢。

/**
金玉檀公策，（金）蝉脱壳|抛砖引（玉）
借以擒劫贼，（借）刀杀人|（以）逸待劳|（擒）贼擒王|乘火打（劫）|关门捉（贼）
鱼蛇海间笑，浑水摸（鱼）|打草惊（蛇）|瞒天过（海）|反（间）计|（笑）里藏刀
羊虎桃桑隔，顺手牵（羊）|调（虎）离山|李代（桃）僵|指（桑）骂槐|（隔）岸观火
树暗走痴故，（树）上开花|（暗）度陈仓|（走）为上计|假（痴）不癫|欲擒（故）纵
釜空苦远客，（釜）底抽薪|（空）城计|（苦）肉计|（远）交近攻|反（客）为主
屋梁有美尸，上（屋）抽梯|偷（梁）换柱|无中生（有）|（美）人计|借（尸）还魂
击魏连伐虢。声东（击）西|围（魏）救赵|（连）环计||假道（伐虢）
 */