let demo = {
    title: "自己写的小诗",
    name: "自己写的小诗",
    data: [{
        title: "春潮",
        data: [
            { context: "春风拂过杨柳新,笛声绕梁耳目清.风筝燕子双嬉戏,锦鲤不见镜湖冰." },
        ]
    },{
        title: "意义",
        data: [
            { context: "天文学能让我们知道空间的渺小，宇宙看地球如人类在看蚂蚁打架，意义的本身就让人值得怀疑。" },
            { context: "历史学能让我们知道时间的渺小，历史看发展如今天在看三国故事，意义不过是人们口中的笑谈。" },
            { context: "自然学能让我们知道人类的渺小，自然看人类如阳光照耀粒粒尘埃，意义不过是宇宙万物的一种。" },
            { context: "" },
        ]
    },{
        title: "人类简史--读后感",
        data: [
                { context: "任何艺术发展到顶峰探讨的都是哲学问题。都会是关于人类的意义五个字。所有的学科艺术也都是围着几个字展开的。对于这本书我没有想归结到哲学体系。这本数表面讲的是人类历史。不过个人觉得更注重人类意义的探讨。所以自己将其归类到哲学体系也有一定的借鉴作用。" },
                { context: "虽然书中很多观点不慎赞同。但是历史的发展本来就是变化为主。过去的已经成为了定局，对于定局的东西我们都无法研究透，对于未来发展成什么样子那就更无法说。我是历史无真相主义者。而文中太多的肯定句让我对书产生很多负面情绪。历史的发展都是偶然的。不过在特定的时间与地点是出现了特定的事物。中间太多的偶然。人类发展也不过是偶然中的偶然。他的介绍也不过是偶然中的一部分。" },
                { context: "对于未来的自然体系。我相信以前听过的一句话。自然有其自然的法则。不过是人类发展的太快了，地球的自然法则并没有跟上人类的法则。未来将去往何处，也不是人类说了算的。我相信自己的一句话，人在大自然面前是无能为力的。小行星 海啸 台风 地震 火山等等 意外和明天永远不知道哪个先来。好好活在当下才是最重要的。" },
                { context: "对于人类的意义，实在不是我们这些升斗小民考虑的事情。历史将去往何处发展，我们根本改变不了多大的变化。书中太多的观点，都已经超出了故事历史的范畴。历史的发展本来就不是人类自己能够决定的。多方发展创造的偶然结果。虽然文中有很多的原因，但我相信与真正的历史肯定还想去甚远，肯定还有更多的大大小小的原因。" },
                { context: "历史本身就没有真相。" },
                { context: "----一以下为ps---------" },
                { context: "然而，以上这些东西，其实都只存在人类自己发明并互相讲述的故事里。除了存在于人类共同的想象之外，这个宇宙中根本没有神、没有国家、没有钱、没有人权、没有法律，也没有正义。" },
                { context: "如果我们说：原始人因为相信鬼神，每次月圆会一起聚在营火旁跳舞，于是也巩固了他们的社会秩序；这件事人人都觉得不难理解。但我们没看出来的是，其实现代社会运作的机制还是一模一样。以现代商业领域为例，商人和律师其实就是法力强大的巫师。不同于过去部落巫师的地方是现代人的故事还更扯。" },
                { context: "PS:否定法律 国家 道德 不过人们的一种行为规范 这些东西 我可以理解成不存在的。金字塔顶端的人是一帮制定秩序和规则的人，挣在多的钱都不是顶端的人。所以社会只是被小部分人统治的。" },
                { context: "对于许多希望看到历史必然性的人来说，这种说法大概有些令人失望。毕竟，宿命论的引人之处，就在于觉得这个世界和我们的信念都是历史上自然且必然的产物。于是，我们似乎是自然而然就发展出民族国家，自然而然就遵循着资本主义经济原则，也是自然而然地坚信着人权的概念。如果承认历史并非必然，等于就是承认了现在的民族主义、资本主义和人权都只是巧合的产物。" },
                { context: "PS： 我属于历史非必然 推演出 现在确实都是偶然的产物。未来的不准确 " },
                { context: "混沌系统分成两级，一级混沌指的是“不会因为预测而改变”。至于二级混沌系统，指的是“会受到预测的影响而改变”，因此就永远无法准确预测。预测本身就是一个变量" },
                { context: "Ps 研究历史不是为了预测未来。是为了让未来变得更好" },
                   { context: "" },
                   { context: "" },
                   { context: "" },
                   { context: "" },
        ]
    },{
        title: "万历十五年读后感",
        data: [
                { context: "平淡无奇的一年  历史对于某一年来说 也许就是平淡无奇，只有我们在 蓦然回首的时候 才会意识到发生重大的变化。如果单单拿出某一个时间 它本身就是平淡无奇 无足轻重" },
        ]
    }]
}

//我不想带你去什么浪漫的土耳其，也不去什么东京巴黎迈阿密，我只想带你游遍我们中国最美的古城小镇——平遥丽江朱家角，凤凰周庄景德镇，西塘乌镇桃花岛，阆中徽州和南浔，同里婺源千岛湖，锦溪甪直芙蓉镇，木渎宏村和沙溪，还有黄姚镇远与长汀。


/**
佛教
 向台贤禅净律密

摄心一处
天台宗六秒法门可以了解下

楞严经

赢了自己也就赢得了人
侠以武犯禁儒以文乱法

---  有感而发
律己 
甘露寺以石问天
一曲隐者吟 谁肯论英雄

晋文之后中国全乱了 楚国各种灭国  僖公之后  文公之内

朝晋暮楚是为郑

心灵手巧辩

海上钢琴师有感  不能被掌握的命运

做一个不骄不躁的人

了解游戏规则 打破游戏规则  然后重新制定规则

浪迹于世间的混子
四季民福 烤鸭

风月笑平生简谱 ----- 
5 5361216  66523  235634321  22356176
6 5361216  11653   235634321  235176

316  316 6652343
316 316       536

 */


















/**
《人类简史》读后感  -- 大璐璐
这本书写了从石器时代智人演化直到21世纪政治和技术革命的一整部“人类史”。其中许多东西是自己从来没有接触到的，比如原来的巨型狮子，巨型地懒，我还天真的以为这个地球的巨型动物只有已经灭绝的恐龙。最惊讶的是智人如何遍布几个大洲的过程，理直气壮的把动物原来的平静生活打破，然后还让大型动物走向灭亡，可能那些每天沉浸在自己生活中的动物们都没有想过自己有一天会因为一群外来的身材矮小的生命体而消失。不知道这点作者的推测如何，但是看到现在动物濒临灭绝的方式，也不难猜出，原来物种的减少是谁造成的。
当人类驯服植物小麦，预示着农业革命的到来，在某些方面农业革命的完成让人类开始慢慢有了自己的文明、城池还有领地，随即而来的就是战争；当人类学会把能量相互转换，比如将热能转换为动能，预示着工业革命的到来，这里作者的一句话我感觉很对“这世界缺的不是能源，而是能够驾驭并转换符合我们所需的知识。”我们之所以面临着各种能源的短缺，是因为我们没有想到怎么把取之无尽的太阳能转化成我们所需要的能量。当我们迎来科技革命的时候，我感觉最值得庆幸的是在克服疾病和延长寿命方面的不断突破。长寿是古人就一直追求的，但是作为这个星球上的霸主，体内复杂神秘之处比比皆是。快乐究竟只是来源于体内多巴胺的分泌过多，还是对某件事所赋予的意义？难道快乐真的就只是种自我的欺骗吗？我现在开始怀疑每次的快乐是为嘛了。
这本书里面的观点我也很不喜欢比如“纳粹并不是反人性。他们之所以同自由人文主义、人权和共产主义站在对立面，反而正是因为他们推崇人性，相信人类有巨大的潜力。他们顺着达尔文演化论的逻辑，认为必须要通过自然选择淘汰不适合的个人，只留下适者，才能让人类继续生存繁殖”，适者生存，让大自然来评判吧，活到最后的才是强者，不是你自以为的自己是强者。
这本书在某些方面可以开阔人的思维和视野，人类的未来还是掌握在自己的手上，谁也不用提前恐慌自己的被淘汰，只要一直向前，永远不会是最后一个。


《人类简史》读后感—剑锋

饱受战乱的国家容易出智者，至少我这样认为。这样的环境看似动荡不安，人民朝不保夕忙于活命，但承受苦难才会思考。

《人类简史》的开头，把人类描绘成了狡诈贪婪，为了满足私欲而不择手段，特别是将其他智人和动物毁灭的情景，让我不寒而栗，我们的祖先真的是这样吗？他们不是考古学家复原出来的憨厚形象吗？他们短短的人生中能够做出如此多不堪的事情吗？读下去，我渐渐醒悟，人类的劣根性是从远古传承下来的，只是文明越发展，卑劣的手段越隐蔽而已。

我无权指责任何人，生物的发展就是要遵循强者为王，弱者淘汰的规律。拿植物举例吧，种在田里的庄稼，长得好的，农夫会不断给它施肥浇水，长得孱弱的，农夫会毫不留情地拔掉它。野生的植物会更明显，树干高大的会获取更多的阳光雨露，而生长慢的树，只能眼睁睁看着它的兄弟姐妹长高，自己却停滞不前。文中的一个实例很有趣也发人深思，到底是人类驯化了小麦，还是小麦借助人类，消除了小麦的竞争对手？其实，大自然中谁驯化了谁，还不一定呢，根据亚里士多德的"四因"法，小麦也达到了它广泛种植的"目的因″，毕竟每一个生物都盼着种族强大，而不是灭亡。结合巴黎圣母院的大火，我认为，最好的保护是远离！任何形式的保护措施，都是在破坏，直接或间接，隐形或显形。自然界存在的，就让它好好存在吧，别企图将月球开发成住宅区，别在南极大陆争地盘了，放手才是真爱！可惜，贪婪是人性深处挥之不去的顽疾。

我非常认可作者提出的战争已远离的观点，“在过去的500年间，我们见证了一连串令人惊叹的革命。地球在生态和历史上都已经整合成一个单一的领域。经济呈现指数增长，今日人类所享有的财富在过去只有可能出现在童话里。而科学和工业革命也带给我们超人类的力量，以及几乎可以说无限的能源。不仅社会秩序完全改变，政治、日常生活和人类心理也彻底改观。”人类已经发现，从战争获取的利益，不及合作中获得的利益，所以世界级的战争从二战后已经不大可能出现了，当然还有一个根本性的原因是，大家应该感谢罗伯特·奥本海默以及和他一起研发出原子弹的同事。有了核武器之后，超级大国之间如果再开战，无异等于集体自杀。因此，想要武力征服全球也成了不可能的任务。所以，大国之间相互制衡，世界获得和平。局部战争仍不可避免，这点不要纠结，毕竟暴力往往比较直接有效，同时战争会转移国内矛盾。

需要提醒大家的是，我们把科技进步当成了人类的骄傲，我觉得是人类通过科技把世界时钟拨快了，认为这样就是进步，恰巧相反，只要频率被打乱，一切都要重新适应，例如之前一日两餐时我们可以吃得很慢，品出食物的味道。到了外卖小哥出现后，从下单到吃完，比之前自己做饭的时间都少，只剩下饱腹感而已。快捷，快餐，快节奏，其实离它们的表亲"快乐"太远了。同时，农业革命后食物充足，人类开始有空余时间思考。人类的思考，揭开了毁灭世界的序幕。
读完此书，希望大家能够结合伦理学中的一个至关重要的原则-互惠原则，即你想别人怎么待你，你就要怎样待人，现在的人类已经广泛运用这个原则相处。但还不够，我们要将这一黄金法则运用到与自然相处，与宇宙相处中去

 */