var demo = {
    title: "自己写的小诗",
    name: "自己写的小诗",
    data: [{
        title: "春潮",
        data: [
            { context: "春风拂过杨柳新,笛声绕梁耳目清.风筝燕子双嬉戏,锦鲤不见镜湖冰." },
        ]
    },{
        title: "意义",
        data: [
            { context: "天文学能让我们知道空间的渺小，宇宙看地球如人类在看蚂蚁打架，意义的本身就让人值得怀疑。" },
            { context: "历史学能让我们知道时间的渺小，历史看发展如今天在看三国故事，意义不过是人们口中的笑谈。" },
            { context: "自然学能让我们知道人类的渺小，自然看人类如阳光照耀粒粒尘埃，意义不过是宇宙万物的一种。" },
            { context: "" },
        ]
    }]
}

//我不想带你去什么浪漫的土耳其，也不去什么东京巴黎迈阿密，我只想带你游遍我们中国最美的古城小镇——平遥丽江朱家角，凤凰周庄景德镇，西塘乌镇桃花岛，阆中徽州和南浔，同里婺源千岛湖，锦溪甪直芙蓉镇，木渎宏村和沙溪，还有黄姚镇远与长汀。