let demo = {
    title: "自己写的小诗",
    name: "自己写的小诗",
    data: [{
        title: "春潮",
        data: [
            { context: "春风拂过杨柳新,笛声绕梁耳目清.风筝燕子双嬉戏,锦鲤不见镜湖冰." },
        ]
    },{
        title: "意义",
        data: [
            { context: "天文学能让我们知道空间的渺小，宇宙看地球如人类在看蚂蚁打架，意义的本身就让人值得怀疑。" },
            { context: "历史学能让我们知道时间的渺小，历史看发展如今天在看三国故事，意义不过是人们口中的笑谈。" },
            { context: "自然学能让我们知道人类的渺小，自然看人类如阳光照耀粒粒尘埃，意义不过是宇宙万物的一种。" },
            { context: "" },
        ]
    },{
        title: "人类简史--读后感",
        data: [
                { context: "任何艺术发展到顶峰探讨的都是哲学问题。都会是关于人类的意义五个字。所有的学科艺术也都是围着几个字展开的。对于这本书我没有想归结到哲学体系。这本数表面讲的是人类历史。不过个人觉得更注重人类意义的探讨。所以自己将其归类到哲学体系也有一定的借鉴作用。" },
                { context: "虽然书中很多观点不慎赞同。但是历史的发展本来就是变化为主。过去的已经成为了定局，对于定局的东西我们都无法研究透，对于未来发展成什么样子那就更无法说。我是历史无真相主义者。而文中太多的肯定句让我对书产生很多负面情绪。历史的发展都是偶然的。不过在特定的时间与地点是出现了特定的事物。中间太多的偶然。人类发展也不过是偶然中的偶然。他的介绍也不过是偶然中的一部分。" },
                { context: "对于未来的自然体系。我相信以前听过的一句话。自然有其自然的法则。不过是人类发展的太快了，地球的自然法则并没有跟上人类的法则。未来将去往何处，也不是人类说了算的。我相信自己的一句话，人在大自然面前是无能为力的。小行星 海啸 台风 地震 火山等等 意外和明天永远不知道哪个先来。好好活在当下才是最重要的。" },
                { context: "对于人类的意义，实在不是我们这些升斗小民考虑的事情。历史将去往何处发展，我们根本改变不了多大的变化。书中太多的观点，都已经超出了故事历史的范畴。历史的发展本来就不是人类自己能够决定的。多方发展创造的偶然结果。虽然文中有很多的原因，但我相信与真正的历史肯定还想去甚远，肯定还有更多的大大小小的原因。" },
                { context: "历史本身就没有真相。" },
                { context: "----一以下为ps---------" },
                { context: "然而，以上这些东西，其实都只存在人类自己发明并互相讲述的故事里。除了存在于人类共同的想象之外，这个宇宙中根本没有神、没有国家、没有钱、没有人权、没有法律，也没有正义。" },
                { context: "如果我们说：原始人因为相信鬼神，每次月圆会一起聚在营火旁跳舞，于是也巩固了他们的社会秩序；这件事人人都觉得不难理解。但我们没看出来的是，其实现代社会运作的机制还是一模一样。以现代商业领域为例，商人和律师其实就是法力强大的巫师。不同于过去部落巫师的地方是现代人的故事还更扯。" },
                { context: "PS:否定法律 国家 道德 不过人们的一种行为规范 这些东西 我可以理解成不存在的。金字塔顶端的人是一帮制定秩序和规则的人，挣在多的钱都不是顶端的人。所以社会只是被小部分人统治的。" },
                { context: "对于许多希望看到历史必然性的人来说，这种说法大概有些令人失望。毕竟，宿命论的引人之处，就在于觉得这个世界和我们的信念都是历史上自然且必然的产物。于是，我们似乎是自然而然就发展出民族国家，自然而然就遵循着资本主义经济原则，也是自然而然地坚信着人权的概念。如果承认历史并非必然，等于就是承认了现在的民族主义、资本主义和人权都只是巧合的产物。" },
                { context: "PS： 我属于历史非必然 推演出 现在确实都是偶然的产物。未来的不准确 " },
                { context: "混沌系统分成两级，一级混沌指的是“不会因为预测而改变”。至于二级混沌系统，指的是“会受到预测的影响而改变”，因此就永远无法准确预测。预测本身就是一个变量" },
                { context: "Ps 研究历史不是为了预测未来。是为了让未来变得更好" },
                   { context: "" },
                   { context: "" },
                   { context: "" },
                   { context: "" },
        ]
    },{
        title: "万历十五年读后感",
        data: [
                { context: "平淡无奇的一年  历史对于某一年来说 也许就是平淡无奇，只有我们在 蓦然回首的时候 才会意识到发生重大的变化。如果单单拿出某一个时间 它本身就是平淡无奇 无足轻重" },
        ]
    }]
}

//我不想带你去什么浪漫的土耳其，也不去什么东京巴黎迈阿密，我只想带你游遍我们中国最美的古城小镇——平遥丽江朱家角，凤凰周庄景德镇，西塘乌镇桃花岛，阆中徽州和南浔，同里婺源千岛湖，锦溪甪直芙蓉镇，木渎宏村和沙溪，还有黄姚镇远与长汀。