/**
 * 人类简史
 * 
 * 
 * 然而，以上这些东西，其实都只存在人类自己发明并互相讲述的故事里。除了存在于人类共同的想象之外，这个宇宙中根本没有神、没有国家、没有钱、没有人权、没有法律，也没有正义。
　　如果我们说：原始人因为相信鬼神，每次月圆会一起聚在营火旁跳舞，于是也巩固了他们的社会秩序；这件事人人都觉得不难理解。但我们没看出来的是，其实现代社会运作的机制还是一模一样。以现代商业领域为例，商人和律师其实就是法力强大的巫师。不同于过去部落巫师的地方是现代人的故事还更扯。

PS:否定法律 国家 道德 不过人们的一种行为规范 这些东西 我可以理解成不存在的。金字塔顶端的人是一帮制定秩序和规则的人，挣在多的钱都不是顶端的人。所以社会只是被小部分人统治的。


对于许多希望看到历史必然性的人来说，这种说法大概有些令人失望。毕竟，宿命论的引人之处，就在于觉得这个世界和我们的信念都是历史上自然且必然的产物。于是，我们似乎是自然而然就发展出民族国家，自然而然就遵循着资本主义经济原则，也是自然而然地坚信着人权的概念。如果承认历史并非必然，等于就是承认了现在的民族主义、资本主义和人权都只是巧合的产物。

PS： 我属于历史非必然 推演出 现在确实都是偶然的产物。未来的不准确 

混沌系统分成两级，一级混沌指的是“不会因为预测而改变”。至于二级混沌系统，指的是“会受到预测的影响而改变”，因此就永远无法准确预测。预测本身就是一个变量
Ps 研究历史不是为了预测未来。是为了让未来变得更好
 */


 /**
  * 万历十五年
  * 
  * 平淡无奇的一年  历史对于某一年来说 也许就是平淡无奇，只有我们在 蓦然回首的时候 才会意识到发生重大的变化。如果单单拿出某一个时间 它本身就是平淡无奇 无足轻重
  */