var demo = {
    title: "道德经",
    name: "道德经",
    data: [ {
        title: "【第一章】道可道，非常道；名可名，非常名。无名天地之始，有名万物之母。故常无欲，以观其妙；常有欲，以观其徼（jiào）。此两者同出而异名，同谓之玄，玄之又玄，众妙之门。",
        data: [
            { context: "【译文】“道”如果可以用言语来表述，那它就是常“道”(“道”是可以用言语来表述的，它并非一般的“道”)；“名”如果可以用文辞去命名，那它就是常“名”(“名”也是可以说明的，它并非普通的“名”)。“无”可以用来表述天地浑沌未开之际的状况；而“有”，则是宇宙万物产生之本原的命名。因此，要常从“无”中去观察领悟“道”的奥妙；要常从“有”中去观察体会“道”的端倪。无与有这两者，来源相同而名称相异，都可以称之为玄妙、深远。它不是一般的玄妙、深奥，而是玄妙又玄妙、深远又深远，是宇宙天地万物之奥妙的总门(从“有名”的奥妙到达无形的奥妙，“道”是洞悉一切奥妙变化的门径)。" },
        ]
    },{
        title: "【第二章】天下皆知美之为美，斯恶（è）已；皆知善之为善，斯不善已。故有无相生，难易相成，长短相较，高下相倾，音声相和（hè），前后相随。是以圣人处无为之事，行不言之教，万物作焉而不辞，生而不有，为而不恃，功成而弗居。夫（fú）唯弗居，是以不去。",
        data: [
            { context: "【译文】天下人都知道美之所以为美，那是由于有丑陋的存在。都知道善之所以为善，那是因为有恶的存在。所以有和无互相转化，难和易互相形成，长和短互相显现，高和下互相充实，音与声互相谐和，前和后互相接随——这是永恒的。因此圣人用无为的观点对待世事，用不言的方式施行教化：听任万物自然兴起而不为其创始，有所施为，但不加自己的倾向，功成业就而不自居。正由于不居功，就无所谓失去。" },
        ]
    },{
        title: "【第三章】不尚贤，使民不争；不贵难得之货，使民不为盗；不见（xiàn）可欲，使民心不乱。是以圣人之治，虚其心，实其腹；弱其志，强其骨。常使民无知无欲，使夫（fú）智者不敢为也。为无为，则无不治。",
        data: [
            { context: "【译文】不推崇有才德的人，导使老百姓不互相争夺；不珍爱难得的财物，导使老百姓不去偷窃；不显耀足以引起贪心的事物，导使民心不被迷乱。因此，圣人的治理原则是：排空百姓的心机，填饱百姓的肚腹，减弱百姓的竞争意图，增强百姓的筋骨体魄，经常使老百姓没有智巧，没有欲望。致使那些有才智的人也不敢妄为造事。圣人按照“无为”的原则去做，办事顺应自然，那么，天才就不会不太平了。 " },
        ]
    },{
        title: "【第四章】道冲而用之或不盈，渊兮似万物之宗。挫其锐，解其纷，和其光，同其尘。湛兮似或存，吾不知谁之子，象帝之先。",
        data: [
            { context: "【译文】大“道”空虚开形，但它的作用又是无穷无尽。深远啊！它好象万物的祖宗。消磨它的锋锐，消除它的纷扰，调和它的光辉，混同于尘垢。隐没不见啊，又好象实际存在。我不知道它是谁的后代，似乎是天帝的祖先。" },
        ]
    },{
        title: "【第五章】天地不仁，以万物为刍（chú）狗；圣人不仁，以百姓为刍狗。天地之间，其犹橐龠（tuó yuè）乎？虚而不屈，动而愈出。多言数（shuò）穷，不如守中。 ",
        data: [
            { context: "【译文】天地是无所谓仁慈的，它没有仁爱，对待万事万物就像对待刍狗一样，任凭万物自生自灭。圣人也是没有仁受的，也同样像刍狗那样对待百姓，任凭人们自作自息。天地之间，岂不像个风箱一样吗？它空虚而不枯竭，越鼓动风就越多，生生不息。政令繁多反而更加使人困惑，更行不通，不如保持虚静。 " },
        ]
    },{
        title: "【第六章】谷神不死，是谓玄牝（pìn），玄牝之门，是谓天地根。绵绵若存，用之不勤。",
        data: [
            { context: "【译文】生养天地万物的道（谷神）是永恒长存的，这叫做玄妙的母性。玄妙母体的生育之产门，这就是天地的根本。连绵不绝啊！它就是这样不断的永存，作用是无穷无尽的。 " },
        ]
    },{
        title: "【第七章】天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人后其身而身先，外其身而身存。非以其无私邪（yé）？故能成其私。 ",
        data: [
            { context: "【译文】天长地久，天地所以能长久存在，是因为它们不为了自己的生存而自然地运行着，所以能够长久生存。因此，有道的圣人遇事谦退无争，反而能在众人之中领先；将自己置于度外，反而能保全自身生存。这不正是因为他无私吗？所以能成就他的自身。" },
        ]
    },{
        title: "【第八章】上善若水。水善利万物而不争，处众人之所恶（wù），故几（jī）于道。居善地，心善渊，与善仁，言善信，正善治，事善能，动善时。夫唯不争，故无尤。",
        data: [
            { context: "【译文】最善的人好像水一样。水善于滋润万物而不与万物相争，停留在众人都不喜欢的地方，所以最接近于“道”。最善的人，居处最善于选择地方，心胸善于保持沉静而深不可测，待人善于真诚、友爱和无私，说话善于格守信用，为政善于精简处理，能把国家治理好，处事能够善于发挥所长，行动善于把握时机。最善的人所作所为正因为有不争的美德，所以没有过失，也就没有怨咎。" },
        ]
    },{
        title: "【第九章】持而盈之，不如其已。揣(chuǎi)而锐之，不可长保。金玉满堂，莫之能守。富贵而骄，自遗（yí）其咎。功成身退，天之道。 ",
        data: [
            { context: "【译文】执持盈满，不如适时停止；显露锋芒，锐势难以保持长久。金玉满堂，无法守藏；如果富贵到了骄横的程度，那是自己留下了祸根。一件事情做的圆满了，就要含藏收敛，这是符合自然规律的道理。" },
        ]
    },{
        title: "【第十章】载（zài）营魄抱一，能无离乎？专气致柔，能婴儿乎？涤除玄览，能无疵乎？爱民治国，能无知（zhì）乎？天门开阖（hé），能无雌乎？明白四达，能无为乎？生之、畜（xù）之，生而不有，为而不恃，长（zhǎng）而不宰，是谓玄德。 ",
        data: [
            { context: "【译文】精神和形体合一，能不分离吗？聚结精气以致柔和温顺，能像婴儿的无欲状态吗？清除杂念而深入观察心灵，能没有瑕疵吗？爱民治国能遵行自然无为的规律吗？感官与外界的对立变化相接触，能宁静吧？明白四达，能不用心机吗？让万事万物生长繁殖，产生万物、养育万物而不占为己有，作万物之长而不主宰他们，这就叫做“玄德”。" },
        ]
    },{
        title: "【第十一章】三十辐共一毂（gǔ），当其无，有车之用。埏埴（shān zhí）以为器，当其无，有器之用。凿户牖（yǒu）以为室，当其无，有室之用。故有之以为利，无之以为用。",
        data: [
            { context: "【译文】三十根辐条汇集到一根毂中的孔洞当中，有了车毂中空的地方，才有车的作用。揉和陶土做成器皿，有了器具中空的地方，才有器皿的作用。开凿门窗建造房屋，有了门窗四壁内的空虚部分，才有房屋的作用。所以，“有”给人便利，“无”发挥了它的作用。" },
        ]
    },{
        title: "【第十二章】 五色令人目盲，五音令人耳聋，五味令人口爽，驰骋畋（tián）猎令人心发狂，难得之货令人行妨。是以圣人为腹不为目，故去彼取此。",
        data: [
            { context: "【译文】缤纷的色彩，使人眼花缭乱；嘈杂的音调，使人听觉失灵；丰盛的食物，使人舌不知味；纵情狩猎，使人心情放荡发狂；稀有的物品，使人行为不轨。因此，圣人但求吃饱肚子而不追逐声色之娱，所以摒弃物欲的诱惑而保持安定知足的生活方式。" },
        ]
    },{
        title: "【第十三章】宠辱若惊，贵大患若身。何谓宠辱若惊？宠为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身，及吾无身，吾有何患！故贵以身为天下，若可寄天下；爱以身为天下，若可托天下。 ",
        data: [
            { context: "【译文】受到宠爱和受到侮辱都好像受到惊恐，把荣辱这样的大患看得与自身生命一样珍贵。什么叫做得宠和受辱都感到惊慌失措？得宠是卑下的，得到宠爱感到格外惊喜，失去宠爱则令人惊慌不安。这就叫做得宠和受辱都感到惊恐。什么叫做重视大患像重视自身生命一样？我之所以有大患，是因为我有身体；如果我没有身体，我还会有什么祸患呢？所以，珍贵自己的身体是为了治理天下，天下就可以托付他；爱惜自己的身体是为了治理天下，天下就可以依靠他了。" },
        ]
    },{
        title: "【第十四章】视之不见名曰夷，听之不闻名曰希，搏之不得名曰微。此三者不可致诘（jié），故混（hùn）而为一。其上不皦（jiǎo皎），其下不昧。绳绳(mǐn mǐn )不可名，复归于无物，是谓无状之状，无物之象。是谓惚恍。迎之不见其首，随之不见其后。执古之道，以御今之有，能知古始，是谓道纪。",
        data: [
            { context: "【译文】看它看不见，把它叫做“夷”；听它听不到，把它叫做“希”；摸它摸不到，把它叫做“微”。这三者的形状无从追究，它们原本就浑然而为一。它的上面既不显得光明亮堂；它的下面也不显得阴暗晦涩，无头无绪、延绵不绝却又不可称名，一切运动都又回复到无形无象的状态。这就是没有形状的形状，不见物体的形象，这就是“惚恍”。迎着它，看不见它的前头，跟着它，也看不见它的后头。把握着早已存在的“道”，来驾驭现实存在的具体事物。能认识、了解宇宙的初始，这就叫做认识“道”的规律。" },
        ]
    },{
        title: "【第十五章】古之善为士者，微妙玄通，深不可识。夫唯不可识，故强(qiǎng)为之容。豫焉若冬涉川，犹兮若畏四邻，俨兮其若容，涣兮若冰之将释，敦兮其若朴，旷兮其若谷，混兮其若浊。孰能浊以静之徐清？孰能安以久动之徐生？保此道者不欲盈，夫唯不盈，故能蔽不新成。",
        data: [
            { context: "【译文】古时候善于行道的人，微妙通达，深刻玄远，不是一般人可以理解的。正因为不能认识他，所以只能勉强地形容他说：他小心谨慎啊，好像冬天踩着水过河；他警觉戒备啊，好像防备着邻国的进攻；他恭敬郑重啊，好像要去赴宴做客；他行动洒脱啊，好像冰块缓缓消融；他纯朴厚道啊，好像没有经过加工的原料；他旷远豁达啊，好像深幽的山谷；他浑厚宽容，好像不清的浊水。谁能使浑浊安静下来，慢慢澄清？谁能使安静变动起来，慢慢显出生机？保持这个“道”的人不会自满。正因为他从不自满，所以能够去故更新。" },
        ]
    },{
        title: "【第十六章】致虚极，守静笃（dǔ），万物并作，吾以观复。夫物芸芸，各复归其根。归根曰静，是谓复命。复命曰常，知常曰明，不知常，妄作，凶。知常容，容乃公，公乃王（wàng），王（wàng）乃天，天乃道，道乃久，没（mò）身不殆。 ",
        data: [
            { context: "【译文】尽力使心灵的虚寂达到极点，使生活清静坚守不变。万物都一齐蓬勃生长，我从而考察其往复的道理。那万物纷纷芸芸，各自返回它的本根。返回到它的本根就叫做清静，清静就叫做复归于生命。复归于生命就叫自然，认识了自然规律就叫做聪明，不认识自然规律的轻妄举止，往往会出乱子和灾凶。认识自然规律的人是无所不包的，无所不包就会坦然公正，公正就能周全，周全才能符合自然的“道”，符合自然的道才能长久，终身不会遭到危险。" },
        ]
    },{
        title: "【第十七章】太上，下知有之。其次，亲而誉之。其次，畏之。其次，侮之。信不足焉，有不信焉。悠兮其贵言。功成事遂，百姓皆谓我自然。 ",
        data: [
            { context: "【译文】最好的统治者，人民并不知道他的存在；其次的统治者，人民亲近他并且称赞他；再次的统治者，人民畏惧他；更次的统治者，人民轻蔑他。统治者的诚信不足，人民才不相信他，最好的统治者是多么悠闲。他很少发号施令，事情办成功了，老百姓说“我们本来就是这样的。”" },
        ]
    },{
        title: "【第十八章】大道废，有仁义；慧智出，有大伪；六亲不和，有孝慈；国家昏乱，有忠臣。 ",
        data: [
            { context: "【译文】大道被废弃了，才有提倡仁义的需要；聪明智巧的现象出现了，伪诈才盛行一时；家庭出现了纠纷，才能显示出孝与慈；国家陷于混乱，才能见出忠臣。" },
        ]
    },{
        title: "【第十九章】绝圣弃智，民利百倍；绝仁弃义，民复孝慈；绝巧弃利，盗贼无有。此三者，以为文不足，故令有所属，见（xiàn）素抱朴，少私寡欲。 ",
        data: [
            { context: "【译文】抛弃聪明智巧，人民可以得到百倍的好处；抛弃仁义，人民可以恢复孝慈的天性；抛弃巧诈和货利，盗贼也就没有了。圣智、仁义、巧利这三者全是巧饰，作为治理社会病态的法则是不够的，所以要使人们的思想认识有所归属，保持纯洁朴实的本性，减少私欲杂念，抛弃圣智礼法的浮文，才能免于忧患。" },
        ]
    },{
        title: "【第二十章】绝学无忧。唯之与阿（ē），相去几何？善之与恶，相去若何？人之所畏，不可不畏。荒兮其未央哉！众人熙熙，如享太牢，如春登台。我独泊兮其未兆，如婴儿之未孩。傫傫（lěi）兮若无所归。众人皆有余，而我独若遗。我愚人之心也哉！沌沌兮！俗人昭昭，我独昏昏；俗人察察，我独闷闷。澹（dàn）兮其若海，飂（liù）兮若无止。众人皆有以，而我独顽似鄙。我独异于人，而贵食(sì)母。 ",
        data: [
            { context: "【译文】应诺和呵斥，相距有多远？美好和丑恶，又相差多少？人们所畏惧的，不能不畏惧。这风气从远古以来就是如此，好像没有尽头的样子。众人都熙熙攘攘、兴高采烈，如同去参加盛大的宴席，如同春天里登台眺望美景。而我却独自淡泊宁静，无动于衷。混混沌沌啊，如同婴儿还不会发出嘻笑声。疲倦闲散啊，好像浪子还没有归宿。众人都有所剩余，而我却像什么也不足。我真是只有一颗愚人的心啊！众人光辉自炫，唯独我迷迷糊糊；众人都那么严厉苛刻，唯独我这样淳厚宽宏。恍惚啊，像大海汹涌；恍惚啊，像飘泊无处停留。世人都精明灵巧有本领，唯独我愚昧而笨拙。我唯独与人不同的，关键在于得到了“道”。" },
        ]
    },{
        title: "【第二十一章】孔德之容，惟道是从。道之为物，惟恍惟惚。惚兮恍兮，其中有象；恍兮惚兮，其中有物。窈（yǎo）兮冥兮，其中有精；其精甚真，其中有信。自古及今，其名不去，以阅众甫。吾何以知众甫之状哉？以此。",
        data: [
            { context: "【译文】大德的形态，是由道所决定的。“道”这个东西，没有清楚的固定实体。它是那样的恍恍惚惚啊，其中却有形象。它是那样的恍恍惚惚啊，其中却有实物。它是那样的深远暗昧啊，其中却有精质；这精质是最真实的，这精质是可以信验的。从当今上溯到古代，它的名字永远不能废除，依据它，才能观察万物的初始。我怎么才能知道万事万物开始的情况呢？是从“道”认识的。" },
        ]
    },{
        title: "【第二十二章】曲则全，枉则直，洼则盈，敝则新，少则得，多则惑。是以圣人抱一，为天下式。不自见（xiàn）故明，不自是故彰，不自伐故有功，不自矜故长。夫唯不争，故天下莫能与之争。古之所谓曲则全者，岂虚言哉！诚全而归之。 ",
        data: [
            { context: "【译文】委曲便会保全，屈枉便会直伸；低洼便会充盈，陈旧便会更新；少取便会获得，贪多便会迷惑。所以有道的人坚守这一原则作为天下事理的范式，不自我表扬，反能显明；不自以为是，反能是非彰明；不自己夸耀，反能得有功劳；不自我矜持，所以才能长久。正因为不与人争，所以遍天下没有人能与他争。古时所谓“委曲便会保全”的话，怎么会是空话呢？它实实在在能够达到。" },
        ]
    },{
        title: "【第二十三章】希言自然。故飘风不终朝（zhāo），骤雨不终日。孰为此者？天地。天地尚不能久，而况于人乎？故从事于道者，道者同于道，德者同于德，失者同于失。同于道者，道亦乐得之；同于德者，德亦乐得之；同于失者，失亦乐得之。信不足焉，有不信焉。",
        data: [
            { context: "【译文】不言政令不扰民是合乎于自然的。狂风刮不了一个早晨，暴雨下不了一整天。谁使它这样的呢？天地。天地的狂暴尚且不能长久，更何况是人呢？所以，从事于道的就同于道，从事于德的就同于德，从事于失的人就同于失。同于道的人，道也乐于得到他；同于德的人，德也乐于得到他；同于失的人，失也乐于得到他。统治者的诚信不足，就会有人不信任。" },
        ]
    },{
        title: "【第二十四章】企者不立，跨者不行，自见（xiàn）者不明，自是者不彰，自伐者无功，自矜者不长。其在道也，曰余食赘（zhuì）行。物或恶（wù）之，故有道者不处（chǔ）。",
        data: [
            { context: "【译文】踮起脚跟想要站得高，反而站立不住；迈起大步想要前进得快，反而不能远行。自逞已见的反而得不到彰明；自以为是的反而得不到显昭；自我夸耀的建立不起功勋；自高自大的不能做众人之长。从道的角度看，以上这些急躁炫耀的行为，只能说是剩饭赘瘤。因为它们是令人厌恶的东西，所以有道的人决不这样做。" },
        ]
    },{
        title: "【第二十五章】有物混（hùn）成，先天地生。寂兮寥兮，独立不改，周行而不殆，可以为天下母。吾不知其名，字之曰道，强",
        data: [
            { context: "【译文】有一个东西混然而成，在天地形成以前就已经存在。听不到它的声音也看不见它的形体，寂静而空虚，不依靠任何外力而独立长存永不停息，循环运行而永不衰竭，可以作为万物的根本。我不知道它的名字，所以勉强把它叫做“道”，再勉强给它起个名字叫做“大”。它广大无边而运行不息，运行不息而伸展遥远，伸展遥远而又返回本原。所以说道大、天大、地大、人也大。宇宙间有四大，而人居其中之一。人取法地，地取法天，天取法“道”，而道纯任自然。" },
        ]
    },{
        title: "【第二十六章】重为轻根，静为躁君。是以圣人终日行不离辎（zī）重。虽有荣观（guàn），燕处超然，奈何万乘（shèng）之主，而以身轻天下？轻则失本，躁则失君。",
        data: [
            { context: "【译文】厚重是轻率的根本，静定是躁动的主宰。因此君子终日行走，不离开载装行李的车辆，虽然有美食胜景吸引着他，却能安然处之。为什么大国的君主，还要轻率躁动以治天下呢？轻率就会失去根本；急躁就会丧失主导。" },
        ]
    },{
        title: "【第二十七章】善行无辙迹，善言无瑕谪(xiá zhé)，善数（shǔ）不用筹策，善闭无关楗（jiàn）而不可开，善结无绳约而不可解。是以圣人常善救人，故无弃人；常善救物，故无弃物，是谓袭明。故善人者，不善人之师；不善人者，善人之资。不贵其师，不爱其资，虽智大迷，是谓要妙。",
        data: [
            { context: "【译文】善于行走的，不会留下辙迹；善于言谈的，不会发生病疵；善于计数的，用不着竹码子；善于关闭的，不用栓梢而使人不能打开；善于捆缚的，不用绳索而使人不能解开。因此，圣人经常挽救人，所以没有被遗弃的人；经常善于物尽其用，所以没有被废弃的物品。这就叫做内藏着的聪明智慧。所以善人可以做为恶人们的老师，不善人可以作为善人的借鉴。不尊重自己的老师，不爱惜他的借鉴作用，虽然自以为聪明，其实是大大的糊涂。这就是精深微妙的道理。" },
        ]
    },{
        title: "【第二十八章】知其雄，守其雌，为天下溪。为天下溪，常德不离，复归于婴儿。知其白，守其黑，为天下式。为天下式，常德不忒（tè），复归于无极。知其荣，守其辱，为天下谷。为天下谷，常德乃足，复归于朴。朴散则为器，圣人用之则为官长（zhǎng）。故大制不割。",
        data: [
            { context: "【译文】深知什么是雄强，却安守雌柔的地位，甘愿做天下的溪涧。甘愿作天下的溪涧，永恒的德性就不会离失，回复到婴儿般单纯的状态。深知什么是明亮，却安于暗昧的地位，甘愿做天下的模式。甘愿做天下的模式，永恒的德行不相差失，恢复到不可穷极的真理。深知什么是荣耀，却安守卑辱的地位，甘愿做天下的川谷。甘愿做天下的川谷，永恒的德性才得以充足，回复到自然本初的素朴纯真状态。朴素本初的东西经制作而成器物，有道的人沿用真朴，则为百官之长，所以完善的政治是不可分割的。" },
        ]
    },{
        title: "【第二十九章】将欲取天下而为之，吾见其不得已。天下神器，不可为也。为者败之，执者失之。故物或行或随，或歔（xū）或吹，或强或羸（léi），或挫或隳（huī）。是以圣人去甚，去奢，去泰。",
        data: [
            { context: "【译文】想要治理天下，却又要用强制的办法，我看他不能够达到目的。天下的人民是神圣的，不能够违背他们的意愿和本性而加以强力统治，否则用强力统治天下，不能够违背他们的意愿和本性而加以强力统治，否则用强力纺治天下，就一定会失败；强力把持天下，就一定会失去天下。因此，圣人不妄为，所以不会失败；不把持，所以不会被抛弃。世人秉性不一，有前行有后随，有轻嘘有急吹，有的刚强，有的赢弱；有的安居，有的危殆。因此，圣人要除去那种极端、奢侈的、过度的措施法度。" },
        ]
    },{
        title: "【第三十章】以道佐人主者，不以兵强天下，其事好（hào）还。师之所处，荆棘生焉。大军之后，必有凶年。善有果而已，不敢以取强。果而勿矜，果而勿伐，果而勿骄，果而不得已，果而勿强。物壮则老，是谓不道，不道早已。",
        data: [
            { context: "【译文】依照“道”的原则辅佐君主的人，不以兵力逞强于天下。穷兵黩武这种事必然会得到报应。军队所到的地方，荆棘横生，大战之后，一定会出现荒年。善于用兵的人，只要达到用兵的目的也就可以了，并不以兵力强大而逞强好斗。达到目的了却不自我矜持，达到目的了也不去夸耀骄傲，达到目的了也不要自以为是，达到目的却出于不得已，达到目的却不逞强。事物过去强大就会走向衰朽，这就说明它不符合于“道”，不符合于“道”的，就会很快死亡。" },
        ]
    },{
        title: "【第三十一章】夫佳兵者，不祥之器。物或恶（wù）之，故有道者不处（chǔ）。君子居则贵左，用兵则贵右。兵者，不祥之器，非君子之器。不得已而用之，恬淡为上，胜而不美。而美之者，是乐(yào)杀人。夫乐(yào)杀人者，则不可以得志于天下矣。吉事尚左，凶事尚右。偏将军居左，上将军居右，言以丧（sāng）礼处之。杀人之众，以哀悲泣之，战胜，以丧礼处之。 ",
        data: [
            { context: "【译文】兵器啊，是不祥的东西，人们都厌恶它，所以有“道”的人不使用它。君子平时居处就以左边为贵而用兵打仗时就以右边为贵。兵器这个不祥的东西，不是君子所使用的东西，万不得已而使用它，最好淡然处之，胜利了也不要自鸣得意，如果自以为了不起，那就是喜欢杀人。凡是喜欢杀人的人，就不可能得志于天下。吉庆的事情以左边为上，凶丧的事情以右方为上，偏将军居于左边，上将军居于右边，这就是说要以丧礼仪式来处理用兵打仗的事情。战争中杀人众多，要用哀痛的心情参加，打了胜仗，也要以丧礼的仪式去对待战死的人。" },
        ]
    },{
        title: "【第三十二章】道常无名，朴虽小，天下莫能臣也。侯王若能守之，万物将自宾。天地相合以降甘露，民莫之令而自均。始制有名，名亦既有，夫亦将知止。知止可以不殆。譬道之在天下，犹川谷之于江海。",
        data: [
            { context: "【译文】“道”永远是无名而质朴的，它虽然很小不可见，天下没有谁能使它服从自己。侯王如果能够依照“道”的原则治理天下，百姓们将会自然地归从于它。天地间阴阳之气相合，就会降下甘露，人们不必指使它而会自然均匀。治理天下就要建立一种管理体制，制定各种制度确定各种名分，任命各级官长办事。名分既然有了，就要有所制约，适可而止，知道制约、适可而止，就没有什么危险了。“道”存在于天下，就像江海，一切河川溪水都归流于它，使万物自然宾服。" },
        ]
    },{
        title: "【第三十三章】知人者智，自知者明。胜人者有力，自胜者强。知足者富，强行者有志，不失其所者久，死而不亡者寿。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十四章】大道泛兮，其可左右。万物恃之而生而不辞，功成不名有，衣养万物而不为主，常无欲，可名于小；万物归焉而不为主，可名为大。以其终不自为大，故能成其大。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十五章】执大象，天下往；往而不害，安平太。乐（yuè）与饵，过客止。道之出口，淡乎其无味，视之不足见（jiàn），听之不足闻，用之不足既。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十六章】将欲歙（xī）之，必固张之；将欲弱之，必固强之；将欲废之，必固兴之；将欲夺之，必固与之，是谓微明。柔弱胜刚强。鱼不可脱于渊，国之利器不可以示人。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十七章】道常无为而无不为，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。无名之朴，夫亦将无欲。不欲以静，天下将自定。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十八章】上德不德，是以有德；下德不失德，是以无德。上德无为而无以为，下德为之而有以为。上仁为之而无以为，上义为之而有以为，上礼为之而莫之应，则攘(rǎng)臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄(bó)而乱之首。前识者，道之华而愚之始。是以大丈夫处其厚，不居其薄(bó)；处其实，不居其华。故去彼取此。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第三十九章】昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈，万物得一以生，侯王得一以为天下贞。其致之。天无以清将恐裂，地无以宁将恐发（fèi，“发”通“废”），神无以灵将恐歇，谷无以盈将恐竭，万物无以生将恐灭，侯王无以贵高将恐蹶（jué）。故贵以贱为本，高以下为基。是以侯王自谓孤寡不穀（谷gǔ）。此非以贱为本邪（yé）？非乎？故致数（shuò）舆（yù）无舆。不欲琭（lù）琭如玉，珞（luò）珞如石。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十章】反者，道之动；弱者，道之用。天下万物生于有，有生于无。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十一章】 上士闻道，勤而行之；中士闻道，若存若亡；下士闻道，大笑之，不笑不足以为道。故建言有之：明道若昧，进道若退，夷道若颣（lèi）。上德若谷，大白若辱，广德若不足，建德若偷，质真若渝（yú）。大方无隅（yú），大器晚成，大音希声，大象无形。道隐无名，夫唯道善贷且成。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十二章】道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶（wù），唯孤寡不穀（谷gǔ），而王公以为称（chēng）。故物，或损之而益，或益之而损。人之所教（jiào），我亦教之。强梁者不得其死，吾将以为教父。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十三章】天下之至柔，驰骋天下之至坚，无有入无间，吾是以知无为之有益。不言之教，无为之益，天下希及之。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十四章】名与身孰亲？身与货孰多？得与亡孰病？ 是故甚爱必大费，多藏必厚亡。知足不辱，知止不殆，可以长久。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十五章】大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈，大巧若拙，大辩若讷。躁胜寒，静胜热。清静为天下正。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十六章】天下有道，却走马以粪；天下无道，戎马生于郊。祸莫大于不知足，咎莫大于欲得，故知足之足，常足矣。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十七章】不出户，知天下；不窥牖，见天道。其出弥远，其知弥少。是以圣人不行而知，不见而名，不为而成。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十八章】为学日益，为道日损。损之又损，以至于无为，无为而无不为。取天下常以无事，及其有事，不足以取天下。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第四十九章】圣人无常心，以百姓心为心。善者，吾善之；不善者，吾亦善之，德善。信者，吾信之；不信者，吾亦信之，德信。圣人在天下歙歙（xīxī），为天下浑其心。（百姓皆注其耳目），圣人皆孩之。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十章】出生入死。生之徒十有三，死之徒十有三。人之生动之死地，亦十有三。夫何故？以其生生之厚。盖闻善摄生者，陆行不遇兕（sì）虎，入军不被（pī）甲兵，兕无所投其角，虎无所措其爪（zhǎo），兵无所容其刃。夫何故？以其无死地。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十一章】道生之，德畜（xù）之，物形之，势成之。是以万物莫不尊道而贵德。道之尊，德之贵，夫莫之命而常自然。故道生之，德畜之。长之、育之、亭之、毒之、养之、覆之。生而不有，为而不恃，长（zhǎng）而不宰，是谓玄德。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十二章】天下有始，以为天下母。既得其母，以知其子；既知其子，复守其母，没（mò）身不殆。塞（sè）其兑，闭其门，终身不勤。开其兑，济其事，终身不救。见（jiàn）小曰明，守柔曰强。用其光，复归其明，无遗身殃，是为习常。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十三章】使我介然有知，行于大道，唯施（迤yí）是畏。大道甚夷，而民好径。朝（cháo）甚除，田甚芜，仓甚虚。服文彩，带利剑，厌饮食，财货有余，是为盗夸。非道也哉！ ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十四章】善建者不拔，善抱者不脱，子孙以祭祀不辍。修之于身，其德乃真；修之于家，其德乃余；修之于乡，其德乃长（zhǎng）；修之于国，其德乃丰；修之于天下，其德乃普。故以身观身，以家观家，以乡观乡，以国观国，以天下观天下。吾何以知天下然哉？以此。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十五章】 含德之厚，比于赤子。蜂虿（chài）虺（huǐ）蛇不螫(shì)，猛兽不据，攫(jué)鸟不搏。骨弱筋柔而握固。未知牝牡之合而全作，精之至也。终日号而不嗄（shà），和之至也。知和曰常，知常曰明，益生曰祥，心使气曰强。物壮则老，谓之不道，不道早已。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十六章】知（zhì）者不言，言者不知（zhì）。塞（sè）其兑，闭其门，挫其锐；解其纷，和其光，同其尘，是谓玄同。故不可得而亲，不可得而疏；不可得而利，不可得而害；不可得而贵，不可得而贱，故为天下贵。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十七章】以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳，而民弥贫；民多利器，国家滋昏；人多伎（jì）巧，奇物滋起；法令滋彰，盗贼多有。故圣人云：“我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。” ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十八章】其政闷闷，其民淳淳；其政察察，其民缺缺。祸兮福之所倚，福兮祸之所伏。孰知其极？其无正。正复为奇，善复为妖，人之迷，其日固久。是以圣人方而不割，廉而不刿（guì），直而不肆，光而不耀。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第五十九章】治人事天莫若啬（sè）。夫唯啬，是谓早服。早服谓之重(chóng)积德，重(chóng)积德则无不克，无不克则莫知其极，莫知其极，可以有国。有国之母，可以长久。是谓深根固柢（dǐ），长生久视之道。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十章】治大国若烹小鲜。以道莅（lì）天下，其鬼不神。非其鬼不神，其神不伤人；非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十一章】大国者下流。天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国；小国以下大国，则取大国。故或下以取，或下而取。大国不过欲兼畜（xù）人，小国不过欲入事人，夫两者各得其所欲，大者宜为下。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十二章】道者万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有！故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何？不曰以求得，有罪以免邪（yé）？故为天下贵。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十三章】为无为，事无事，味无味。大小多少，报怨以德。图难于其易，为大于其细。天下难事必作于易，天下大事必作于细，是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难，是以圣人犹难之。故终无难矣。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十四章】其安易持，其未兆易谋，其脆易泮（pàn），其微易散。为之于未有，治之于未乱。合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。为者败之，执者失之。是以圣人无为，故无败；无执，故无失。民之从事，常于几成而败之。慎终如始，则无败事。是以圣人欲不欲，不贵难得之货。学不学，复众人之所过。以辅万物之自然，而不敢为。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十五章】古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国，国之贼；不以智治国，国之福。知此两者，亦稽（jī）式。常知稽式，是谓玄德。玄德深矣，远矣，与物反矣，然后乃至大顺。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十六章】江海所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之；欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十七章】天下皆谓我道大，似不肖（xiào）。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之。一曰慈，二曰俭，三曰不敢为天下先。慈，故能勇；俭，故能广；不敢为天下先，故能成器长（zhǎng）。今舍慈且勇，舍俭且广，舍后且先，死矣！夫慈，以战则胜，以守则固，天将救之，以慈卫之。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十八章】善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天古之极。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第六十九章】用兵有言，吾不敢为主而为客，不敢进寸而退尺。是谓行（xíng）无行（háng），攘(rǎng)无臂，扔无敌，执无兵。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相加，哀者胜矣。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十章】吾言甚易知，甚易行，天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵，是以圣人被（pī，“被”同“披”）褐怀玉。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十一章】知不知，上；不知知，病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十二章】民不畏威，则大威至。无狎（xiá）其所居，无厌（yà，“厌”同“压”）其所生。夫唯不厌（yà，“厌”同“压”），是以不厌(yàn)。是以圣人自知，不自见（xiàn）；自爱，不自贵。故去彼取此。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十三章】勇于敢则杀，勇于不敢则活。此两者，或利或害。天之所恶（wù），孰知其故？是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟（chǎn）然而善谋。天网恢恢，疏而不失。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十四章】民不畏死，奈何以死惧之！若使民常畏死，而为奇者，吾得执而杀之，孰敢？常有司杀者杀，夫代司杀者杀，是谓代大匠斫（zhuó）。夫代大匠斫者，希有不伤其手矣。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十五章】民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十六章】人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十七章】天之道，其犹张弓与！高者抑之，下者举之；有余者损之，不足者补之。天之道，损有余而补不足。人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见（xiàn）贤。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十八章】天下莫柔弱于水，而攻坚强者莫之能胜，其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云，受国之垢，是谓社稷主；受国不祥，是为天下王。正言若反。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第七十九章】和大怨，必有余怨，安可以为善？是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第八十章】小国寡民，使有什伯（bǎi）之器而不用，使民重（zhòng）死而不远徙(xí)。虽有舟舆，无所乘之；虽有甲兵，无所陈之；使人复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。 ",
        data: [
            { context: "【译文】" },
        ]
    },{
        title: "【第八十一章】信言不美，美言不信；善者不辩，辩者不善；知（zhì）者不博，博者不知（zhì）。圣人不积，既以为人，己愈有；既以与人，己愈多。天之道，利而不害。圣人之道，为而不争。",
        data: [
            { context: "【译文】" },
        ]
    },
]
}
data = [demo]
